
using System;
using System.Data.SqlClient;
using V82;
using V82.ДокументыСсылка;
using V82.Документы;//Менеджер;
using V82.ДокументыСсылка;
using V82.Перечисления;//Ссылка;
namespace V82.Документы//Менеджер
{
	///<summary>
	///(Общ)
	///</summary>
	public partial class РасчетСебестоимостиВыпуска:ДокументМенеджер
	{
		
		public static ДокументыСсылка.РасчетСебестоимостиВыпуска НайтиПоСсылке(Guid _Ссылка)
		{
			using (var Подключение = new SqlConnection(СтрокаСоединения))
			{
				Подключение.Open();
				using (var Команда = Подключение.CreateCommand())
				{
					Команда.CommandText = @"Select top 1 
					_IDRRef [Ссылка]
					,_Version [Версия]
					,_Marked [ПометкаУдаления]
					,_Fld15611 [Комментарий]
					,_Fld15612RRef [Организация]
					,_Fld15613RRef [Ответственный]
					,_Fld15614 [ОтражатьВБухгалтерскомУчете]
					,_Fld15615 [ОтражатьВМеждународномУчете]
					,_Fld15616 [ОтражатьВНалоговомУчете]
					,_Fld15617 [ОтражатьВУправленческомУчете]
					,_Fld15618 [ПериодРегистрации]
					,_Fld15619 [УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам]
					,_Fld15620RRef [НастройкаЗакрытияМесяца]
					From _Document558(NOLOCK)
					Where _IDRRef=@Ссылка";
					Команда.Parameters.AddWithValue("Ссылка", _Ссылка);
					using (var Читалка = Команда.ExecuteReader())
					{
						if (Читалка.Read())
						{
							var Ссылка = new ДокументыСсылка.РасчетСебестоимостиВыпуска();
							//ToDo: Читать нужно через GetValues()
							Ссылка.Ссылка = new Guid((byte[])Читалка.GetValue(0));
							var ПотокВерсии = ((byte[])Читалка.GetValue(1));
							Array.Reverse(ПотокВерсии);
							Ссылка.Версия =  BitConverter.ToInt64(ПотокВерсии, 0);
							Ссылка.ВерсияДанных =  Convert.ToBase64String(ПотокВерсии);
							Ссылка.ПометкаУдаления = ((byte[])Читалка.GetValue(2))[0]==1;
							Ссылка.Комментарий = Читалка.GetString(3);
							Ссылка.ОтражатьВБухгалтерскомУчете = ((byte[])Читалка.GetValue(6))[0]==1;
							Ссылка.ОтражатьВМеждународномУчете = ((byte[])Читалка.GetValue(7))[0]==1;
							Ссылка.ОтражатьВНалоговомУчете = ((byte[])Читалка.GetValue(8))[0]==1;
							Ссылка.ОтражатьВУправленческомУчете = ((byte[])Читалка.GetValue(9))[0]==1;
							Ссылка.ПериодРегистрации = Читалка.GetDateTime(10);
							Ссылка.УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам = ((byte[])Читалка.GetValue(11))[0]==1;
							return Ссылка;
						}
						else
						{
							return null;
						}
					}
				}
			}
		}
		
		public static ДокументыСсылка.РасчетСебестоимостиВыпуска НайтиПоНомеру(string Номер)
		{
			using (var Подключение = new SqlConnection(СтрокаСоединения))
			{
				Подключение.Open();
				using (var Команда = Подключение.CreateCommand())
				{
					Команда.CommandText = @"Select top 1 
					_IDRRef [Ссылка]
					,_Version [Версия]
					,_Marked [ПометкаУдаления]
					,_Fld15611 [Комментарий]
					,_Fld15612RRef [Организация]
					,_Fld15613RRef [Ответственный]
					,_Fld15614 [ОтражатьВБухгалтерскомУчете]
					,_Fld15615 [ОтражатьВМеждународномУчете]
					,_Fld15616 [ОтражатьВНалоговомУчете]
					,_Fld15617 [ОтражатьВУправленческомУчете]
					,_Fld15618 [ПериодРегистрации]
					,_Fld15619 [УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам]
					,_Fld15620RRef [НастройкаЗакрытияМесяца]
					From _Document558(NOLOCK)
					Where _Number = @Номер";
					Команда.Parameters.AddWithValue("Номер", Номер);
					using (var Читалка = Команда.ExecuteReader())
					{
						if (Читалка.Read())
						{
							var Ссылка = new ДокументыСсылка.РасчетСебестоимостиВыпуска();
							//ToDo: Читать нужно через GetValues()
							Ссылка.Ссылка = new Guid((byte[])Читалка.GetValue(0));
							var ПотокВерсии = ((byte[])Читалка.GetValue(1));
							Array.Reverse(ПотокВерсии);
							Ссылка.Версия =  BitConverter.ToInt64(ПотокВерсии, 0);
							Ссылка.ВерсияДанных =  Convert.ToBase64String(ПотокВерсии);
							Ссылка.ПометкаУдаления = ((byte[])Читалка.GetValue(2))[0]==1;
							Ссылка.Комментарий = Читалка.GetString(3);
							Ссылка.ОтражатьВБухгалтерскомУчете = ((byte[])Читалка.GetValue(6))[0]==1;
							Ссылка.ОтражатьВМеждународномУчете = ((byte[])Читалка.GetValue(7))[0]==1;
							Ссылка.ОтражатьВНалоговомУчете = ((byte[])Читалка.GetValue(8))[0]==1;
							Ссылка.ОтражатьВУправленческомУчете = ((byte[])Читалка.GetValue(9))[0]==1;
							Ссылка.ПериодРегистрации = Читалка.GetDateTime(10);
							Ссылка.УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам = ((byte[])Читалка.GetValue(11))[0]==1;
							return Ссылка;
						}
						else
						{
							return null;
						}
					}
				}
			}
		}
		
		public static ДокументыВыборка.РасчетСебестоимостиВыпуска Выбрать()
		{
			using (var Подключение = new SqlConnection(СтрокаСоединения))
			{
				Подключение.Open();
				using (var Команда = Подключение.CreateCommand())
				{
					Команда.CommandText = @"Select top 1000 
					_IDRRef [Ссылка]
					,_Version [Версия]
					,_Marked [ПометкаУдаления]
					,_Fld15611 [Комментарий]
					,_Fld15612RRef [Организация]
					,_Fld15613RRef [Ответственный]
					,_Fld15614 [ОтражатьВБухгалтерскомУчете]
					,_Fld15615 [ОтражатьВМеждународномУчете]
					,_Fld15616 [ОтражатьВНалоговомУчете]
					,_Fld15617 [ОтражатьВУправленческомУчете]
					,_Fld15618 [ПериодРегистрации]
					,_Fld15619 [УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам]
					,_Fld15620RRef [НастройкаЗакрытияМесяца]
					From _Document558(NOLOCK)";
					var Выборка = new V82.ДокументыВыборка.РасчетСебестоимостиВыпуска();
					using (var Читалка = Команда.ExecuteReader())
					{
						while (Читалка.Read())
						{
							var Ссылка = new ДокументыСсылка.РасчетСебестоимостиВыпуска();
							//ToDo: Читать нужно через GetValues()
							Ссылка.Ссылка = new Guid((byte[])Читалка.GetValue(0));
							var ПотокВерсии = ((byte[])Читалка.GetValue(1));
							Array.Reverse(ПотокВерсии);
							Ссылка.Версия =  BitConverter.ToInt64(ПотокВерсии, 0);
							Ссылка.ВерсияДанных =  Convert.ToBase64String(ПотокВерсии);
							Ссылка.ПометкаУдаления = ((byte[])Читалка.GetValue(2))[0]==1;
							Ссылка.Комментарий = Читалка.GetString(3);
							Ссылка.ОтражатьВБухгалтерскомУчете = ((byte[])Читалка.GetValue(6))[0]==1;
							Ссылка.ОтражатьВМеждународномУчете = ((byte[])Читалка.GetValue(7))[0]==1;
							Ссылка.ОтражатьВНалоговомУчете = ((byte[])Читалка.GetValue(8))[0]==1;
							Ссылка.ОтражатьВУправленческомУчете = ((byte[])Читалка.GetValue(9))[0]==1;
							Ссылка.ПериодРегистрации = Читалка.GetDateTime(10);
							Ссылка.УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам = ((byte[])Читалка.GetValue(11))[0]==1;
							Выборка.Add(Ссылка);
						}
							return Выборка;
					}
				}
			}
		}
		
		public static ДокументыВыборка.РасчетСебестоимостиВыпуска ВыбратьПоСсылке(int Первые,Guid Мин,Guid Макс)
		{
			using (var Подключение = new SqlConnection(СтрокаСоединения))
			{
				Подключение.Open();
				using (var Команда = Подключение.CreateCommand())
				{
					Команда.CommandText = string.Format(@"Select top {0} 
					_IDRRef [Ссылка]
					,_Version [Версия]
					,_Marked [ПометкаУдаления]
					,_Fld15611 [Комментарий]
					,_Fld15612RRef [Организация]
					,_Fld15613RRef [Ответственный]
					,_Fld15614 [ОтражатьВБухгалтерскомУчете]
					,_Fld15615 [ОтражатьВМеждународномУчете]
					,_Fld15616 [ОтражатьВНалоговомУчете]
					,_Fld15617 [ОтражатьВУправленческомУчете]
					,_Fld15618 [ПериодРегистрации]
					,_Fld15619 [УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам]
					,_Fld15620RRef [НастройкаЗакрытияМесяца]
					From _Document558(NOLOCK)
					Where _IDRRef between @Мин and @Макс
					Order by _IDRRef", Первые);
					Команда.Parameters.AddWithValue("Мин", Мин);
					Команда.Parameters.AddWithValue("Макс", Макс);
					var Выборка = new V82.ДокументыВыборка.РасчетСебестоимостиВыпуска();
					using (var Читалка = Команда.ExecuteReader())
					{
						while (Читалка.Read())
						{
							var Ссылка = new ДокументыСсылка.РасчетСебестоимостиВыпуска();
							//ToDo: Читать нужно через GetValues()
							Ссылка.Ссылка = new Guid((byte[])Читалка.GetValue(0));
							var ПотокВерсии = ((byte[])Читалка.GetValue(1));
							Array.Reverse(ПотокВерсии);
							Ссылка.Версия =  BitConverter.ToInt64(ПотокВерсии, 0);
							Ссылка.ВерсияДанных =  Convert.ToBase64String(ПотокВерсии);
							Ссылка.ПометкаУдаления = ((byte[])Читалка.GetValue(2))[0]==1;
							Ссылка.Комментарий = Читалка.GetString(3);
							Ссылка.ОтражатьВБухгалтерскомУчете = ((byte[])Читалка.GetValue(6))[0]==1;
							Ссылка.ОтражатьВМеждународномУчете = ((byte[])Читалка.GetValue(7))[0]==1;
							Ссылка.ОтражатьВНалоговомУчете = ((byte[])Читалка.GetValue(8))[0]==1;
							Ссылка.ОтражатьВУправленческомУчете = ((byte[])Читалка.GetValue(9))[0]==1;
							Ссылка.ПериодРегистрации = Читалка.GetDateTime(10);
							Ссылка.УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам = ((byte[])Читалка.GetValue(11))[0]==1;
							Выборка.Add(Ссылка);
						}
							return Выборка;
					}
				}
			}
		}
		
		public static ДокументыВыборка.РасчетСебестоимостиВыпуска ВыбратьПоНомеру(int Первые,string Мин,string Макс)
		{
			using (var Подключение = new SqlConnection(СтрокаСоединения))
			{
				Подключение.Open();
				using (var Команда = Подключение.CreateCommand())
				{
					Команда.CommandText = string.Format(@"Select top {0} 
					_IDRRef [Ссылка]
					,_Version [Версия]
					,_Marked [ПометкаУдаления]
					,_Fld15611 [Комментарий]
					,_Fld15612RRef [Организация]
					,_Fld15613RRef [Ответственный]
					,_Fld15614 [ОтражатьВБухгалтерскомУчете]
					,_Fld15615 [ОтражатьВМеждународномУчете]
					,_Fld15616 [ОтражатьВНалоговомУчете]
					,_Fld15617 [ОтражатьВУправленческомУчете]
					,_Fld15618 [ПериодРегистрации]
					,_Fld15619 [УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам]
					,_Fld15620RRef [НастройкаЗакрытияМесяца]
					From _Document558(NOLOCK)
					Where _Code between @Мин and @Макс
					Order by _Code", Первые);
					Команда.Parameters.AddWithValue("Мин", Мин);
					Команда.Parameters.AddWithValue("Макс", Макс);
					var Выборка = new V82.ДокументыВыборка.РасчетСебестоимостиВыпуска();
					using (var Читалка = Команда.ExecuteReader())
					{
						while (Читалка.Read())
						{
							var Ссылка = new ДокументыСсылка.РасчетСебестоимостиВыпуска();
							//ToDo: Читать нужно через GetValues()
							Ссылка.Ссылка = new Guid((byte[])Читалка.GetValue(0));
							var ПотокВерсии = ((byte[])Читалка.GetValue(1));
							Array.Reverse(ПотокВерсии);
							Ссылка.Версия =  BitConverter.ToInt64(ПотокВерсии, 0);
							Ссылка.ВерсияДанных =  Convert.ToBase64String(ПотокВерсии);
							Ссылка.ПометкаУдаления = ((byte[])Читалка.GetValue(2))[0]==1;
							Ссылка.Комментарий = Читалка.GetString(3);
							Ссылка.ОтражатьВБухгалтерскомУчете = ((byte[])Читалка.GetValue(6))[0]==1;
							Ссылка.ОтражатьВМеждународномУчете = ((byte[])Читалка.GetValue(7))[0]==1;
							Ссылка.ОтражатьВНалоговомУчете = ((byte[])Читалка.GetValue(8))[0]==1;
							Ссылка.ОтражатьВУправленческомУчете = ((byte[])Читалка.GetValue(9))[0]==1;
							Ссылка.ПериодРегистрации = Читалка.GetDateTime(10);
							Ссылка.УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам = ((byte[])Читалка.GetValue(11))[0]==1;
							Выборка.Add(Ссылка);
						}
							return Выборка;
					}
				}
			}
		}
		
		public static ДокументыВыборка.РасчетСебестоимостиВыпуска СтраницаПоСсылке(int Размер,int Номер)
		{
			using (var Подключение = new SqlConnection(СтрокаСоединения))
			{
				Подключение.Open();
				using (var Команда = Подключение.CreateCommand())
				{
					Команда.CommandText = @"Select top 1000 
					_IDRRef [Ссылка]
					,_Version [Версия]
					,_Marked [ПометкаУдаления]
					,_Fld15611 [Комментарий]
					,_Fld15612RRef [Организация]
					,_Fld15613RRef [Ответственный]
					,_Fld15614 [ОтражатьВБухгалтерскомУчете]
					,_Fld15615 [ОтражатьВМеждународномУчете]
					,_Fld15616 [ОтражатьВНалоговомУчете]
					,_Fld15617 [ОтражатьВУправленческомУчете]
					,_Fld15618 [ПериодРегистрации]
					,_Fld15619 [УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам]
					,_Fld15620RRef [НастройкаЗакрытияМесяца]
					From _Document558(NOLOCK)";
					var Выборка = new V82.ДокументыВыборка.РасчетСебестоимостиВыпуска();
					using (var Читалка = Команда.ExecuteReader())
					{
						while (Читалка.Read())
						{
							var Ссылка = new ДокументыСсылка.РасчетСебестоимостиВыпуска();
							//ToDo: Читать нужно через GetValues()
							Ссылка.Ссылка = new Guid((byte[])Читалка.GetValue(0));
							var ПотокВерсии = ((byte[])Читалка.GetValue(1));
							Array.Reverse(ПотокВерсии);
							Ссылка.Версия =  BitConverter.ToInt64(ПотокВерсии, 0);
							Ссылка.ВерсияДанных =  Convert.ToBase64String(ПотокВерсии);
							Ссылка.ПометкаУдаления = ((byte[])Читалка.GetValue(2))[0]==1;
							Ссылка.Комментарий = Читалка.GetString(3);
							Ссылка.ОтражатьВБухгалтерскомУчете = ((byte[])Читалка.GetValue(6))[0]==1;
							Ссылка.ОтражатьВМеждународномУчете = ((byte[])Читалка.GetValue(7))[0]==1;
							Ссылка.ОтражатьВНалоговомУчете = ((byte[])Читалка.GetValue(8))[0]==1;
							Ссылка.ОтражатьВУправленческомУчете = ((byte[])Читалка.GetValue(9))[0]==1;
							Ссылка.ПериодРегистрации = Читалка.GetDateTime(10);
							Ссылка.УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам = ((byte[])Читалка.GetValue(11))[0]==1;
							Выборка.Add(Ссылка);
						}
							return Выборка;
					}
				}
			}
		}
		
		public static ДокументыВыборка.РасчетСебестоимостиВыпуска СтраницаПоНомеру(int Размер,int Номер)
		{
			using (var Подключение = new SqlConnection(СтрокаСоединения))
			{
				Подключение.Open();
				using (var Команда = Подключение.CreateCommand())
				{
					Команда.CommandText = @"Select top 1000 
					_IDRRef [Ссылка]
					,_Version [Версия]
					,_Marked [ПометкаУдаления]
					,_Fld15611 [Комментарий]
					,_Fld15612RRef [Организация]
					,_Fld15613RRef [Ответственный]
					,_Fld15614 [ОтражатьВБухгалтерскомУчете]
					,_Fld15615 [ОтражатьВМеждународномУчете]
					,_Fld15616 [ОтражатьВНалоговомУчете]
					,_Fld15617 [ОтражатьВУправленческомУчете]
					,_Fld15618 [ПериодРегистрации]
					,_Fld15619 [УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам]
					,_Fld15620RRef [НастройкаЗакрытияМесяца]
					From _Document558(NOLOCK)";
					var Выборка = new V82.ДокументыВыборка.РасчетСебестоимостиВыпуска();
					using (var Читалка = Команда.ExecuteReader())
					{
						while (Читалка.Read())
						{
							var Ссылка = new ДокументыСсылка.РасчетСебестоимостиВыпуска();
							//ToDo: Читать нужно через GetValues()
							Ссылка.Ссылка = new Guid((byte[])Читалка.GetValue(0));
							var ПотокВерсии = ((byte[])Читалка.GetValue(1));
							Array.Reverse(ПотокВерсии);
							Ссылка.Версия =  BitConverter.ToInt64(ПотокВерсии, 0);
							Ссылка.ВерсияДанных =  Convert.ToBase64String(ПотокВерсии);
							Ссылка.ПометкаУдаления = ((byte[])Читалка.GetValue(2))[0]==1;
							Ссылка.Комментарий = Читалка.GetString(3);
							Ссылка.ОтражатьВБухгалтерскомУчете = ((byte[])Читалка.GetValue(6))[0]==1;
							Ссылка.ОтражатьВМеждународномУчете = ((byte[])Читалка.GetValue(7))[0]==1;
							Ссылка.ОтражатьВНалоговомУчете = ((byte[])Читалка.GetValue(8))[0]==1;
							Ссылка.ОтражатьВУправленческомУчете = ((byte[])Читалка.GetValue(9))[0]==1;
							Ссылка.ПериодРегистрации = Читалка.GetDateTime(10);
							Ссылка.УчитыватьОбщепроизводственныеРасходыПриРаспределенииПоПеределам = ((byte[])Читалка.GetValue(11))[0]==1;
							Выборка.Add(Ссылка);
						}
							return Выборка;
					}
				}
			}
		}
		
		public static V82.ДокументыОбъект.РасчетСебестоимостиВыпуска СоздатьЭлемент()
		{
			var Объект = new V82.ДокументыОбъект.РасчетСебестоимостиВыпуска();
			Объект._ЭтоНовый = true;
			Объект.Ссылка = Guid.NewGuid();/*http://msdn.microsoft.com/ru-ru/library/aa379322(VS.85).aspx*/
			Объект.Комментарий = "";
			return Объект;
		}
	}
}