
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(ќбщ)
		///</summary>
	public enum ¬идыќперацийќтчетќ–озничныхѕродажах
	{
		ѕуста€—сылка = - 1,
		ќтчет  ћќѕродажах = 0,//  ћ
		ќтчетЌ““ќѕродажах = 1,//Ќ““
	}
	public static partial class ¬идыќперацийќтчетќ–озничныхѕродажах_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid ќтчет  ћќѕродажах = new Guid("28986091-a1ea-1d2f-42cb-4fc121e89a2c");//  ћ
		public static readonly Guid ќтчетЌ““ќѕродажах = new Guid("0fd68bb8-47b4-d991-40f5-55cc0f48acd9");//Ќ““
		public static ¬идыќперацийќтчетќ–озничныхѕродажах ѕолучить(this ¬идыќперацийќтчетќ–озничныхѕродажах «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ¬идыќперацийќтчетќ–озничныхѕродажах ѕолучить(this ¬идыќперацийќтчетќ–озничныхѕродажах «начение, Guid —сылка)
		{
			if(—сылка == ќтчет  ћќѕродажах)
			{
				return ¬идыќперацийќтчетќ–озничныхѕродажах.ќтчет  ћќѕродажах;
			}
			else if(—сылка == ќтчетЌ““ќѕродажах)
			{
				return ¬идыќперацийќтчетќ–озничныхѕродажах.ќтчетЌ““ќѕродажах;
			}
			return ¬идыќперацийќтчетќ–озничныхѕродажах.ѕуста€—сылка;
		}
		public static byte[]  люч(this ¬идыќперацийќтчетќ–озничныхѕродажах «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ¬идыќперацийќтчетќ–озничныхѕродажах «начение)
		{
			switch («начение)
			{
				case ¬идыќперацийќтчетќ–озничныхѕродажах.ќтчет  ћќѕродажах: return ќтчет  ћќѕродажах;
				case ¬идыќперацийќтчетќ–озничныхѕродажах.ќтчетЌ““ќѕродажах: return ќтчетЌ““ќѕродажах;
			}
			return Guid.Empty;
		}
	}
}
