
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(ќбщ)
		///</summary>
	public enum ¬идыјктивов»ќб€зательств
	{
		ѕуста€—сылка = - 1,
	///<summary>
	///(ќбщ)
	///</summary>
		¬необоротныејктивы = 0,//¬необоротные активы
	///<summary>
	///(ќбщ)
	///</summary>
		√отова€ѕродукци€ = 1,//√отова€ продукци€
	///<summary>
	///(ќбщ)
	///</summary>
		ƒебиторска€«адолженность = 2,//ƒебиторска€ задолженность
	///<summary>
	///ƒоходные вложени€ в материальные ценности
	///</summary>
		ƒоходные¬ложени€¬_ћ÷ = 3,//ƒоходные вложени€ в материальные ценности
	///<summary>
	///(ќбщ)
	///</summary>
		ƒоходыЅудущихѕериодов = 4,//ƒоходы будущих периодов
	///<summary>
	///(ќбщ)
	///</summary>
		»здержкиќбращени€ = 5,//»здержки обращени€
	///<summary>
	///(ќбщ)
	///</summary>
		 редиторска€«адолженность = 6,// редиторска€ задолженность
	///<summary>
	/// урсовые разницы по расчетам в у.е.
	///</summary>
		 урсовые–азницыѕо–асчетам¬”≈ = 7,// урсовые разницы по расчетам в у.е.
	///<summary>
	///(ќбщ)
	///</summary>
		ћатериалы = 8,
		Ќедостачиѕотери = 9,//Ќедостачи и потери от порчи ценностей
	///<summary>
	///(ќбщ)
	///</summary>
		Ќезавершенноеѕроизводство = 10,//Ќезавершенное производство
	///<summary>
	///(ќбщ)
	///</summary>
		Ќематериальныејктивы = 11,//Ќематериальные активы
	///<summary>
	///(ќбщ)
	///</summary>
		ќборудование = 12,
	///<summary>
	///(ќбщ)
	///</summary>
		ќсновные—редства = 13,//ќсновные средства
		ќценочныеќб€зательства = 14,//ќценочные об€зательства и резервы
	///<summary>
	///(ќбщ)
	///</summary>
		ѕолуфабрикаты = 15,
	///<summary>
	///(ќбщ)
	///</summary>
		–асходыЅудущихѕериодов = 16,//–асходы будущих периодов
		–езервы—омнительныхƒолгов = 17,//–езервы сомнительных долгов
	///<summary>
	///(ќбщ)
	///</summary>
		“овары = 18,
	///<summary>
	///(ќбщ)
	///</summary>
		“оварыќтгруженные = 19,//“овары отгруженные
	///<summary>
	///(ќбщ)
	///</summary>
		”быток“екущегоѕериода = 20,//”быток текущего периода
	///<summary>
	///(ќбщ)
	///</summary>
		‘инансовые¬ложени€ = 21,//‘инансовые вложени€
	}
	public static partial class ¬идыјктивов»ќб€зательств_«начени€//:ѕеречисление—сылка
	{
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ¬необоротныејктивы = new Guid("b0dd6bbc-5f14-de8d-43d3-bf77e3a75427");//¬необоротные активы
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid √отова€ѕродукци€ = new Guid("04130b91-20e6-5d1e-4902-2af607c07568");//√отова€ продукци€
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ƒебиторска€«адолженность = new Guid("c4c6acbc-8d77-c4a4-424d-fcdf258cc312");//ƒебиторска€ задолженность
		///<summary>
		///ƒоходные вложени€ в материальные ценности
		///</summary>
		public static readonly Guid ƒоходные¬ложени€¬_ћ÷ = new Guid("490fd29c-e0bc-8a75-4d36-a5ea261dfeb3");//ƒоходные вложени€ в материальные ценности
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ƒоходыЅудущихѕериодов = new Guid("8e0c87bd-b061-29c2-4752-baea06cd1d50");//ƒоходы будущих периодов
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid »здержкиќбращени€ = new Guid("507e1fb9-d6b5-18dc-4fb1-cb412e868b02");//»здержки обращени€
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid  редиторска€«адолженность = new Guid("4c488fb2-df07-a984-4495-7973a0475adc");// редиторска€ задолженность
		///<summary>
		/// урсовые разницы по расчетам в у.е.
		///</summary>
		public static readonly Guid  урсовые–азницыѕо–асчетам¬”≈ = new Guid("dd2e8db9-f162-d253-4a33-a782cbba0c1a");// урсовые разницы по расчетам в у.е.
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ћатериалы = new Guid("54d23d83-4235-1f18-4004-dff21a5a3b0c");
		public static readonly Guid Ќедостачиѕотери = new Guid("eba3cdb0-4684-2c2f-4f4f-4686ae8bc94e");//Ќедостачи и потери от порчи ценностей
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid Ќезавершенноеѕроизводство = new Guid("5cdd0799-1e46-ccf0-481c-4b2a12c1cae1");//Ќезавершенное производство
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid Ќематериальныејктивы = new Guid("444fe9be-e25e-e6bf-4ef6-276e246e00e9");//Ќематериальные активы
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ќборудование = new Guid("b1b0f18d-b293-99b5-4de5-0216d0b17a30");
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ќсновные—редства = new Guid("d09662a5-308f-b4f5-4fbf-7531684266a6");//ќсновные средства
		public static readonly Guid ќценочныеќб€зательства = new Guid("03fb6097-973a-5a27-403d-160b6d1e753f");//ќценочные об€зательства и резервы
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ѕолуфабрикаты = new Guid("ffecbf85-2f7f-99ba-447b-951784281b04");
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid –асходыЅудущихѕериодов = new Guid("85d6f898-6a77-a7a1-4b6e-8f167c3dc925");//–асходы будущих периодов
		public static readonly Guid –езервы—омнительныхƒолгов = new Guid("9b3e1092-47da-d0e5-4899-86296d59923f");//–езервы сомнительных долгов
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid “овары = new Guid("9e2dac85-098a-10f5-47fd-576e5ac93b61");
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid “оварыќтгруженные = new Guid("cd635d9c-7055-4e67-4a2b-a79d587d80fd");//“овары отгруженные
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ”быток“екущегоѕериода = new Guid("ecdab79b-6826-64cd-4b05-f366e1f71fae");//”быток текущего периода
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ‘инансовые¬ложени€ = new Guid("d2211cb3-819f-4bf9-4208-0a0e96680546");//‘инансовые вложени€
		public static ¬идыјктивов»ќб€зательств ѕолучить(this ¬идыјктивов»ќб€зательств «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ¬идыјктивов»ќб€зательств ѕолучить(this ¬идыјктивов»ќб€зательств «начение, Guid —сылка)
		{
			if(—сылка == ¬необоротныејктивы)
			{
				return ¬идыјктивов»ќб€зательств.¬необоротныејктивы;
			}
			else if(—сылка == √отова€ѕродукци€)
			{
				return ¬идыјктивов»ќб€зательств.√отова€ѕродукци€;
			}
			else if(—сылка == ƒебиторска€«адолженность)
			{
				return ¬идыјктивов»ќб€зательств.ƒебиторска€«адолженность;
			}
			else if(—сылка == ƒоходные¬ложени€¬_ћ÷)
			{
				return ¬идыјктивов»ќб€зательств.ƒоходные¬ложени€¬_ћ÷;
			}
			else if(—сылка == ƒоходыЅудущихѕериодов)
			{
				return ¬идыјктивов»ќб€зательств.ƒоходыЅудущихѕериодов;
			}
			else if(—сылка == »здержкиќбращени€)
			{
				return ¬идыјктивов»ќб€зательств.»здержкиќбращени€;
			}
			else if(—сылка ==  редиторска€«адолженность)
			{
				return ¬идыјктивов»ќб€зательств. редиторска€«адолженность;
			}
			else if(—сылка ==  урсовые–азницыѕо–асчетам¬”≈)
			{
				return ¬идыјктивов»ќб€зательств. урсовые–азницыѕо–асчетам¬”≈;
			}
			else if(—сылка == ћатериалы)
			{
				return ¬идыјктивов»ќб€зательств.ћатериалы;
			}
			else if(—сылка == Ќедостачиѕотери)
			{
				return ¬идыјктивов»ќб€зательств.Ќедостачиѕотери;
			}
			else if(—сылка == Ќезавершенноеѕроизводство)
			{
				return ¬идыјктивов»ќб€зательств.Ќезавершенноеѕроизводство;
			}
			else if(—сылка == Ќематериальныејктивы)
			{
				return ¬идыјктивов»ќб€зательств.Ќематериальныејктивы;
			}
			else if(—сылка == ќборудование)
			{
				return ¬идыјктивов»ќб€зательств.ќборудование;
			}
			else if(—сылка == ќсновные—редства)
			{
				return ¬идыјктивов»ќб€зательств.ќсновные—редства;
			}
			else if(—сылка == ќценочныеќб€зательства)
			{
				return ¬идыјктивов»ќб€зательств.ќценочныеќб€зательства;
			}
			else if(—сылка == ѕолуфабрикаты)
			{
				return ¬идыјктивов»ќб€зательств.ѕолуфабрикаты;
			}
			else if(—сылка == –асходыЅудущихѕериодов)
			{
				return ¬идыјктивов»ќб€зательств.–асходыЅудущихѕериодов;
			}
			else if(—сылка == –езервы—омнительныхƒолгов)
			{
				return ¬идыјктивов»ќб€зательств.–езервы—омнительныхƒолгов;
			}
			else if(—сылка == “овары)
			{
				return ¬идыјктивов»ќб€зательств.“овары;
			}
			else if(—сылка == “оварыќтгруженные)
			{
				return ¬идыјктивов»ќб€зательств.“оварыќтгруженные;
			}
			else if(—сылка == ”быток“екущегоѕериода)
			{
				return ¬идыјктивов»ќб€зательств.”быток“екущегоѕериода;
			}
			else if(—сылка == ‘инансовые¬ложени€)
			{
				return ¬идыјктивов»ќб€зательств.‘инансовые¬ложени€;
			}
			return ¬идыјктивов»ќб€зательств.ѕуста€—сылка;
		}
		public static byte[]  люч(this ¬идыјктивов»ќб€зательств «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ¬идыјктивов»ќб€зательств «начение)
		{
			switch («начение)
			{
				case ¬идыјктивов»ќб€зательств.¬необоротныејктивы: return ¬необоротныејктивы;
				case ¬идыјктивов»ќб€зательств.√отова€ѕродукци€: return √отова€ѕродукци€;
				case ¬идыјктивов»ќб€зательств.ƒебиторска€«адолженность: return ƒебиторска€«адолженность;
				case ¬идыјктивов»ќб€зательств.ƒоходные¬ложени€¬_ћ÷: return ƒоходные¬ложени€¬_ћ÷;
				case ¬идыјктивов»ќб€зательств.ƒоходыЅудущихѕериодов: return ƒоходыЅудущихѕериодов;
				case ¬идыјктивов»ќб€зательств.»здержкиќбращени€: return »здержкиќбращени€;
				case ¬идыјктивов»ќб€зательств. редиторска€«адолженность: return  редиторска€«адолженность;
				case ¬идыјктивов»ќб€зательств. урсовые–азницыѕо–асчетам¬”≈: return  урсовые–азницыѕо–асчетам¬”≈;
				case ¬идыјктивов»ќб€зательств.ћатериалы: return ћатериалы;
				case ¬идыјктивов»ќб€зательств.Ќедостачиѕотери: return Ќедостачиѕотери;
				case ¬идыјктивов»ќб€зательств.Ќезавершенноеѕроизводство: return Ќезавершенноеѕроизводство;
				case ¬идыјктивов»ќб€зательств.Ќематериальныејктивы: return Ќематериальныејктивы;
				case ¬идыјктивов»ќб€зательств.ќборудование: return ќборудование;
				case ¬идыјктивов»ќб€зательств.ќсновные—редства: return ќсновные—редства;
				case ¬идыјктивов»ќб€зательств.ќценочныеќб€зательства: return ќценочныеќб€зательства;
				case ¬идыјктивов»ќб€зательств.ѕолуфабрикаты: return ѕолуфабрикаты;
				case ¬идыјктивов»ќб€зательств.–асходыЅудущихѕериодов: return –асходыЅудущихѕериодов;
				case ¬идыјктивов»ќб€зательств.–езервы—омнительныхƒолгов: return –езервы—омнительныхƒолгов;
				case ¬идыјктивов»ќб€зательств.“овары: return “овары;
				case ¬идыјктивов»ќб€зательств.“оварыќтгруженные: return “оварыќтгруженные;
				case ¬идыјктивов»ќб€зательств.”быток“екущегоѕериода: return ”быток“екущегоѕериода;
				case ¬идыјктивов»ќб€зательств.‘инансовые¬ложени€: return ‘инансовые¬ложени€;
			}
			return Guid.Empty;
		}
	}
}
