
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(ќбщ)
		///</summary>
	public enum ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой
	{
		ѕуста€—сылка = - 1,
	///<summary>
	///(ќбщ)
	///</summary>
		ќплатаѕокупател€ = 0,//ќплата от покупател€
	///<summary>
	///(ќбщ)
	///</summary>
		¬озвратƒенежных—редствѕокупателю = 1,//¬озврат денежных средств покупателю
	}
	public static partial class ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой_«начени€//:ѕеречисление—сылка
	{
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ќплатаѕокупател€ = new Guid("5ee86ba6-79c3-9cc7-440e-e4c20534815e");//ќплата от покупател€
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ¬озвратƒенежных—редствѕокупателю = new Guid("944bef8e-fc52-71ea-4026-41b6a0d63ad4");//¬озврат денежных средств покупателю
		public static ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой ѕолучить(this ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой ѕолучить(this ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой «начение, Guid —сылка)
		{
			if(—сылка == ќплатаѕокупател€)
			{
				return ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой.ќплатаѕокупател€;
			}
			else if(—сылка == ¬озвратƒенежных—редствѕокупателю)
			{
				return ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой.¬озвратƒенежных—редствѕокупателю;
			}
			return ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой.ѕуста€—сылка;
		}
		public static byte[]  люч(this ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой «начение)
		{
			switch («начение)
			{
				case ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой.ќплатаѕокупател€: return ќплатаѕокупател€;
				case ¬идыќперацийќплатаќтѕокупател€ѕлатежной артой.¬озвратƒенежных—редствѕокупателю: return ¬озвратƒенежных—редствѕокупателю;
			}
			return Guid.Empty;
		}
	}
}
