
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(ќбщ)
		///</summary>
	public enum ¬идыќпераций¬озврат“оваровќтѕокупател€
	{
		ѕуста€—сылка = - 1,
		ѕродажа омисси€ = 0,//продажа, комисси€
		ќборудование = 1,
	}
	public static partial class ¬идыќпераций¬озврат“оваровќтѕокупател€_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid ѕродажа омисси€ = new Guid("0fc67194-6b98-cbfc-4dbb-9bde546cc453");//продажа, комисси€
		public static readonly Guid ќборудование = new Guid("a5de9894-0b72-2c36-4cf0-249f184b70c6");
		public static ¬идыќпераций¬озврат“оваровќтѕокупател€ ѕолучить(this ¬идыќпераций¬озврат“оваровќтѕокупател€ «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ¬идыќпераций¬озврат“оваровќтѕокупател€ ѕолучить(this ¬идыќпераций¬озврат“оваровќтѕокупател€ «начение, Guid —сылка)
		{
			if(—сылка == ѕродажа омисси€)
			{
				return ¬идыќпераций¬озврат“оваровќтѕокупател€.ѕродажа омисси€;
			}
			else if(—сылка == ќборудование)
			{
				return ¬идыќпераций¬озврат“оваровќтѕокупател€.ќборудование;
			}
			return ¬идыќпераций¬озврат“оваровќтѕокупател€.ѕуста€—сылка;
		}
		public static byte[]  люч(this ¬идыќпераций¬озврат“оваровќтѕокупател€ «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ¬идыќпераций¬озврат“оваровќтѕокупател€ «начение)
		{
			switch («начение)
			{
				case ¬идыќпераций¬озврат“оваровќтѕокупател€.ѕродажа омисси€: return ѕродажа омисси€;
				case ¬идыќпераций¬озврат“оваровќтѕокупател€.ќборудование: return ќборудование;
			}
			return Guid.Empty;
		}
	}
}
