
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(ќбщ)
		///</summary>
	public enum ¬идыќтражени€¬”чете
	{
		ѕуста€—сылка = - 1,
		ќтражать¬”правленческом”чете = 0,//ќтражать в управленческом учете
		ќтражать¬Ѕухгалтерском”чете = 1,//ќтражать в бухгалтерском учете
		ќтражать¬Ќалоговом”чете = 2,//ќтражать в налоговом учете
		ќтражать¬ћеждународном”чете = 3,//ќтражать в международном учете
		ќтражать¬–егламентированном”чете = 4,//ќтражать в регламентированном учете
	}
	public static partial class ¬идыќтражени€¬”чете_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid ќтражать¬”правленческом”чете = new Guid("a269d9b1-e1f9-15f0-4ee7-1d984f363c7f");//ќтражать в управленческом учете
		public static readonly Guid ќтражать¬Ѕухгалтерском”чете = new Guid("f1575cb8-6648-8b5a-4aa8-cd5494d77ceb");//ќтражать в бухгалтерском учете
		public static readonly Guid ќтражать¬Ќалоговом”чете = new Guid("85146eb6-0c44-da12-4926-006ac39b1fab");//ќтражать в налоговом учете
		public static readonly Guid ќтражать¬ћеждународном”чете = new Guid("b30210b6-47e8-7db7-4baa-5c3f6762e392");//ќтражать в международном учете
		public static readonly Guid ќтражать¬–егламентированном”чете = new Guid("a880bcbd-9dcb-fe2e-468f-c04cc02dfacb");//ќтражать в регламентированном учете
		public static ¬идыќтражени€¬”чете ѕолучить(this ¬идыќтражени€¬”чете «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ¬идыќтражени€¬”чете ѕолучить(this ¬идыќтражени€¬”чете «начение, Guid —сылка)
		{
			if(—сылка == ќтражать¬”правленческом”чете)
			{
				return ¬идыќтражени€¬”чете.ќтражать¬”правленческом”чете;
			}
			else if(—сылка == ќтражать¬Ѕухгалтерском”чете)
			{
				return ¬идыќтражени€¬”чете.ќтражать¬Ѕухгалтерском”чете;
			}
			else if(—сылка == ќтражать¬Ќалоговом”чете)
			{
				return ¬идыќтражени€¬”чете.ќтражать¬Ќалоговом”чете;
			}
			else if(—сылка == ќтражать¬ћеждународном”чете)
			{
				return ¬идыќтражени€¬”чете.ќтражать¬ћеждународном”чете;
			}
			else if(—сылка == ќтражать¬–егламентированном”чете)
			{
				return ¬идыќтражени€¬”чете.ќтражать¬–егламентированном”чете;
			}
			return ¬идыќтражени€¬”чете.ѕуста€—сылка;
		}
		public static byte[]  люч(this ¬идыќтражени€¬”чете «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ¬идыќтражени€¬”чете «начение)
		{
			switch («начение)
			{
				case ¬идыќтражени€¬”чете.ќтражать¬”правленческом”чете: return ќтражать¬”правленческом”чете;
				case ¬идыќтражени€¬”чете.ќтражать¬Ѕухгалтерском”чете: return ќтражать¬Ѕухгалтерском”чете;
				case ¬идыќтражени€¬”чете.ќтражать¬Ќалоговом”чете: return ќтражать¬Ќалоговом”чете;
				case ¬идыќтражени€¬”чете.ќтражать¬ћеждународном”чете: return ќтражать¬ћеждународном”чете;
				case ¬идыќтражени€¬”чете.ќтражать¬–егламентированном”чете: return ќтражать¬–егламентированном”чете;
			}
			return Guid.Empty;
		}
	}
}
