
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
	public enum ¬иды—правокќ–ождении–ебенка
	{
		ѕуста€—сылка = - 1,
		‘ормаЌомер24 = 0,//форма є 24
		‘ормаЌомер25 = 1,//форма є 25
		‘ормаЌомер26 = 2,//форма є 26
	}
	public static partial class ¬иды—правокќ–ождении–ебенка_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid ‘ормаЌомер24 = new Guid("565db8af-8d15-5454-4be7-df60be38aac3");//форма є 24
		public static readonly Guid ‘ормаЌомер25 = new Guid("e4a6138f-8cc0-84e5-4ae1-25a724caa7f2");//форма є 25
		public static readonly Guid ‘ормаЌомер26 = new Guid("6603d494-dc40-076b-418b-39bcd884eead");//форма є 26
		public static ¬иды—правокќ–ождении–ебенка ѕолучить(this ¬иды—правокќ–ождении–ебенка «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ¬иды—правокќ–ождении–ебенка ѕолучить(this ¬иды—правокќ–ождении–ебенка «начение, Guid —сылка)
		{
			if(—сылка == ‘ормаЌомер24)
			{
				return ¬иды—правокќ–ождении–ебенка.‘ормаЌомер24;
			}
			else if(—сылка == ‘ормаЌомер25)
			{
				return ¬иды—правокќ–ождении–ебенка.‘ормаЌомер25;
			}
			else if(—сылка == ‘ормаЌомер26)
			{
				return ¬иды—правокќ–ождении–ебенка.‘ормаЌомер26;
			}
			return ¬иды—правокќ–ождении–ебенка.ѕуста€—сылка;
		}
		public static byte[]  люч(this ¬иды—правокќ–ождении–ебенка «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ¬иды—правокќ–ождении–ебенка «начение)
		{
			switch («начение)
			{
				case ¬иды—правокќ–ождении–ебенка.‘ормаЌомер24: return ‘ормаЌомер24;
				case ¬иды—правокќ–ождении–ебенка.‘ормаЌомер25: return ‘ормаЌомер25;
				case ¬иды—правокќ–ождении–ебенка.‘ормаЌомер26: return ‘ормаЌомер26;
			}
			return Guid.Empty;
		}
	}
}
