
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(ќбщ)
		///</summary>
	public enum ¬идыќпераций–езервирование“оваров
	{
		ѕуста€—сылка = - 1,
	///<summary>
	///(ќбщ)
	///</summary>
		ѕо—кладам = 0,//по складам
	///<summary>
	///(”пр)
	///</summary>
		ѕо«аказам = 1,//по заказам
	///<summary>
	///(ќбщ)
	///</summary>
		ѕо—кладам»«аказам = 2,//по складам и заказам
	}
	public static partial class ¬идыќпераций–езервирование“оваров_«начени€//:ѕеречисление—сылка
	{
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ѕо—кладам = new Guid("7802cbaa-9206-f5bf-4de3-08844ddcfcf6");//по складам
		///<summary>
		///(”пр)
		///</summary>
		public static readonly Guid ѕо«аказам = new Guid("ac79318d-e951-0152-4ef7-c4ca586b1d67");//по заказам
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ѕо—кладам»«аказам = new Guid("0547bc92-70f8-db37-4cb4-68c67ff0de64");//по складам и заказам
		public static ¬идыќпераций–езервирование“оваров ѕолучить(this ¬идыќпераций–езервирование“оваров «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ¬идыќпераций–езервирование“оваров ѕолучить(this ¬идыќпераций–езервирование“оваров «начение, Guid —сылка)
		{
			if(—сылка == ѕо—кладам)
			{
				return ¬идыќпераций–езервирование“оваров.ѕо—кладам;
			}
			else if(—сылка == ѕо«аказам)
			{
				return ¬идыќпераций–езервирование“оваров.ѕо«аказам;
			}
			else if(—сылка == ѕо—кладам»«аказам)
			{
				return ¬идыќпераций–езервирование“оваров.ѕо—кладам»«аказам;
			}
			return ¬идыќпераций–езервирование“оваров.ѕуста€—сылка;
		}
		public static byte[]  люч(this ¬идыќпераций–езервирование“оваров «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ¬идыќпераций–езервирование“оваров «начение)
		{
			switch («начение)
			{
				case ¬идыќпераций–езервирование“оваров.ѕо—кладам: return ѕо—кладам;
				case ¬идыќпераций–езервирование“оваров.ѕо«аказам: return ѕо«аказам;
				case ¬идыќпераций–езервирование“оваров.ѕо—кладам»«аказам: return ѕо—кладам»«аказам;
			}
			return Guid.Empty;
		}
	}
}
