
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(–егл)
		///</summary>
	public enum ¬идыЌачисленийќплаты“рудаѕо—т255Ќ 
	{
		ѕуста€—сылка = - 1,
		пп1ст255 = 0,//пп.1, ст.255 Ќ  –‘
		пп2ст255 = 1,//пп.2, ст.255 Ќ  –‘
		пп3ст255 = 2,//пп.3, ст.255 Ќ  –‘
		пп4ст255 = 3,//пп.4, ст.255 Ќ  –‘
		пп5ст255 = 4,//пп.5, ст.255 Ќ  –‘
		пп6ст255 = 5,//пп.6, ст.255 Ќ  –‘
		пп7ст255 = 6,//пп.7, ст.255 Ќ  –‘
		пп8ст255 = 7,//пп.8, ст.255 Ќ  –‘
		пп9ст255 = 8,//пп.9, ст.255 Ќ  –‘
		пп10ст255 = 9,//пп.10, ст.255 Ќ  –‘
		пп11ст255 = 10,//пп.11, ст.255 Ќ  –‘
		пп12ст255 = 11,//пп.12, ст.255 Ќ  –‘
		пп12_1ст255 = 12,//пп.12.1, ст.255 Ќ  –‘
		пп13ст255 = 13,//пп.13, ст.255 Ќ  –‘
		пп14ст255 = 14,//пп.14, ст.255 Ќ  –‘
		пп15ст255 = 15,//пп.15, ст.255 Ќ  –‘
		пп16ст255 = 16,//пп.16, ст.255 Ќ  –‘
		пп17ст255 = 17,//пп.17, ст.255 Ќ  –‘
		пп18ст255 = 18,//пп.18, ст.255 Ќ  –‘
		пп19ст255 = 19,//пп.19, ст.255 Ќ  –‘
		пп20ст255 = 20,//пп.20, ст.255 Ќ  –‘
		пп21ст255 = 21,//пп.21, ст.255 Ќ  –‘
		пп22ст255 = 22,//пп.22, ст.255 Ќ  –‘
		пп23ст255 = 23,//пп.23, ст.255 Ќ  –‘
		пп24ст255 = 24,//пп.24, ст.255 Ќ  –‘
		пп25ст255 = 25,//пп.25, ст.255 Ќ  –‘
	}
	public static partial class ¬идыЌачисленийќплаты“рудаѕо—т255Ќ _«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid пп1ст255 = new Guid("f5424b80-5d5e-ce7c-43d7-388e63cae1da");//пп.1, ст.255 Ќ  –‘
		public static readonly Guid пп2ст255 = new Guid("aa3bc8a6-37c3-7696-4f88-f26c14c4de07");//пп.2, ст.255 Ќ  –‘
		public static readonly Guid пп3ст255 = new Guid("b63fb8bc-ce6b-ca59-4d4a-7cde76bfd8c7");//пп.3, ст.255 Ќ  –‘
		public static readonly Guid пп4ст255 = new Guid("04dfe284-6753-156a-4a84-d3e55f5b828d");//пп.4, ст.255 Ќ  –‘
		public static readonly Guid пп5ст255 = new Guid("753a41ba-0323-dfdd-4fe9-582debf51c4c");//пп.5, ст.255 Ќ  –‘
		public static readonly Guid пп6ст255 = new Guid("dc1a2ea5-5211-14d6-4020-51f51d8883fc");//пп.6, ст.255 Ќ  –‘
		public static readonly Guid пп7ст255 = new Guid("d168c484-12ce-6a61-421a-60b9ed41f486");//пп.7, ст.255 Ќ  –‘
		public static readonly Guid пп8ст255 = new Guid("82cba0a8-8819-43f8-403d-4cf21f2babf5");//пп.8, ст.255 Ќ  –‘
		public static readonly Guid пп9ст255 = new Guid("aca6aaa2-8792-c696-440a-178dc0dcafd1");//пп.9, ст.255 Ќ  –‘
		public static readonly Guid пп10ст255 = new Guid("75b3b58c-93e2-88b1-4f97-04114a5050e9");//пп.10, ст.255 Ќ  –‘
		public static readonly Guid пп11ст255 = new Guid("152b87b3-b9a0-4367-47a3-c4382550560c");//пп.11, ст.255 Ќ  –‘
		public static readonly Guid пп12ст255 = new Guid("fe60f7b8-3fd2-5f75-4943-d145e051e521");//пп.12, ст.255 Ќ  –‘
		public static readonly Guid пп12_1ст255 = new Guid("cd4017a1-261a-94c0-4d5e-bbc3232bc6e3");//пп.12.1, ст.255 Ќ  –‘
		public static readonly Guid пп13ст255 = new Guid("0d627fbe-2c08-3479-4ea2-a53201ecc25f");//пп.13, ст.255 Ќ  –‘
		public static readonly Guid пп14ст255 = new Guid("2606cfa2-acd7-7403-42f4-a0421bdf7eab");//пп.14, ст.255 Ќ  –‘
		public static readonly Guid пп15ст255 = new Guid("48aa5882-557b-b55d-45d1-9998332058de");//пп.15, ст.255 Ќ  –‘
		public static readonly Guid пп16ст255 = new Guid("0c6eb6a7-5f3b-e79f-436d-6cc5d8deb38c");//пп.16, ст.255 Ќ  –‘
		public static readonly Guid пп17ст255 = new Guid("2f2dd3ba-0dd1-4cdc-4175-7254a300cee7");//пп.17, ст.255 Ќ  –‘
		public static readonly Guid пп18ст255 = new Guid("f8b1c9a0-c63a-d555-46be-ae22e047ae56");//пп.18, ст.255 Ќ  –‘
		public static readonly Guid пп19ст255 = new Guid("08d56188-4e62-948d-422b-ac3636a920d3");//пп.19, ст.255 Ќ  –‘
		public static readonly Guid пп20ст255 = new Guid("bc645ab6-310c-3848-4f77-17b750127ed2");//пп.20, ст.255 Ќ  –‘
		public static readonly Guid пп21ст255 = new Guid("66c294a0-0c90-e351-4447-57b1ce28ac08");//пп.21, ст.255 Ќ  –‘
		public static readonly Guid пп22ст255 = new Guid("a96fbea1-0117-3751-423a-d51865fdf1ce");//пп.22, ст.255 Ќ  –‘
		public static readonly Guid пп23ст255 = new Guid("d9674091-4a4e-aba7-40a6-c40d9a489919");//пп.23, ст.255 Ќ  –‘
		public static readonly Guid пп24ст255 = new Guid("d77fc3b0-588c-9435-427d-967713186049");//пп.24, ст.255 Ќ  –‘
		public static readonly Guid пп25ст255 = new Guid("fbb694b1-01f8-8b2f-4298-8c9190f0c3e6");//пп.25, ст.255 Ќ  –‘
		public static ¬идыЌачисленийќплаты“рудаѕо—т255Ќ  ѕолучить(this ¬идыЌачисленийќплаты“рудаѕо—т255Ќ  «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ¬идыЌачисленийќплаты“рудаѕо—т255Ќ  ѕолучить(this ¬идыЌачисленийќплаты“рудаѕо—т255Ќ  «начение, Guid —сылка)
		{
			if(—сылка == пп1ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп1ст255;
			}
			else if(—сылка == пп2ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп2ст255;
			}
			else if(—сылка == пп3ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп3ст255;
			}
			else if(—сылка == пп4ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп4ст255;
			}
			else if(—сылка == пп5ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп5ст255;
			}
			else if(—сылка == пп6ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп6ст255;
			}
			else if(—сылка == пп7ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп7ст255;
			}
			else if(—сылка == пп8ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп8ст255;
			}
			else if(—сылка == пп9ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп9ст255;
			}
			else if(—сылка == пп10ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп10ст255;
			}
			else if(—сылка == пп11ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп11ст255;
			}
			else if(—сылка == пп12ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп12ст255;
			}
			else if(—сылка == пп12_1ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп12_1ст255;
			}
			else if(—сылка == пп13ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп13ст255;
			}
			else if(—сылка == пп14ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп14ст255;
			}
			else if(—сылка == пп15ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп15ст255;
			}
			else if(—сылка == пп16ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп16ст255;
			}
			else if(—сылка == пп17ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп17ст255;
			}
			else if(—сылка == пп18ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп18ст255;
			}
			else if(—сылка == пп19ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп19ст255;
			}
			else if(—сылка == пп20ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп20ст255;
			}
			else if(—сылка == пп21ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп21ст255;
			}
			else if(—сылка == пп22ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп22ст255;
			}
			else if(—сылка == пп23ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп23ст255;
			}
			else if(—сылка == пп24ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп24ст255;
			}
			else if(—сылка == пп25ст255)
			{
				return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп25ст255;
			}
			return ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .ѕуста€—сылка;
		}
		public static byte[]  люч(this ¬идыЌачисленийќплаты“рудаѕо—т255Ќ  «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ¬идыЌачисленийќплаты“рудаѕо—т255Ќ  «начение)
		{
			switch («начение)
			{
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп1ст255: return пп1ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп2ст255: return пп2ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп3ст255: return пп3ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп4ст255: return пп4ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп5ст255: return пп5ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп6ст255: return пп6ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп7ст255: return пп7ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп8ст255: return пп8ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп9ст255: return пп9ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп10ст255: return пп10ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп11ст255: return пп11ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп12ст255: return пп12ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп12_1ст255: return пп12_1ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп13ст255: return пп13ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп14ст255: return пп14ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп15ст255: return пп15ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп16ст255: return пп16ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп17ст255: return пп17ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп18ст255: return пп18ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп19ст255: return пп19ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп20ст255: return пп20ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп21ст255: return пп21ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп22ст255: return пп22ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп23ст255: return пп23ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп24ст255: return пп24ст255;
				case ¬идыЌачисленийќплаты“рудаѕо—т255Ќ .пп25ст255: return пп25ст255;
			}
			return Guid.Empty;
		}
	}
}
