
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(–егл)
		///</summary>
	public enum ѕор€док‘ормировани€—правкиќƒоходах‘излица
	{
		ѕуста€—сылка = - 1,
		ƒл€ѕередачи¬»‘Ќ— = 0,//ƒл€ передачи в »‘Ќ—
		‘излицу—водно = 1,//‘излицу сводно
		‘излицу¬–азрезе одовќ ј“ќ = 2,//‘излицу в разрезе кодов ќ ј“ќ
	}
	public static partial class ѕор€док‘ормировани€—правкиќƒоходах‘излица_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid ƒл€ѕередачи¬»‘Ќ— = new Guid("454738bd-7bcc-57e7-4d58-ced2a4a2bfc6");//ƒл€ передачи в »‘Ќ—
		public static readonly Guid ‘излицу—водно = new Guid("a1aa52a4-2fa1-6d79-419a-7b6cb574b463");//‘излицу сводно
		public static readonly Guid ‘излицу¬–азрезе одовќ ј“ќ = new Guid("a4eccea9-ca7d-367b-4ece-1e678ef31f22");//‘излицу в разрезе кодов ќ ј“ќ
		public static ѕор€док‘ормировани€—правкиќƒоходах‘излица ѕолучить(this ѕор€док‘ормировани€—правкиќƒоходах‘излица «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ѕор€док‘ормировани€—правкиќƒоходах‘излица ѕолучить(this ѕор€док‘ормировани€—правкиќƒоходах‘излица «начение, Guid —сылка)
		{
			if(—сылка == ƒл€ѕередачи¬»‘Ќ—)
			{
				return ѕор€док‘ормировани€—правкиќƒоходах‘излица.ƒл€ѕередачи¬»‘Ќ—;
			}
			else if(—сылка == ‘излицу—водно)
			{
				return ѕор€док‘ормировани€—правкиќƒоходах‘излица.‘излицу—водно;
			}
			else if(—сылка == ‘излицу¬–азрезе одовќ ј“ќ)
			{
				return ѕор€док‘ормировани€—правкиќƒоходах‘излица.‘излицу¬–азрезе одовќ ј“ќ;
			}
			return ѕор€док‘ормировани€—правкиќƒоходах‘излица.ѕуста€—сылка;
		}
		public static byte[]  люч(this ѕор€док‘ормировани€—правкиќƒоходах‘излица «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ѕор€док‘ормировани€—правкиќƒоходах‘излица «начение)
		{
			switch («начение)
			{
				case ѕор€док‘ормировани€—правкиќƒоходах‘излица.ƒл€ѕередачи¬»‘Ќ—: return ƒл€ѕередачи¬»‘Ќ—;
				case ѕор€док‘ормировани€—правкиќƒоходах‘излица.‘излицу—водно: return ‘излицу—водно;
				case ѕор€док‘ормировани€—правкиќƒоходах‘излица.‘излицу¬–азрезе одовќ ј“ќ: return ‘излицу¬–азрезе одовќ ј“ќ;
			}
			return Guid.Empty;
		}
	}
}
