
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(”пр)
		///</summary>
	public enum —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств
	{
		ѕуста€—сылка = - 1,
	///<summary>
	///«а€вка создана и открыта дл€ выполнени€
	///</summary>
		ќткрыта = 0,
	///<summary>
	///«а€вка включена в план ремонтов
	///</summary>
		«апланирована = 1,
	///<summary>
	///«а€вка закрыта
	///</summary>
		«акрыта = 2,
	}
	public static partial class —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств_«начени€//:ѕеречисление—сылка
	{
		///<summary>
		///«а€вка создана и открыта дл€ выполнени€
		///</summary>
		public static readonly Guid ќткрыта = new Guid("35d2de95-aeac-195a-44e8-aa6bcc298862");
		///<summary>
		///«а€вка включена в план ремонтов
		///</summary>
		public static readonly Guid «апланирована = new Guid("3102349d-0c47-5d89-4f0b-52ca84a20aa2");
		///<summary>
		///«а€вка закрыта
		///</summary>
		public static readonly Guid «акрыта = new Guid("eb2b63a3-0243-61d6-4998-8c9919516f6d");
		public static —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств ѕолучить(this —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств ѕолучить(this —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств «начение, Guid —сылка)
		{
			if(—сылка == ќткрыта)
			{
				return —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств.ќткрыта;
			}
			else if(—сылка == «апланирована)
			{
				return —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств.«апланирована;
			}
			else if(—сылка == «акрыта)
			{
				return —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств.«акрыта;
			}
			return —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств.ѕуста€—сылка;
		}
		public static byte[]  люч(this —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств «начение)
		{
			switch («начение)
			{
				case —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств.ќткрыта: return ќткрыта;
				case —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств.«апланирована: return «апланирована;
				case —осто€ни€«а€вкиЌаќбслуживаниеќсновных—редств.«акрыта: return «акрыта;
			}
			return Guid.Empty;
		}
	}
}
