
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(”пр)
		///</summary>
	public enum —пособы«аполнени€÷ен
	{
		ѕуста€—сылка = - 1,
	///<summary>
	///(ќбщ)
	///</summary>
		ѕо÷енамЌоменклатуры = 0,//ѕо ценам номенклатуры
	///<summary>
	///(”пр)
	///</summary>
		ѕо÷енамЌоменклатуры онтрагентов = 1,//ѕо ценам номенклатуры контрагентов
	///<summary>
	///(”пр)
	///</summary>
		ѕоЌоменклатуре»÷енам онтрагентов = 2,//ѕо номенклатуре и ценам контрагентов
	///<summary>
	///(ќбщ)
	///</summary>
		ѕо–озничным÷енам = 3,//ѕо розничным ценам
		ѕоѕродажным÷енам = 4,//ѕо продажным ценам
	}
	public static partial class —пособы«аполнени€÷ен_«начени€//:ѕеречисление—сылка
	{
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ѕо÷енамЌоменклатуры = new Guid("b31722ab-2cd3-9984-4722-d5ce7b0af51d");//ѕо ценам номенклатуры
		///<summary>
		///(”пр)
		///</summary>
		public static readonly Guid ѕо÷енамЌоменклатуры онтрагентов = new Guid("e63277a8-687b-c0c7-4ddd-873e9da4f1a3");//ѕо ценам номенклатуры контрагентов
		///<summary>
		///(”пр)
		///</summary>
		public static readonly Guid ѕоЌоменклатуре»÷енам онтрагентов = new Guid("3b4d2582-f6b0-880c-4e86-19ed990b145a");//ѕо номенклатуре и ценам контрагентов
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ѕо–озничным÷енам = new Guid("caab1283-4218-63f0-4663-3343539c814e");//ѕо розничным ценам
		public static readonly Guid ѕоѕродажным÷енам = new Guid("b6e5538e-e7b8-0dd6-4b48-bba7216d83e4");//ѕо продажным ценам
		public static —пособы«аполнени€÷ен ѕолучить(this —пособы«аполнени€÷ен «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static —пособы«аполнени€÷ен ѕолучить(this —пособы«аполнени€÷ен «начение, Guid —сылка)
		{
			if(—сылка == ѕо÷енамЌоменклатуры)
			{
				return —пособы«аполнени€÷ен.ѕо÷енамЌоменклатуры;
			}
			else if(—сылка == ѕо÷енамЌоменклатуры онтрагентов)
			{
				return —пособы«аполнени€÷ен.ѕо÷енамЌоменклатуры онтрагентов;
			}
			else if(—сылка == ѕоЌоменклатуре»÷енам онтрагентов)
			{
				return —пособы«аполнени€÷ен.ѕоЌоменклатуре»÷енам онтрагентов;
			}
			else if(—сылка == ѕо–озничным÷енам)
			{
				return —пособы«аполнени€÷ен.ѕо–озничным÷енам;
			}
			else if(—сылка == ѕоѕродажным÷енам)
			{
				return —пособы«аполнени€÷ен.ѕоѕродажным÷енам;
			}
			return —пособы«аполнени€÷ен.ѕуста€—сылка;
		}
		public static byte[]  люч(this —пособы«аполнени€÷ен «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this —пособы«аполнени€÷ен «начение)
		{
			switch («начение)
			{
				case —пособы«аполнени€÷ен.ѕо÷енамЌоменклатуры: return ѕо÷енамЌоменклатуры;
				case —пособы«аполнени€÷ен.ѕо÷енамЌоменклатуры онтрагентов: return ѕо÷енамЌоменклатуры онтрагентов;
				case —пособы«аполнени€÷ен.ѕоЌоменклатуре»÷енам онтрагентов: return ѕоЌоменклатуре»÷енам онтрагентов;
				case —пособы«аполнени€÷ен.ѕо–озничным÷енам: return ѕо–озничным÷енам;
				case —пособы«аполнени€÷ен.ѕоѕродажным÷енам: return ѕоѕродажным÷енам;
			}
			return Guid.Empty;
		}
	}
}
