
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(ќбщ)
		///</summary>
	public enum —пособы–асчетаќстаткаќтпуска
	{
		ѕуста€—сылка = - 1,
		ѕо алендарнымƒн€м = 0,//ѕо календарным дн€м
		ѕо–абочимƒн€м = 1,//ѕо рабочим дн€м
	}
	public static partial class —пособы–асчетаќстаткаќтпуска_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid ѕо алендарнымƒн€м = new Guid("ee7cb187-356e-a59f-422a-7fb27ed7bc8d");//ѕо календарным дн€м
		public static readonly Guid ѕо–абочимƒн€м = new Guid("a3674bad-68d7-1494-4b8a-70d894e15cad");//ѕо рабочим дн€м
		public static —пособы–асчетаќстаткаќтпуска ѕолучить(this —пособы–асчетаќстаткаќтпуска «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static —пособы–асчетаќстаткаќтпуска ѕолучить(this —пособы–асчетаќстаткаќтпуска «начение, Guid —сылка)
		{
			if(—сылка == ѕо алендарнымƒн€м)
			{
				return —пособы–асчетаќстаткаќтпуска.ѕо алендарнымƒн€м;
			}
			else if(—сылка == ѕо–абочимƒн€м)
			{
				return —пособы–асчетаќстаткаќтпуска.ѕо–абочимƒн€м;
			}
			return —пособы–асчетаќстаткаќтпуска.ѕуста€—сылка;
		}
		public static byte[]  люч(this —пособы–асчетаќстаткаќтпуска «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this —пособы–асчетаќстаткаќтпуска «начение)
		{
			switch («начение)
			{
				case —пособы–асчетаќстаткаќтпуска.ѕо алендарнымƒн€м: return ѕо алендарнымƒн€м;
				case —пособы–асчетаќстаткаќтпуска.ѕо–абочимƒн€м: return ѕо–абочимƒн€м;
			}
			return Guid.Empty;
		}
	}
}
