
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
	public enum —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€
	{
		ѕуста€—сылка = - 1,
		ќтражать акјванс = 0,// ак аванс
		ќтражать акќплату = 1,// ак оплату
	}
	public static partial class —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid ќтражать акјванс = new Guid("8ab8fbba-3013-ed50-4219-bcedbd1290f9");// ак аванс
		public static readonly Guid ќтражать акќплату = new Guid("216b87b5-afa2-32bf-4b31-73056564c3d2");// ак оплату
		public static —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€ ѕолучить(this —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€ «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€ ѕолучить(this —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€ «начение, Guid —сылка)
		{
			if(—сылка == ќтражать акјванс)
			{
				return —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€.ќтражать акјванс;
			}
			else if(—сылка == ќтражать акќплату)
			{
				return —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€.ќтражать акќплату;
			}
			return —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€.ѕуста€—сылка;
		}
		public static byte[]  люч(this —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€ «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€ «начение)
		{
			switch («начение)
			{
				case —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€.ќтражать акјванс: return ќтражать акјванс;
				case —пособыќтражени€ѕлатежейѕогашаемых¬“ечениеƒн€.ќтражать акќплату: return ќтражать акќплату;
			}
			return Guid.Empty;
		}
	}
}
