
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
	public enum —татусы»звлечени€“екста‘айлов
	{
		ѕуста€—сылка = - 1,
		Ќе»звлечен = 0,//Ќе извлечен
		»звлечен = 1,
		»звлечьЌе”далось = 2,//»звлечь не удалось
	}
	public static partial class —татусы»звлечени€“екста‘айлов_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid Ќе»звлечен = new Guid("6d0eb793-bda2-9378-4f84-128696661303");//Ќе извлечен
		public static readonly Guid »звлечен = new Guid("d8e0cb92-05e6-66bf-46dc-36e668076431");
		public static readonly Guid »звлечьЌе”далось = new Guid("e1c21899-6340-6dc7-4e5c-6572239fa55a");//»звлечь не удалось
		public static —татусы»звлечени€“екста‘айлов ѕолучить(this —татусы»звлечени€“екста‘айлов «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static —татусы»звлечени€“екста‘айлов ѕолучить(this —татусы»звлечени€“екста‘айлов «начение, Guid —сылка)
		{
			if(—сылка == Ќе»звлечен)
			{
				return —татусы»звлечени€“екста‘айлов.Ќе»звлечен;
			}
			else if(—сылка == »звлечен)
			{
				return —татусы»звлечени€“екста‘айлов.»звлечен;
			}
			else if(—сылка == »звлечьЌе”далось)
			{
				return —татусы»звлечени€“екста‘айлов.»звлечьЌе”далось;
			}
			return —татусы»звлечени€“екста‘айлов.ѕуста€—сылка;
		}
		public static byte[]  люч(this —татусы»звлечени€“екста‘айлов «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this —татусы»звлечени€“екста‘айлов «начение)
		{
			switch («начение)
			{
				case —татусы»звлечени€“екста‘айлов.Ќе»звлечен: return Ќе»звлечен;
				case —татусы»звлечени€“екста‘айлов.»звлечен: return »звлечен;
				case —татусы»звлечени€“екста‘айлов.»звлечьЌе”далось: return »звлечьЌе”далось;
			}
			return Guid.Empty;
		}
	}
}
