
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
	public enum “ипƒетализации—тандартныхќтчетов
	{
		ѕуста€—сылка = - 1,
		Ёлементы = 0,
		»ерархи€ = 1,
		“олько»ерархи€ = 2,//“олько иерархи€
	}
	public static partial class “ипƒетализации—тандартныхќтчетов_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid Ёлементы = new Guid("aa105abb-018d-81c5-44ca-1ff91dfba230");
		public static readonly Guid »ерархи€ = new Guid("a5ffc6a3-fba3-72f8-4864-22a480fb3b30");
		public static readonly Guid “олько»ерархи€ = new Guid("503e6b84-0b71-be5e-42ac-891e4ba0446e");//“олько иерархи€
		public static “ипƒетализации—тандартныхќтчетов ѕолучить(this “ипƒетализации—тандартныхќтчетов «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static “ипƒетализации—тандартныхќтчетов ѕолучить(this “ипƒетализации—тандартныхќтчетов «начение, Guid —сылка)
		{
			if(—сылка == Ёлементы)
			{
				return “ипƒетализации—тандартныхќтчетов.Ёлементы;
			}
			else if(—сылка == »ерархи€)
			{
				return “ипƒетализации—тандартныхќтчетов.»ерархи€;
			}
			else if(—сылка == “олько»ерархи€)
			{
				return “ипƒетализации—тандартныхќтчетов.“олько»ерархи€;
			}
			return “ипƒетализации—тандартныхќтчетов.ѕуста€—сылка;
		}
		public static byte[]  люч(this “ипƒетализации—тандартныхќтчетов «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this “ипƒетализации—тандартныхќтчетов «начение)
		{
			switch («начение)
			{
				case “ипƒетализации—тандартныхќтчетов.Ёлементы: return Ёлементы;
				case “ипƒетализации—тандартныхќтчетов.»ерархи€: return »ерархи€;
				case “ипƒетализации—тандартныхќтчетов.“олько»ерархи€: return “олько»ерархи€;
			}
			return Guid.Empty;
		}
	}
}
