
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(ќбщ)
		///</summary>
	public enum ”далить атегории–асчетов
	{
		ѕуста€—сылка = - 1,
	///<summary>
	///(ќбщ)
	///</summary>
		ѕервичное = 0,
	///<summary>
	///(ќбщ)
	///</summary>
		«ависимоеѕервого”ровн€ = 1,//«ависимое первого уровн€
	///<summary>
	///(ќбщ)
	///</summary>
		«ависимое¬торого”ровн€ = 2,//«ависимое второго уровн€
	///<summary>
	///(ќбщ)
	///</summary>
		«ависимое“ретьего”ровн€ = 3,//«ависимое третьего уровн€
	}
	public static partial class ”далить атегории–асчетов_«начени€//:ѕеречисление—сылка
	{
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid ѕервичное = new Guid("46b4d896-7267-fb5a-440b-003287b3a7c4");
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid «ависимоеѕервого”ровн€ = new Guid("84e4ceb1-6a67-7aac-4000-abb695411917");//«ависимое первого уровн€
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid «ависимое¬торого”ровн€ = new Guid("488de296-1a4e-aa69-4288-96ba5c089321");//«ависимое второго уровн€
		///<summary>
		///(ќбщ)
		///</summary>
		public static readonly Guid «ависимое“ретьего”ровн€ = new Guid("cdb5a198-8b8c-51cb-4bf4-ee16bea203cb");//«ависимое третьего уровн€
		public static ”далить атегории–асчетов ѕолучить(this ”далить атегории–асчетов «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ”далить атегории–асчетов ѕолучить(this ”далить атегории–асчетов «начение, Guid —сылка)
		{
			if(—сылка == ѕервичное)
			{
				return ”далить атегории–асчетов.ѕервичное;
			}
			else if(—сылка == «ависимоеѕервого”ровн€)
			{
				return ”далить атегории–асчетов.«ависимоеѕервого”ровн€;
			}
			else if(—сылка == «ависимое¬торого”ровн€)
			{
				return ”далить атегории–асчетов.«ависимое¬торого”ровн€;
			}
			else if(—сылка == «ависимое“ретьего”ровн€)
			{
				return ”далить атегории–асчетов.«ависимое“ретьего”ровн€;
			}
			return ”далить атегории–асчетов.ѕуста€—сылка;
		}
		public static byte[]  люч(this ”далить атегории–асчетов «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ”далить атегории–асчетов «начение)
		{
			switch («начение)
			{
				case ”далить атегории–асчетов.ѕервичное: return ѕервичное;
				case ”далить атегории–асчетов.«ависимоеѕервого”ровн€: return «ависимоеѕервого”ровн€;
				case ”далить атегории–асчетов.«ависимое¬торого”ровн€: return «ависимое¬торого”ровн€;
				case ”далить атегории–асчетов.«ависимое“ретьего”ровн€: return «ависимое“ретьего”ровн€;
			}
			return Guid.Empty;
		}
	}
}
