
using System;
using V82;
using V82.ѕеречислени€;//—сылка;
namespace V82.ѕеречислени€//—сылка
{
		///<summary>
		///(”пр)
		///</summary>
	public enum ”слови€—кидкиЌаценки
	{
		ѕуста€—сылка = - 1,
		ѕо¬идуќплаты = 0,//ѕо виду оплаты
		ѕоƒисконтной арте = 1,//ѕо дисконтной карте
		ѕо оличеству“овара = 2,// оличество одного товара в документе превысило
		ѕо—уммеƒокумента = 3,//—умма документа продажи превысила 
		–учна€—кидка = 4,//–учна€ скидка
		Ѕез”словий = 5,//Ѕез условий
		—пецѕредложение = 6,//—пец. предложение
		ѕо¬идуƒисконтных арт = 7,//ѕо виду дисконтных карт
	}
	public static partial class ”слови€—кидкиЌаценки_«начени€//:ѕеречисление—сылка
	{
		public static readonly Guid ѕо¬идуќплаты = new Guid("44e8fc96-b18c-8865-48cc-88e32b905dc2");//ѕо виду оплаты
		public static readonly Guid ѕоƒисконтной арте = new Guid("0ca3588b-45dd-7669-4ef9-464b23aa1388");//ѕо дисконтной карте
		public static readonly Guid ѕо оличеству“овара = new Guid("8bf4869a-19da-bd9f-4363-afec94e9657e");// оличество одного товара в документе превысило
		public static readonly Guid ѕо—уммеƒокумента = new Guid("b4f2ae85-4d03-301f-410e-7c20de06e028");//—умма документа продажи превысила 
		public static readonly Guid –учна€—кидка = new Guid("e6f61e8c-a929-88b3-4ae4-e139f53a0b12");//–учна€ скидка
		public static readonly Guid Ѕез”словий = new Guid("133a22a3-b307-4d93-48e3-b7594ff94537");//Ѕез условий
		public static readonly Guid —пецѕредложение = new Guid("850c318e-b126-c3ee-4059-855164acff1d");//—пец. предложение
		public static readonly Guid ѕо¬идуƒисконтных арт = new Guid("3114f6a6-e9ec-46ed-46ec-aa3a735174ed");//ѕо виду дисконтных карт
		public static ”слови€—кидкиЌаценки ѕолучить(this ”слови€—кидкиЌаценки «начение, byte[] —сылка)
		{
			return ѕолучить(«начение, new Guid(—сылка));
		}
		public static ”слови€—кидкиЌаценки ѕолучить(this ”слови€—кидкиЌаценки «начение, Guid —сылка)
		{
			if(—сылка == ѕо¬идуќплаты)
			{
				return ”слови€—кидкиЌаценки.ѕо¬идуќплаты;
			}
			else if(—сылка == ѕоƒисконтной арте)
			{
				return ”слови€—кидкиЌаценки.ѕоƒисконтной арте;
			}
			else if(—сылка == ѕо оличеству“овара)
			{
				return ”слови€—кидкиЌаценки.ѕо оличеству“овара;
			}
			else if(—сылка == ѕо—уммеƒокумента)
			{
				return ”слови€—кидкиЌаценки.ѕо—уммеƒокумента;
			}
			else if(—сылка == –учна€—кидка)
			{
				return ”слови€—кидкиЌаценки.–учна€—кидка;
			}
			else if(—сылка == Ѕез”словий)
			{
				return ”слови€—кидкиЌаценки.Ѕез”словий;
			}
			else if(—сылка == —пецѕредложение)
			{
				return ”слови€—кидкиЌаценки.—пецѕредложение;
			}
			else if(—сылка == ѕо¬идуƒисконтных арт)
			{
				return ”слови€—кидкиЌаценки.ѕо¬идуƒисконтных арт;
			}
			return ”слови€—кидкиЌаценки.ѕуста€—сылка;
		}
		public static byte[]  люч(this ”слови€—кидкиЌаценки «начение)
		{
			return —сылка(«начение).ToByteArray();
		}
		public static Guid —сылка(this ”слови€—кидкиЌаценки «начение)
		{
			switch («начение)
			{
				case ”слови€—кидкиЌаценки.ѕо¬идуќплаты: return ѕо¬идуќплаты;
				case ”слови€—кидкиЌаценки.ѕоƒисконтной арте: return ѕоƒисконтной арте;
				case ”слови€—кидкиЌаценки.ѕо оличеству“овара: return ѕо оличеству“овара;
				case ”слови€—кидкиЌаценки.ѕо—уммеƒокумента: return ѕо—уммеƒокумента;
				case ”слови€—кидкиЌаценки.–учна€—кидка: return –учна€—кидка;
				case ”слови€—кидкиЌаценки.Ѕез”словий: return Ѕез”словий;
				case ”слови€—кидкиЌаценки.—пецѕредложение: return —пецѕредложение;
				case ”слови€—кидкиЌаценки.ѕо¬идуƒисконтных арт: return ѕо¬идуƒисконтных арт;
			}
			return Guid.Empty;
		}
	}
}
