
using System;
using V82;
using V82.—правочники—сылка;
using V82.ƒокументы—сылка;
using V82.ѕеречислени€;//—сылка;
namespace V82.ƒокументы—сылка
{
	///<summary>
	///(ќбщ)
	///</summary>
	public partial class  орректировкаƒолга:ƒокумент—сылка
	{
		public Guid —сылка;
		public ulong ¬ерси€;
		public bool ѕометка”далени€;
		public DateTime ƒата;
		public DateTime ѕрефиксЌомера;
		public string Ќомер;
		public bool ѕроведен;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ќрганизации ќрганизаци€;
		public V82.ѕеречислени€/*—сылка*/.¬идыќпераций орректировкаƒолга ¬идќперации;//¬ид операции
		///<summary>
		///(”пр)
		///</summary>
		public V82.—правочники—сылка.ѕодразделени€ ѕодразделение;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка. онтрагенты  онтрагентƒебитор;//ƒебитор
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка. онтрагенты  онтрагент редитор;// редитор
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬”правленческом”чете;//ќтражать в управленческом учете
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ѕухгалтерском”чете;//ќтражать в бухгалтерском учете
		///<summary>
		///(ќбщ) Ћюба€ дополнительна€ информаци€
		///</summary>
		public string/*(0)*/  омментарий;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ѕользователи ќтветственный;
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ќалоговом”чете;//ќтражать в налоговом учете
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.¬алюты ¬алютаƒокумента;//¬алюта документа
		///<summary>
		///(ќбщ)
		///</summary>
		public decimal/*(10.4)*/  урсƒокумента;// урс документа
		///<summary>
		///(ќбщ)
		///</summary>
		public decimal/*(10)*/  ратностьƒокумента;// ратность документа
		public V82.—правочники—сылка.ƒоговоры онтрагентов ƒоговор онтрагента;//ƒоговор контрагента
		public bool »спользовать¬спомогательный—чет;//»спользовать вспомогательный счет
		///<summary>
		///(–егл)
		///</summary>
		public object —четƒт;//¬спомогательный счет дебиторской задолженности
		///<summary>
		///(–егл)
		///</summary>
		public object —убконтоƒт1;//—убконто 1
		///<summary>
		///(–егл)
		///</summary>
		public object —убконтоƒт2;//—убконто 2
		///<summary>
		///(–егл)
		///</summary>
		public object —убконтоƒт3;//—убконто 3
		///<summary>
		///(–егл)
		///</summary>
		public object —чет т;//¬спомогательный счет кредиторской задолженности
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто т1;//—убконто 1
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто т2;//—убконто 1
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто т3;//—убконто 3
		///<summary>
		///(–егл)
		///</summary>
		public object —четƒтЌ”;//—чет списани€ дебиторской задолженности (Ќ”)
		///<summary>
		///(–егл)
		///</summary>
		public object —убконтоƒтЌ”1;//—убконто 1 (Ќ”)
		///<summary>
		///(–егл)
		///</summary>
		public object —убконтоƒтЌ”2;//—убконто 2 (Ќ”)
		///<summary>
		///(–егл)
		///</summary>
		public object —убконтоƒтЌ”3;//—убконто 3 (Ќ”)
		///<summary>
		///(–егл)
		///</summary>
		public object —чет тЌ”;//—чет списани€ кредиторской задолженности (Ќ”)
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто тЌ”1;//—убконто 1 (Ќ”)
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто тЌ”2;//—убконто 2 (Ќ”)
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто тЌ”3;//—убконто 3 (Ќ”)
	}
}
