
using System;
using V82;
using V82.—правочники—сылка;
using V82.ƒокументы—сылка;
using V82.ѕеречислени€;//—сылка;
namespace V82.ƒокументы—сылка
{
	///<summary>
	///(ќбщ)
	///</summary>
	public partial class ќплатаќтѕокупател€ѕлатежной артой:ƒокумент—сылка
	{
		public Guid —сылка;
		public ulong ¬ерси€;
		public bool ѕометка”далени€;
		public DateTime ƒата;
		public DateTime ѕрефиксЌомера;
		public string Ќомер;
		public bool ѕроведен;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ќрганизации ќрганизаци€;
		///<summary>
		///(”пр)
		///</summary>
		public V82.—правочники—сылка.ѕодразделени€ ѕодразделение;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.ѕеречислени€/*—сылка*/.¬идыќперацийќплатаќтѕокупател€ѕлатежной артой ¬идќперации;//¬ид операции
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка. онтрагенты  онтрагент;// онтрагент, подотчетник, касса   ћ
		///<summary>
		///(ќбщ) —умма в валюте документа, налоги включены согласно флагам
		///</summary>
		public decimal/*(15.2)*/ —уммаƒокумента;//—умма документа
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ѕользователи ќтветственный;
		///<summary>
		///(ќбщ) Ћюба€ дополнительна€ информаци€
		///</summary>
		public string/*(0)*/  омментарий;
		///<summary>
		///(ќбщ)
		///</summary>
		public object ƒокументќснование;//ƒокумент основание
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬”правленческом”чете;//ќтражать в управленческом учете
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ѕухгалтерском”чете;//ќтражать в бухгалтерском учете
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ќалоговом”чете;//ќтражать в налоговом учете
		///<summary>
		///Ќомер чека на фискальном регистраторе
		///</summary>
		public decimal/*(8)*/ Ќомер„ека  ћ;//Ќомер чека   ћ
		public V82.—правочники—сылка.ƒоговорыЁквайринга ƒоговорЁквайринга;//ƒоговор эквайринга
		public V82.—правочники—сылка. онтрагенты Ёквайрер;
		public V82.—правочники—сылка.ƒоговоры онтрагентов ƒоговор¬заиморасчетовЁквайрера;//ƒоговор взаиморасчетов эквайрера
		public V82.—правочники—сылка.¬алюты ¬алютаƒокумента;//¬алюта документа
		///<summary>
		///(–егл)
		///</summary>
		public object —чет”чета–асчетов—Ёквайрером;//—чет учета расчетов с эквайрером
		public V82.—правочники—сылка.¬идыќплат„ека  ћ ¬идќплаты;//¬ид оплаты
		public decimal/*(5.2)*/ ѕроцент“орговой”ступки;//ѕроцент торговой уступки
		public decimal/*(15.2)*/ —умма“орговой”ступки;//—умма торговой уступки
	}
}
