
using System;
using V82;
using V82.—правочники—сылка;
using V82.ƒокументы—сылка;
using V82.ѕеречислени€;//—сылка;
namespace V82.ƒокументы—сылка
{
	///<summary>
	///(ќбщ)
	///</summary>
	public partial class ѕередачаќборудовани€¬ћонтаж:ƒокумент—сылка
	{
		public Guid —сылка;
		public ulong ¬ерси€;
		public bool ѕометка”далени€;
		public DateTime ƒата;
		public DateTime ѕрефиксЌомера;
		public string Ќомер;
		public bool ѕроведен;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ќрганизации ќрганизаци€;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ќбъекты—троительства ќбъект—троительства;//ќбъект строительства
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.—татьи«атрат —тать€«атрат;//—тать€ затрат
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.—клады —клад;
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ќалоговом”чете;//ќтражать в налоговом учете
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬”правленческом”чете;//ќтражать в управленческом учете
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ѕухгалтерском”чете;//ќтражать в бухгалтерском учете
		///<summary>
		///(–егл)
		///</summary>
		public object —чет”четаЅ”ќбъекта—троительства;//—чет учета Ѕ” объекта строительства
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ѕользователи ќтветственный;
		///<summary>
		///(ќбш)
		///</summary>
		public string/*(0)*/  омментарий;
		///<summary>
		///(–егл)
		///</summary>
		public object —чет”четаЌ”ќбъекта—троительства;//—чет учета Ќ” объекта строительства
	}
}
