
using System;
using V82;
using V82.—правочники—сылка;
using V82.ƒокументы—сылка;
using V82.ѕеречислени€;//—сылка;
namespace V82.ƒокументы—сылка
{
	///<summary>
	///(ќбщ)
	///</summary>
	public partial class ѕеремещениеќ—:ƒокумент—сылка
	{
		public Guid —сылка;
		public ulong ¬ерси€;
		public bool ѕометка”далени€;
		public DateTime ƒата;
		public DateTime ѕрефиксЌомера;
		public string Ќомер;
		public bool ѕроведен;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ќрганизации ќрганизаци€;
		///<summary>
		///(”пр)
		///</summary>
		public V82.—правочники—сылка.‘изическиеЋица ћќЋ;
		///<summary>
		///(ќбщ)
		///</summary>
		public string/*(0)*/  омментарий;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ѕользователи ќтветственный;
		///<summary>
		///(–егл)
		///</summary>
		public V82.—правочники—сылка.ѕодразделени€ќрганизаций ѕодразделениеќрганизации;//ѕодразделение организации
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ѕухгалтерском”чете;//ќтражать в бухгалтерском учете
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬”правленческом”чете;//ќтражать в управленческом учете
		///<summary>
		///(”пр)
		///</summary>
		public V82.—правочники—сылка.ѕодразделени€ ѕодразделение;
		///<summary>
		///(–егл)
		///</summary>
		public V82.—правочники—сылка.‘изическиеЋица ћќЋќрганизации;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.—обыти€ќ— —обытие;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.—обыти€ќ— —обытие–егл;//—обытие (регл)
	}
}
