
using System;
using Rest;
using System.Globalization;
using System.Collections.Generic;
using ServiceStack.ServiceHost;
using ServiceStack.ServiceInterface;

namespace V82.Документы
{
	//UstanovkaParametrovUchetaNomenklatury
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры","")]
	public class УстановкаПараметровУчетаНоменклатурыЗапрос: V82.ДокументыСсылка.УстановкаПараметровУчетаНоменклатуры,IReturn<УстановкаПараметровУчетаНоменклатурыЗапрос>
	{
	}
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/НайтиПоСсылке","{Ссылка}")]
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/ПоСсылке","{Ссылка}")]
	public class УстановкаПараметровУчетаНоменклатурыНайтиПоСсылке: V82.ДокументыСсылка.УстановкаПараметровУчетаНоменклатуры,IReturn<УстановкаПараметровУчетаНоменклатурыНайтиПоСсылке>
	{
	}
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/НайтиПоНомеру","{Номер}")]
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/ПоНомеру","{Номер}")]
	public class УстановкаПараметровУчетаНоменклатурыНайтиПоНомеру: V82.ДокументыСсылка.УстановкаПараметровУчетаНоменклатуры,IReturn<УстановкаПараметровУчетаНоменклатурыНайтиПоНомеру>
	{
	}
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/ВыбратьПоСсылке","{___Первые}")]
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/ВыбратьПоСсылке","{___Первые}/{___Мин}")]
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/ВыбратьПоСсылке","{___Первые}/{___Мин}/{___Макс}")]
	public class УстановкаПараметровУчетаНоменклатурыВыбратьПоСсылке: V82.ДокументыСсылка.УстановкаПараметровУчетаНоменклатуры,IReturn<УстановкаПараметровУчетаНоменклатурыВыбратьПоСсылке>
	{
		public int ___Первые {get; set;}
		public Guid ___Мин {get; set;}
		public Guid ___Макс {get; set;}
	}
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/ВыбратьПоНомеру","{___Первые}")]
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/ВыбратьПоНомеру","{___Первые}/{___Мин}")]
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/ВыбратьПоНомеру","{___Первые}/{___Мин}/{___Макс}")]
	public class УстановкаПараметровУчетаНоменклатурыВыбратьПоНомеру: V82.ДокументыСсылка.УстановкаПараметровУчетаНоменклатуры,IReturn<УстановкаПараметровУчетаНоменклатурыВыбратьПоНомеру>
	{
		public int ___Первые {get; set;}
		public string ___Мин {get; set;}
		public string ___Макс {get; set;}
	}
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/СтраницаПоСсылке","{___Размер}/{___Номер}")]
	public class УстановкаПараметровУчетаНоменклатурыСтраницаПоСсылке: V82.ДокументыСсылка.УстановкаПараметровУчетаНоменклатуры,IReturn<УстановкаПараметровУчетаНоменклатурыСтраницаПоСсылке>
	{
		public int ___Размер {get; set;}
		public int ___Номер {get; set;}
	}
	[Маршрут("Документы/УстановкаПараметровУчетаНоменклатуры/СтраницаПоНомеру","{___Размер}/{___Номер}")]
	public class УстановкаПараметровУчетаНоменклатурыСтраницаПоНомеру: V82.ДокументыСсылка.УстановкаПараметровУчетаНоменклатуры,IReturn<УстановкаПараметровУчетаНоменклатурыСтраницаПоНомеру>
	{
		public int ___Размер {get; set;}
		public int ___Номер {get; set;}
	}

	public class УстановкаПараметровУчетаНоменклатурыОтвет
	{
		public string Ответ {get;set;}
	}

	public partial class УстановкаПараметровУчетаНоменклатурыСервис : Service
	{
		
		public object Get(УстановкаПараметровУчетаНоменклатурыЗапрос Запрос)
		{
			return null;
		}
		
		public object Get(УстановкаПараметровУчетаНоменклатурыНайтиПоСсылке Запрос)
		{
			if (Запрос.Ссылка == null)
			{
				return null;
			}
			var Ссылка = V82.Документы.УстановкаПараметровУчетаНоменклатуры.НайтиПоСсылке(Запрос.Ссылка);
			if (Ссылка == null)
			{
				return new УстановкаПараметровУчетаНоменклатурыОтвет() { Ответ = "УстановкаПараметровУчетаНоменклатуры c ссылкой '" + Запрос.Ссылка + "' не найден." };
			}
			return Ссылка.ПолучитьОбъект();
		}
		
		public object Get(УстановкаПараметровУчетаНоменклатурыНайтиПоНомеру Запрос)
		{
			if(Запрос.Номер == null)
			{
				return null;
			}
			var СтрокаНомер = System.Uri.UnescapeDataString(Запрос.Номер);
			var Ссылка = V82.Документы.УстановкаПараметровУчетаНоменклатуры.НайтиПоНомеру(СтрокаНомер);
			if (Ссылка == null)
			{
				return new УстановкаПараметровУчетаНоменклатурыОтвет() {Ответ = "УстановкаПараметровУчетаНоменклатуры c номером '" + Запрос.Номер + "' не найдено."};
			}
			return Ссылка.ПолучитьОбъект();
		}
		
		public object Get(УстановкаПараметровУчетаНоменклатурыВыбратьПоСсылке Запрос)
		{
			if (Запрос.___Макс == Guid.Empty)
			{
				Запрос.___Макс = Guid.Parse("ffffffff-ffff-ffff-ffff-ffffffffffff");
			}
			var Коллекция = new List<object>();
			foreach (var Ссылка in V82.Документы.УстановкаПараметровУчетаНоменклатуры.ВыбратьПоСсылке(Запрос.___Первые, Запрос.___Мин, Запрос.___Макс))
			{
				Коллекция.Add(Ссылка.ПолучитьОбъект());
			}
			return Коллекция;
		}
		
		public object Get(УстановкаПараметровУчетаНоменклатурыВыбратьПоНомеру Запрос)
		{
			return null;
		}
		
		public object Get(УстановкаПараметровУчетаНоменклатурыСтраницаПоСсылке Запрос)
		{
			return null;
		}
		
		public object Get(УстановкаПараметровУчетаНоменклатурыСтраницаПоНомеру Запрос)
		{
			return null;
		}

		public object Any(УстановкаПараметровУчетаНоменклатурыЗапрос Запрос)
		{
			return new УстановкаПараметровУчетаНоменклатурыОтвет {Ответ = "УстановкаПараметровУчетаНоменклатуры, "};
		}

		public object Post(УстановкаПараметровУчетаНоменклатурыЗапрос ЗапросУстановкаПараметровУчетаНоменклатуры)
		{
			var Ссылка = (ДокументыСсылка.УстановкаПараметровУчетаНоменклатуры)ЗапросУстановкаПараметровУчетаНоменклатуры;
			var Объект = Ссылка.ПолучитьОбъект();
			Объект.Записать();
			return null;
		}


	}
}