
                                    Ext.define('Данные.Справочники.ВидыДисконтныхКарт',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ВидыДисконтныхКарт, Meta","Ссылка":"11004a925c95cb2211db0cf60c5b2e84","Версия":24187,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000001","Наименование":"\u0421\u0435\u0440\u0435\u0431\u0440\u044F\u043D\u043D\u0430\u044F"},{"__type":"V82.СправочникиОбъект.ВидыДисконтныхКарт, Meta","Ссылка":"11004d925c95cb2211db10ad3c604205","Версия":24188,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000002","Наименование":"\u0417\u043E\u043B\u043E\u0442\u0430\u044F"},{"__type":"V82.СправочникиОбъект.ВидыДисконтныхКарт, Meta","Ссылка":"11004d925c95cb2211db10ad3c604206","Версия":24189,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000003","Наименование":"\u041F\u043B\u0430\u0442\u0438\u043D\u043E\u0432\u0430\u044F"}]
                                    });
                                    