
                                    Ext.define('Данные.Справочники.ГодовыеГрафикиАмортизацииОС',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ГодовыеГрафикиАмортизацииОС, Meta","Ссылка":"5050328d5054303011d8ea0fb4823de6","Версия":24218,"ПометкаУдаления":false,"Предопределенный":false,"Код":"00001    ","Наименование":"График амортизации складского стеллажа","Комментарий":"","Коэффициент1":5.000,"Коэффициент2":5.000,"Коэффициент3":10.000,"Коэффициент4":10.000,"Коэффициент5":10.000,"Коэффициент6":10.000,"Коэффициент7":10.000,"Коэффициент8":10.000,"Коэффициент9":10.000,"Коэффициент10":10.000,"Коэффициент11":5.000,"Коэффициент12":5.000}]
                                    });
                                    