
                                    Ext.define('Данные.Справочники.ГруппыДоступностиСкладов',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ГруппыДоступностиСкладов, Meta","Ссылка":"0500caa2805dd1a211d98c96f157b2e9","Версия":24219,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000001","Наименование":"Оптовые и розничные"},{"__type":"V82.СправочникиОбъект.ГруппыДоступностиСкладов, Meta","Ссылка":"0500caa2805dd1a211d98c96f157b2ea","Версия":24220,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000003","Наименование":"Удаленные торговые точки"},{"__type":"V82.СправочникиОбъект.ГруппыДоступностиСкладов, Meta","Ссылка":"0500caa2805dd1a211d98c96f157b2eb","Версия":24221,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000002","Наименование":"Производственные"}]
                                    });
                                    