
                                    Ext.define('Данные.Справочники.ДоговорыЭквайринга',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ДоговорыЭквайринга, Meta","Ссылка":"11004a925c95cb2211db0cbc9cd7aabb","Версия":24246,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000001","Наименование":"Договор эквайринга с АКБ \"АВТ-БАНК\"","Эквайрер":{"Ссылка":"0d007b934f885e5d11d8e0bb42dbad6f","Версия":104138,"Представление":"АКБ \"АВТ-БАНК\""},"ДоговорВзаиморасчетов":{"Ссылка":"11004a925c95cb2211db0cbc9cd7aab9","Версия":111229,"Представление":"Договор эквайринга"}}]
                                    });
                                    