
                                    Ext.define('Данные.Справочники.ИсточникиИнформации',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ИсточникиИнформации, Meta","Ссылка":"a7372f9cac295757425ec8e4db0eb663","Версия":103717,"ПометкаУдаления":true,"Предопределенный":false,"Код":"000000001","Наименование":"- Не указан -"}]
                                    });
                                    