
                                    Ext.define('Данные.Справочники.НоменклатурныеУзлы',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.НоменклатурныеУзлы, Meta","Ссылка":"0d007c934f885e5d11d8e13da9e96492","Версия":26487,"ПометкаУдаления":false,"Предопределенный":false,"Код":"00002    ","Наименование":"\u041D\u0430\u0431\u043E\u0440 \u0433\u0430\u0435\u043A","Состояние":"Утвержден","ДатаУтверждения":"\/Date(1070222400000+0400)\/"},{"__type":"V82.СправочникиОбъект.НоменклатурныеУзлы, Meta","Ссылка":"0d007c934f885e5d11d8e13da9e96493","Версия":26488,"ПометкаУдаления":false,"Предопределенный":false,"Код":"00001    ","Наименование":"\u041D\u0430\u0431\u043E\u0440 \u043A\u0440\u0435\u043F\u0435\u0436\u0430","Состояние":"Утвержден","ДатаУтверждения":"\/Date(1080244800000+0400)\/"}]
                                    });
                                    