
                                    Ext.define('Данные.Справочники.Проекты',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.Проекты, Meta","Ссылка":"5050328d5054303011d8fa7fd43f7d13","Версия":48635,"ПометкаУдаления":false,"Предопределенный":false,"Родитель":{"Ссылка":"00000000000000000000000000000000","Версия":0},"ЭтоГруппа":false,"Код":"00001    ","Наименование":"Оптовая торговля","ДатаНачала":"\/Date(-6847819200000+0400)\/","ДатаОкончания":"\/Date(-6847819200000+0400)\/","Ответственный":{"Ссылка":"0d007b934f885e5d11d8e0a538640f94","Версия":112925,"Представление":"Ефремов Артур Васильевич"},"Описание":""}]
                                    });
                                    