
                                    Ext.define('Данные.Справочники.Работодатели',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.Работодатели, Meta","Ссылка":"3ac0cf9bc4ba85df4a5e545c24181976","Версия":109203,"ПометкаУдаления":false,"Предопределенный":true,"Код":"000000001","Наименование":"\u0422\u0435\u043A\u0443\u0449\u0438\u0439 \u0440\u0430\u0431\u043E\u0442\u043E\u0434\u0430\u0442\u0435\u043B\u044C","НаименованиеПолное":"","ИНН":"","КПП":"","НаименованиеТерриториальногоОрганаФСС":"","РегистрационныйНомерФСС":"","ДополнительныйКодФСС":"","КодПодчиненностиФСС":""}]
                                    });
                                    