
                                    Ext.define('Данные.Справочники.РолиИсполнителей',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.РолиИсполнителей, Meta","Ссылка":"e10f618b435331f64021aeaa96ab390f","Версия":109204,"ПометкаУдаления":false,"Предопределенный":true,"Код":"000000001","Наименование":"Кадровик"},{"__type":"V82.СправочникиОбъект.РолиИсполнителей, Meta","Ссылка":"41a9d6b75820385940b22b283ece83bb","Версия":109205,"ПометкаУдаления":false,"Предопределенный":true,"Код":"000000002","Наименование":"Расчетчик"}]
                                    });
                                    