
                                    Ext.define('Данные.Справочники.ТарифыПочтовогоСбора',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ТарифыПочтовогоСбора, Meta","Ссылка":"b5686db5719928c111e208eac020ff69","Версия":109206,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000001","Наименование":"по России","РасчетПоШкалеСПолнойСуммы":false},{"__type":"V82.СправочникиОбъект.ТарифыПочтовогоСбора, Meta","Ссылка":"b5686db5719928c111e208eac020ff6a","Версия":109207,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000002","Наименование":"в страны СНГ, Балтии и страны Дальнего зарубежья","РасчетПоШкалеСПолнойСуммы":false}]
                                    });
                                    