
                                    Ext.define('Данные.Справочники.ТарифыПочтовогоСбора',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ТарифыПочтовогоСбора, Meta","Ссылка":"b5686db5719928c111e208eac020ff69","Версия":109206,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000001","Наименование":"\u043F\u043E \u0420\u043E\u0441\u0441\u0438\u0438","РасчетПоШкалеСПолнойСуммы":false},{"__type":"V82.СправочникиОбъект.ТарифыПочтовогоСбора, Meta","Ссылка":"b5686db5719928c111e208eac020ff6a","Версия":109207,"ПометкаУдаления":false,"Предопределенный":false,"Код":"000000002","Наименование":"\u0432 \u0441\u0442\u0440\u0430\u043D\u044B \u0421\u041D\u0413, \u0411\u0430\u043B\u0442\u0438\u0438 \u0438 \u0441\u0442\u0440\u0430\u043D\u044B \u0414\u0430\u043B\u044C\u043D\u0435\u0433\u043E \u0437\u0430\u0440\u0443\u0431\u0435\u0436\u044C\u044F","РасчетПоШкалеСПолнойСуммы":false}]
                                    });
                                    