
                                    Ext.define('Данные.Справочники.ТочкиМаршрута',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ТочкиМаршрута, Meta","Ссылка":"0d0084984f886b5d11db39af6e6399d1","Версия":49640,"ПометкаУдаления":false,"Предопределенный":false,"Родитель":"00000000000000000000000000000000","ЭтоГруппа":false,"Код":"000000001","Наименование":"\u0426\u0435\u0445 \u2116 1 (\u0413\u0430\u0440\u043D\u0438\u0442\u0443\u0440\u043D\u0430\u044F \u043C\u0435\u0431\u0435\u043B\u044C)","Подразделение":{"Ссылка":"0d007b934f885e5d11d8e0a538640fa6","Версия":112856,"Представление":"\u0426\u0435\u0445 \u2116 1"}}]
                                    });
                                    