
                                    Ext.define('Данные.Справочники.УченыеСтепени',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.УченыеСтепени, Meta","Ссылка":"b5686db5719928c111e208eac020ff67","Версия":109220,"ПометкаУдаления":false,"Предопределенный":false,"Код":"1        ","Наименование":"Доктор наук"},{"__type":"V82.СправочникиОбъект.УченыеСтепени, Meta","Ссылка":"b5686db5719928c111e208eac020ff68","Версия":109221,"ПометкаУдаления":false,"Предопределенный":false,"Код":"2        ","Наименование":"Кандидат наук"}]
                                    });
                                    