
                                    Ext.define('Данные.Справочники.ФинансовыеРасчеты',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ФинансовыеРасчеты, Meta","Ссылка":"5050328d5054303011d8fa964667e512","Версия":49642,"ПометкаУдаления":false,"Предопределенный":false,"Код":"00001    ","Наименование":"Прибыли и убытки"}]
                                    });
                                    