
                                    Ext.define('Данные.Справочники.ЦенныеБумаги',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ЦенныеБумаги, Meta","Ссылка":"0d007c934f885e5d11d8e13da9e964a8","Версия":49928,"ПометкаУдаления":false,"Предопределенный":false,"Код":"00001    ","Наименование":"\u0410\u043A\u0446\u0438\u0438 \u043E\u0431\u044B\u043A\u043D\u043E\u0432\u0435\u043D\u043D\u044B\u0435 1 \u0432\u044B\u043F."},{"__type":"V82.СправочникиОбъект.ЦенныеБумаги, Meta","Ссылка":"0d007c934f885e5d11d8e13da9e964a9","Версия":49929,"ПометкаУдаления":false,"Предопределенный":false,"Код":"00002    ","Наименование":"\u0410\u043A\u0446\u0438\u0438 \u043F\u0440\u0438\u0432\u0438\u043B\u0435\u0433\u0438\u0440\u043E\u0432. 1 \u0432\u044B\u043F"}]
                                    });
                                    