
                                    Ext.define('Данные.Справочники.ЦенныеБумаги',
                                    {
                                        data:
                                        [{"__type":"V82.СправочникиОбъект.ЦенныеБумаги, Meta","Ссылка":"0d007c934f885e5d11d8e13da9e964a8","Версия":49928,"ПометкаУдаления":false,"Предопределенный":false,"Код":"00001    ","Наименование":"Акции обыкновенные 1 вып."},{"__type":"V82.СправочникиОбъект.ЦенныеБумаги, Meta","Ссылка":"0d007c934f885e5d11d8e13da9e964a9","Версия":49929,"ПометкаУдаления":false,"Предопределенный":false,"Код":"00002    ","Наименование":"Акции привилегиров. 1 вып"}]
                                    });
                                    