Ext.define('Метаданные.Обработки', [{
Гуид:'d4c5d9bb-f3f2-4461-95da-7d8606921a99',Имя:'АвтоОбменДанными',Синоним:'Авто обмен данными',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'ba442358-8d42-4bf2-a139-042783305dd9',Имя:'АвтоПолучениеОтправкаЭлектронныхПисем',Синоним:'Авто получение/отправка электронных писем',Комментарий:'',ОсновнаяФорма:'08b1e33c-8258-409e-a548-fdd614cee0f4'},{
Гуид:'22805d4c-c01c-4df6-a584-b7b9f8907ef7',Имя:'АдминистрированиеПользователей',Синоним:'Администрирование пользователей',Комментарий:'',ОсновнаяФорма:'bb95fba4-7c9b-444a-a4cd-ad9e4d7f7504'},{
Гуид:'1b00e9e9-bf62-477c-bb3c-e1f92ce831af',Имя:'АдреснаяКнига',Синоним:'Адресная книга',Комментарий:'',ОсновнаяФорма:'3d57f2fe-0b72-4f1e-bd19-d8d109388c81'},{
Гуид:'a22d1a4f-cb7c-4bcc-b258-ecca282fb071',Имя:'АктивныеПользователи',Синоним:'Активные пользователи',Комментарий:'',ОсновнаяФорма:'e5beda2c-f4e2-4a6b-a1d0-a877eb0c9f5b'},{
Гуид:'684cd2ad-e929-463e-a9e2-899054d6f41c',Имя:'АнализНеявок',Синоним:'Анализ неявок',Комментарий:'',ОсновнаяФорма:'7a469ea0-5c9f-4655-8394-caf19136dd3b'},{
Гуид:'239e3da0-46cb-496f-a10f-8bdff64eb728',Имя:'АттестацииРаботников',Синоним:'Аттестации работников',Комментарий:'',ОсновнаяФорма:'f00f380b-2cda-489e-93d7-c84e68f96163'},{
Гуид:'f73d1a13-e993-4c4b-91e0-5c8c88e21339',Имя:'БлокировкаСоединенийСИнформационнойБазой',Синоним:'Блокировка соединений с информационной базой',Комментарий:'',ОсновнаяФорма:'cf19d60e-3c56-4435-a365-7dff1ef6edfd'},{
Гуид:'a76e029f-7a9a-4fd7-9278-ff56bd87526b',Имя:'БухгалтерскиеИтоги',Синоним:'Бухгалтерские итоги',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'bbded40d-3655-4a6d-9ba4-3d2222e10cfe',Имя:'ВводНаправленийСписания',Синоним:'Ввод направлений списания',Комментарий:'',ОсновнаяФорма:'43eaa22d-fd79-4893-bcf8-30da5eee2c1f'},{
Гуид:'23eec0a1-8cbd-40e1-b7f7-da56bb1bc536',Имя:'ВводПараметровВыпускаПродукции',Синоним:'Ввод параметров выпуска продукции',Комментарий:'',ОсновнаяФорма:'96866f80-127a-44b3-9da1-5bc8bca868aa'},{
Гуид:'a4e4433e-12d9-4ba2-8c07-9e412c34ec1b',Имя:'ВводРегламентированныхКадровыхДокументовНаОсновании',Синоним:'Ввод регламентированных кадровых документов на основании',Комментарий:'(Общ)',ОсновнаяФорма:'8d6b13f3-5234-4cee-90c4-65a865abf419'},{
Гуид:'d5d6b158-cbe4-4e25-958b-2f180c1feccf',Имя:'ВводСерийныхНомеров',Синоним:'Ввод серийных номеров',Комментарий:'',ОсновнаяФорма:'2c1c2c3f-4b6e-4451-8940-ae0c2aa2315b'},{
Гуид:'3145f730-cc7c-48d8-a9f2-c06d29da2417',Имя:'ВводФормулы',Синоним:'Ввод формулы',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'64a77c13-164c-42c5-b5ba-fc49b49f729d',Имя:'ВосстановлениеПоследовательности_НУ_УСН',Синоним:'Восстановление последовательности НУ УСН',Комментарий:'(регл)',ОсновнаяФорма:'382fed94-1af7-4bb1-91c3-c64ec9c03d75'},{
Гуид:'b71f1ad5-3178-467e-9624-7655b765af08',Имя:'ВыгрузкаДанныхCommerceML',Синоним:'Выгрузка данных в формате СommerceML',Комментарий:'',ОсновнаяФорма:'ef456860-1bd8-41dc-832b-5889b5053b85'},{
Гуид:'cb6b2189-e247-46df-b920-ed5aa330ea86',Имя:'ВыгрузкаСпискаОбъектов',Синоним:'Выгрузка списка объектов',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'47d38f68-342d-4155-8c31-525ab0be4cc6',Имя:'ВыпискаБанка',Синоним:'Выписка банка',Комментарий:'',ОсновнаяФорма:'1bc0aeb0-c51f-47d4-82b3-0aecc9a4c072'},{
Гуид:'69742606-b659-492b-980b-a724bf9ac05d',Имя:'ВыплатаЗарплатыРасходнымиОрдерами',Синоним:'Выплата зарплаты расходными ордерами',Комментарий:'',ОсновнаяФорма:'d40a6597-45a8-41c7-99cc-76620925ac8c'},{
Гуид:'a3cda2f9-8794-466d-894c-0cb38aa71360',Имя:'ГрафикЗаказов',Синоним:'График заказов',Комментарий:'',ОсновнаяФорма:'281e076c-41a3-406d-9b31-95d9965f35d1'},{
Гуид:'d10b01eb-ee92-435c-a1a9-22ffe3b09dc0',Имя:'ГрафикОтпусков',Синоним:'График отпусков',Комментарий:'',ОсновнаяФорма:'9115050f-33c2-46c5-8891-97b530a63c4a'},{
Гуид:'b137aa97-f61c-44ee-945a-f8f4a2805909',Имя:'ГрупповаяОбработкаОбъектов',Синоним:'Групповая обработка объектов',Комментарий:'',ОсновнаяФорма:'61d2642e-f116-4992-b5b7-9edadfa414cc'},{
Гуид:'7172c442-0752-4f23-bec0-09d3e840377d',Имя:'ГрупповаяОбработкаСправочниковИДокументов',Синоним:'Групповая обработка справочников и документов',Комментарий:'',ОсновнаяФорма:'e6f9c1fb-dfac-42b4-a06c-dab0d6017f9f'},{
Гуид:'f0e480be-8c51-466e-9128-593bfda3e6f2',Имя:'ДокументооборотСКонтролирующимиОрганами',Синоним:'Документооборот с контролирующими органами',Комментарий:'',ОсновнаяФорма:'e010b2ae-897f-48c2-8722-db4e6cff08aa'},{
Гуид:'0cb3c2b1-5a22-4a33-a715-85c96b2ce44e',Имя:'ДополнительнаяИнформация',Синоним:'Дополнительная информация',Комментарий:'[v.8.1.1.04.upp, 22.06.2011]',ОсновнаяФорма:'33bac4b9-b097-4171-adeb-e1d40831873c'},{
Гуид:'46b21e3d-c820-485f-9d30-6ac96e84b0a6',Имя:'ДопроведениеДокументов',Синоним:'Допроведение документов',Комментарий:'',ОсновнаяФорма:'d40bd59b-5cfd-4846-bed3-429ed524a7c5'},{
Гуид:'f480ac52-e2f1-4ed0-a0b1-20a622f77302',Имя:'ЖурналРегистрации',Синоним:'Журнал регистрации',Комментарий:'',ОсновнаяФорма:'5c63e7cd-ecdb-45ae-a589-f6c38f5a8e76'},{
Гуид:'b938f9ba-5240-4128-bc51-7dc8a6f87d7f',Имя:'ЗагрузкаБанков',Синоним:'Загрузка банков',Комментарий:'',ОсновнаяФорма:'f47355cc-4823-4b74-954a-67b3d100626e'},{
Гуид:'fdbfc5f5-e876-46dc-ba06-e2dbacd3a1d1',Имя:'ЗагрузкаДанныхCommerceML',Синоним:'Загрузка данных в формате CommerceML',Комментарий:'',ОсновнаяФорма:'c4912dad-e97b-496f-ab95-a24003bba584'},{
Гуид:'773e8351-76ae-49e3-a618-8c451c2b52bf',Имя:'ЗагрузкаДанныхИзТабличногоДокумента',Синоним:'Загрузка данных из табличного документа',Комментарий:'',ОсновнаяФорма:'5c42a00f-afb8-4e51-b057-daa7f1ba2d1a'},{
Гуид:'a7c2ddf7-be05-452e-8e98-8bbad3fa4932',Имя:'ЗагрузкаПочтовыхСообщений',Синоним:'Загрузка почтовых сообщений',Комментарий:'',ОсновнаяФорма:'1a01f61d-2cc1-4720-84fa-4ef0ed4e2aa5'},{
Гуид:'abe74acb-1d4b-416f-be2b-4a1b7112d387',Имя:'ЗагрузкаРезультатовАнкетирования',Синоним:'Загрузка результатов анкетирования',Комментарий:'',ОсновнаяФорма:'36a89a68-42a0-4634-beae-666e8739549d'},{
Гуид:'4edcee2b-7883-4db4-b17f-8bb57649732e',Имя:'ЗакрытиеКассовойСмены',Синоним:'Закрытие кассовой смены',Комментарий:'(Упр)',ОсновнаяФорма:'c1159366-f710-453d-8bad-efdb11c27929'},{
Гуид:'e9c28be3-8ff9-46ee-879d-3084df0dc03b',Имя:'ЗаполнениеСчетовРасходовУСН',Синоним:'Заполнение счетов расходов УСН',Комментарий:'',ОсновнаяФорма:'79dfb315-2783-4f07-aad8-8f3775cd2f4f'},{
Гуид:'d7b88883-cb58-471f-8bdc-6449837272b0',Имя:'ЗначенияПоказателейСхемМотивации',Синоним:'Значения показателей схем мотивации',Комментарий:'',ОсновнаяФорма:'48ba836b-ead1-4e8f-881a-7e76552946a9'},{
Гуид:'60b0089f-1638-424d-9c96-9fac6a9a9f75',Имя:'ЗначенияСвойствОбъекта',Синоним:'Значения свойств объекта',Комментарий:'',ОсновнаяФорма:'9491a334-8cf0-4823-b2d0-69c05330f775'},{
Гуид:'d3a7a42f-fa3d-4dac-9bf4-a6c21f2e97cb',Имя:'ИзменениеДокументовБюджетирования',Синоним:'Изменение документов бюджетирования',Комментарий:'',ОсновнаяФорма:'32f1a972-a804-4370-9b37-816db2953078'},{
Гуид:'9eed4efd-edb4-4fa4-9f55-79c2d814de3b',Имя:'ИзменениеНастроекУчета',Синоним:'Изменение настроек учета',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'72e6dab3-251b-4191-b799-1b232c03ae4a',Имя:'ИмпортЭкспортОперацийПоЛицевымСчетамРаботников',Синоним:'Операции с лицевыми счетами сотрудников',Комментарий:'',ОсновнаяФорма:'d37dbba2-f229-4919-980f-c68df060978d'},{
Гуид:'51ed7b8c-b0db-4024-901f-55ef30c49b24',Имя:'ИндексацияЗаработка',Синоним:'Индексация заработка',Комментарий:'',ОсновнаяФорма:'b50a5ca0-262b-4493-bcbd-7a11596a18a0'},{
Гуид:'5b59df31-8eb7-4454-9809-f169aada62ee',Имя:'ИндексацияИПерерасчетПособийНаДетейЗаСчетФСС',Синоним:'Индексация и перерасчет пособий на детей за счет ФСС',Комментарий:'',ОсновнаяФорма:'7ed7d8b3-02c0-418e-925b-743fe0b13f2a'},{
Гуид:'3d28ccc7-5069-491f-97dc-2a3bd247bf1b',Имя:'КадровоеПланирование',Синоним:'Кадровое планирование',Комментарий:'(Общ)',ОсновнаяФорма:'cda28d28-deb6-4df9-954a-9d4e6c3a183f'},{
Гуид:'b48f2738-ed88-4cba-bf26-94aace6da34b',Имя:'КалендарныйПланЗакупок',Синоним:'Календарный план закупок',Комментарий:'',ОсновнаяФорма:'9d82a515-6bce-47be-bf07-c091c9be0f2e'},{
Гуид:'bfc82b16-99df-45f7-b5b4-b02ddbf0210b',Имя:'КалендарьБухгалтера',Синоним:'Календарь бухгалтера',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'ff431d00-6d97-42ef-acee-2e92f66110bc',Имя:'КатегорииОбъекта',Синоним:'Категории объекта',Комментарий:'',ОсновнаяФорма:'37225e8c-6348-4b9e-97fd-f9f3dc21a342'},{
Гуид:'7b13d855-3e4e-43dc-a0be-dd413c92b566',Имя:'КлиентБанк',Синоним:'Клиент банк',Комментарий:'загрузка / выгрузка платежных документов',ОсновнаяФорма:'2546e33b-b83f-434f-9956-82acbc2e2681'},{
Гуид:'383b8afb-b032-438b-b10e-e2b286244a4c',Имя:'КонсольОтчетов',Синоним:'Консоль отчетов',Комментарий:'',ОсновнаяФорма:'1e520e0f-e6e3-4d7e-90d4-a2c770af0109'},{
Гуид:'1135b57b-1e26-498a-90e2-5c4d9df3cec5',Имя:'КонструкторПользовательскихПолей',Синоним:'Конструктор пользовательских полей',Комментарий:'',ОсновнаяФорма:'8f112426-0738-4f74-960c-1c6343d53102'},{
Гуид:'a881b676-45ea-45e5-93bf-d274d902a44f',Имя:'КонструкторСпецификаций',Синоним:'Конструктор спецификаций',Комментарий:'',ОсновнаяФорма:'88f7b7c1-f8b3-4c37-95ef-85283bd69f45'},{
Гуид:'b65d6154-b670-46ab-9991-773f04121d4b',Имя:'КопированиеДанныхБюджетирования',Синоним:'Копирование данных бюджетирования',Комментарий:'',ОсновнаяФорма:'fba8b57f-623c-4bd7-9bf7-b1751e2f809c'},{
Гуид:'20a3794e-cad5-4634-b398-ac547b3f08d4',Имя:'КурсыВалютРБК',Синоним:'Курсы валют РБК',Комментарий:'Загрузка курсов валют с сайта РБК',ОсновнаяФорма:'c83f31c1-9ba5-4d5a-933a-3b8cc68b4e3c'},{
Гуид:'77c4f95e-317b-4b82-bce6-88cceeb22870',Имя:'ЛегальностьПолученияОбновлений',Синоним:'Легальность получения обновлений',Комментарий:'',ОсновнаяФорма:'2500e654-a0d8-4a20-b198-47b7ffca43de'},{
Гуид:'edb60bda-1325-4855-9c30-d021dd62c046',Имя:'МенеджерКонтактов',Синоним:'Менеджер контактов',Комментарий:'',ОсновнаяФорма:'b4909f94-abb6-46eb-b304-c3fc9f840521'},{
Гуид:'c18a3dc0-fe67-4c78-a1b2-95de0824796a',Имя:'МотивацияПерсонала',Синоним:'Мотивация персонала',Комментарий:'',ОсновнаяФорма:'9dfa187f-f6e0-42c4-8cda-8096c31057b8'},{
Гуид:'6b734be9-f5c6-4109-a92f-d2605489d3fb',Имя:'МСФОКонсолидация',Синоним:'Консолидация МСФО',Комментарий:'',ОсновнаяФорма:'9157c114-b8e6-4599-a411-6170a73d96cb'},{
Гуид:'804614e7-5652-4f7c-95a6-16824e211def',Имя:'НаборПерсонала',Синоним:'Набор персонала',Комментарий:'(Упр)',ОсновнаяФорма:'9ed73502-bf4d-4289-b8d5-31b2a665280b'},{
Гуид:'0c63e2a1-e5b8-4985-933b-4889c7a7d6fc',Имя:'НастройкаПараметровУчета',Синоним:'Параметры учета',Комментарий:'',ОсновнаяФорма:'4d593464-8511-4476-986d-360473affe47'},{
Гуид:'e56b4536-629c-49ae-a21c-00f3762e955a',Имя:'НастройкаПравДоступа',Синоним:'Настройка прав доступа',Комментарий:'',ОсновнаяФорма:'d42bd151-e27b-492e-8aba-497fd85bca1c'},{
Гуид:'530340c4-8f94-4c39-9610-9bbd58ab7c9a',Имя:'НастройкаСтратегииРедактированияНомеровОбъектов',Синоним:'Настройка стратегии редактирования номеров (кодов) объектов',Комментарий:'',ОсновнаяФорма:'3025ec72-bbb8-46ce-b0e2-81ef87cffd4a'},{
Гуид:'eaf0bbe8-dde0-4c15-aa77-12949354b1b0',Имя:'НастройкиПрограммы',Синоним:'Настройки программы',Комментарий:'',ОсновнаяФорма:'37074cf4-3275-42f7-a539-971db6d7e6bb'},{
Гуид:'d0fa642d-33cb-4371-8ca4-588ef811f539',Имя:'ОбменДаннымиXML',Синоним:'Обмен данными XML',Комментарий:'',ОсновнаяФорма:'1af4d48a-2f54-492d-a473-7c2f83e5544a'},{
Гуид:'61892994-3a43-4004-83f1-15f371e63ae8',Имя:'ОбменДаннымиСЮнискан',Синоним:'Обмен данными с юнискан',Комментарий:'',ОсновнаяФорма:'1e10ae93-a357-40f7-ab8b-dbea47c3f36c'},{
Гуид:'25a0221b-b6f9-4a02-ac3e-f3286d77f9fe',Имя:'ОбменССайтом',Синоним:'Обмен с WEB - сайтом',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'b87b3cb3-8362-416f-9efc-05e4510b5b18',Имя:'ОбновлениеИнформационнойБазы',Синоним:'Обновление информационной базы',Комментарий:'Обработка выводит описание обновлений информационной базы',ОсновнаяФорма:'403582ef-9559-47fa-a6fd-77405e6eecf9'},{
Гуид:'51a91069-d1a9-4a31-8217-f7353fb097f1',Имя:'ОбновлениеКонфигурации',Синоним:'Обновление конфигурации',Комментарий:'',ОсновнаяФорма:'73b27233-e7ce-4386-a182-fc934df0e9a0'},{
Гуид:'eafd659a-b99e-4f1a-b187-1839afbea7c8',Имя:'ОбновлениеРегламентированнойОтчетности',Синоним:'Обновление регламентированной отчетности',Комментарий:'',ОсновнаяФорма:'a341ef71-0b46-4aec-842a-76bdca5b4aaf'},{
Гуид:'83eb28a2-b850-4e3a-8845-bfc0ae28e75c',Имя:'Обозреватель',Синоним:'Обозреватель',Комментарий:'Просмотр домашней страницы конфигурации',ОсновнаяФорма:'55cd5ead-b8d5-4b68-9c7d-5239246622af'},{
Гуид:'5dafb08e-0489-4c76-a5d0-ae4561bc7fc6',Имя:'ОбработкаТабличнойЧастиТовары',Синоним:'Обработка табличной части "Товары"',Комментарий:'Групповое изменение значений реквизитов табличной части документа',ОсновнаяФорма:'7eb6ccd4-b02f-4b1f-87dd-f8be3bbfade4'},{
Гуид:'99b798ec-1d3f-4081-85c3-008714a8d30a',Имя:'ОбщиеОбъектыРегламентированнойОтчетности',Синоним:'Общие объекты регламентированной отчетности',Комментарий:'',ОсновнаяФорма:'1fb01df3-7f35-4a36-a566-c317f23cda40'},{
Гуид:'4966c8f8-aad9-4dba-a0e3-1ee4065989af',Имя:'ОнлайнСервисыРегламентированнойОтчетности',Синоним:'Оповещения при работе с регламентированной отчетностью',Комментарий:'',ОсновнаяФорма:'962f0e8d-d424-4dc4-b52c-61782f34dad3'},{
Гуид:'a177e1d6-f7c9-4d0f-a7cf-b0df548ecf2b',Имя:'ОтправкаЭлектронногоСообщенияВОтделТехническойПоддержки',Синоним:'Отправка электронного сообщения в отдел технической поддержки',Комментарий:'',ОсновнаяФорма:'2b63e864-799f-406b-b7c9-0f538edfc3eb'},{
Гуид:'256618cc-0956-4cda-9691-e4ced68a791f',Имя:'ОценкаПроизводительности',Синоним:'Оценка производительности',Комментарий:'',ОсновнаяФорма:'6c205eae-9113-46c1-a245-25d29173646e'},{
Гуид:'1ae79a2b-4214-4925-b294-e5192e153835',Имя:'ПакетныйВводБюджетныхОпераций',Синоним:'Пакетный ввод бюджетных операций',Комментарий:'',ОсновнаяФорма:'ada98e7f-a26d-4176-9049-fffc81bbc3d2'},{
Гуид:'c4e3f136-adc9-4a0c-b4cd-a8047616dad0',Имя:'ПакетныйВводДокументов',Синоним:'Пакетный ввод документов',Комментарий:'',ОсновнаяФорма:'7700f53b-0eaf-4307-a4fa-e2ef2fe3567f'},{
Гуид:'6364127f-5761-4499-828f-86529c3dc820',Имя:'ПереносДанныхИзИнформационныхБаз1СПредприятия77',Синоним:'Перенос данных из информационных баз 1С:Предприятия 7.7',Комментарий:'',ОсновнаяФорма:'3be47778-1a90-4450-8087-4033dafbdbd1'},{
Гуид:'f497b389-8801-4d1a-86cf-11cd71667270',Имя:'ПерерасчетЗарплатыОрганизаций',Синоним:'Перерасчет зарплаты организаций',Комментарий:'',ОсновнаяФорма:'2e11bb1b-1dad-481d-8fd1-040305864ef2'},{
Гуид:'2e6e9d03-0438-4d85-b3a1-b6e3473d0381',Имя:'ПереходНаПорядокИсчисленияПособий2010',Синоним:'Переход на порядок исчисления пособий2010',Комментарий:'',ОсновнаяФорма:'3eeec6cc-ab7d-42bb-9bbf-9ac1fdaef43a'},{
Гуид:'258b435b-cc07-4cce-bf7f-54c153154f4a',Имя:'ПечатьПрайсЛиста',Синоним:'Печать прайс-листа',Комментарий:'(Упр)',ОсновнаяФорма:'e3459782-6a7f-4a69-a71f-dc14f63b9f1f'},{
Гуид:'c78227ac-1172-42d9-8793-4bdf4f7d5366',Имя:'ПечатьРаскладкиНоменклатурыПоМестамХранения',Синоним:'Печать раскладки номенклатуры по местам хранения',Комментарий:'(Упр)',ОсновнаяФорма:'8f1f55db-61b6-4db8-bacb-55b29e804b2b'},{
Гуид:'9f7f511d-11c3-48be-84d7-f85812d346f4',Имя:'ПечатьСерийныхНомеров',Синоним:'Печать серийных номеров',Комментарий:'',ОсновнаяФорма:'de624fac-1029-4543-b29c-f6e6d4809c07'},{
Гуид:'d5d03e16-14e9-46a7-b220-fc3ca3b06c9a',Имя:'ПечатьТТН',Синоним:'Печать ТТН',Комментарий:'',ОсновнаяФорма:'8300783e-502e-4767-b896-222006aa88c6'},{
Гуид:'de08d0a2-14c6-4358-a900-61f95dcfee1b',Имя:'ПечатьТТН1208',Синоним:'Бланки ТТН (в ред. постановления Правительства РФ от 30.12.2011 № 1208)',Комментарий:'Бланки ТТН (в ред. постановления Правительства РФ от 30.12.2011 № 1208)',ОсновнаяФорма:'914bbcfc-2625-400b-b10a-b7e6f1ecc312'},{
Гуид:'921eb10f-6901-4696-ae97-77638c4a9bc2',Имя:'ПечатьЦенников',Синоним:'Печать ценников',Комментарий:'',ОсновнаяФорма:'046bdc9d-c844-4bdb-b23f-eef7ed267719'},{
Гуид:'5d4ff18e-eede-4017-9176-10895fedc3b2',Имя:'ПечатьЭтикеток',Синоним:'Печать этикеток',Комментарий:'',ОсновнаяФорма:'69d42c1e-5436-4a96-a9e7-f6885fade2f4'},{
Гуид:'7626eac6-36e0-4189-8df8-618d5d28aae6',Имя:'Планирование',Синоним:'Планирование',Комментарий:'',ОсновнаяФорма:'13b073e7-a954-41bd-9367-95214f94c01e'},{
Гуид:'e8ef94b6-7680-4a58-9673-565131e45f23',Имя:'ПодборМатериаловИАналогов',Синоним:'Подбор материалов и аналогов',Комментарий:'',ОсновнаяФорма:'6756339d-c8ec-462a-81a8-7ed6dce3ba4b'},{
Гуид:'7e78bab2-5a8a-4e5d-8855-0736e0641138',Имя:'ПодборНоменклатуры',Синоним:'Подбор номенклатуры',Комментарий:'',ОсновнаяФорма:'6a0f5abe-bea2-4525-a5bf-4e611747f04a'},{
Гуид:'aca34827-b080-4117-9d9b-4d114be34e4b',Имя:'ПодборНоменклатурыПоОтбору',Синоним:'Подбор номенклатуры по отбору',Комментарий:'',ОсновнаяФорма:'6e073f8f-c918-49fd-a975-48146d6f6d2f'},{
Гуид:'67b4e5bc-c92f-4383-9637-4cda82d09ca8',Имя:'ПодборПараметровРасшифровкиПлатежа',Синоним:'Подбор параметров расшифровки платежа',Комментарий:'',ОсновнаяФорма:'bc03e16d-bdad-4263-8d9f-30e61c730b96'},{
Гуид:'c9f6cc45-895a-468c-a86e-62336c29b083',Имя:'ПодборПрочихЗатрат',Синоним:'Подбор прочих затрат',Комментарий:'',ОсновнаяФорма:'47520469-4e4f-4492-980c-eaba93da6cc1'},{
Гуид:'1f5af5b6-e477-4708-a927-06fb88018fa2',Имя:'ПодготовкаДанныхПоНДФЛ',Синоним:'Подготовка данных по НДФЛ',Комментарий:'',ОсновнаяФорма:'4d8112ef-5fba-4d89-b3e2-4b1b616ee242'},{
Гуид:'ed4d28a6-5c16-49e0-a5de-ccfacf06fea8',Имя:'ПодготовкаДанныхПФР2009',Синоним:'Подготовка данных ПФР (по 2009 год)',Комментарий:'',ОсновнаяФорма:'46025810-0452-4783-8ffd-9925829a48a5'},{
Гуид:'6010364d-4bc1-44ac-ad1f-a1a92bddfcc8',Имя:'ПодготовкаДанныхПФР2010',Синоним:'Подготовка данных ПФР',Комментарий:'',ОсновнаяФорма:'308b0e65-3ce4-44e0-a612-d9fc9df59468'},{
Гуид:'7e8ec2c4-3dd1-42b4-95f2-3d2da9ca8c65',Имя:'ПоискДанных',Синоним:'Поиск данных',Комментарий:'',ОсновнаяФорма:'fb76358c-0162-4dbc-aaf2-3ef6f9566a57'},{
Гуид:'e9302394-0842-441a-9716-02605a86576d',Имя:'ПоискИЗаменаДублирующихсяЭлементов',Синоним:'Поиск и замена дублирующихся элементов справочников',Комментарий:'',ОсновнаяФорма:'68a2b9d2-7ecb-4e3e-96b3-dd9abe50613a'},{
Гуид:'7e7fd6bc-73f0-45be-93d8-0036780e946f',Имя:'ПоискОбъектовВСпискахДанных',Синоним:'Поиск объектов в списках данных',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'2c2824ec-e30e-4d28-be6f-8c178a107c95',Имя:'ПоискЭлектронныхПисемПоОбъектам',Синоним:'Поиск электронных писем по объектам',Комментарий:'',ОсновнаяФорма:'ecaaf864-1d65-459c-a06b-f776e8bd69c3'},{
Гуид:'df33faaf-d829-4780-8f5c-66e0106e56d8',Имя:'ПоказНамеченныхСобытийПоПерсоналу',Синоним:'Показ намеченных событий по персоналу',Комментарий:'(Общ)',ОсновнаяФорма:'a4806c43-3ab6-475d-8f4a-faaa66dd34ef'},{
Гуид:'88305a2f-71fc-4e61-8ae0-9236551f5db6',Имя:'ПолучениеПочты',Синоним:'Получение почты',Комментарий:'',ОсновнаяФорма:'5877991c-579a-44dc-aebb-ad0fc7edaa65'},{
Гуид:'738ae2a8-328b-4901-9682-77c7e66d8c76',Имя:'ПолучениеФайловИзИнтернета',Синоним:'Получение файлов из интернета',Комментарий:'',ОсновнаяФорма:'eae4f761-17b6-4773-ac91-6dd82e6c003c'},{
Гуид:'a1178677-b994-4833-86a0-bba8569f299b',Имя:'ПомощникНастройкиОбменаДанными',Синоним:'Помощник настройки обмена данными',Комментарий:'',ОсновнаяФорма:'dcb6862f-a37d-4d83-a9fb-6f8f393b83d3'},{
Гуид:'bd2cc270-d3b5-4133-82f3-83a6b556f5c6',Имя:'ПомощникНастройкиОбменаДаннымиСРозничнойТорговлей',Синоним:'Помощник настройки обмена данными с розничной торговлей',Комментарий:'',ОсновнаяФорма:'6c1b1fcd-21f3-4b6d-af7f-9d1b701922ce'},{
Гуид:'00f25f2e-c17d-4231-89bc-9c90c68f5cb8',Имя:'ПомощникНастройкиОбменаДаннымиССайтом',Синоним:'Помощник настройки обмена данными с сайтом',Комментарий:'',ОсновнаяФорма:'b9536226-8ac7-47f6-964a-661328b0fd35'},{
Гуид:'d118a39a-bb2a-4c7e-bf87-3ffc6169e6ca',Имя:'ПомощникНастройкиОбменаДаннымиУТУПП',Синоним:'Помощник настройки обмена данными УТУПП',Комментарий:'',ОсновнаяФорма:'6ac30360-9e80-4f40-961d-455c472baf2d'},{
Гуид:'89d89e2f-1524-4d1a-a8ae-cfc7e4447eb1',Имя:'ПомощникПланирования',Синоним:'Помощник планирования',Комментарий:'',ОсновнаяФорма:'f0af343f-6e9f-443d-974f-af945383ae59'},{
Гуид:'82df9582-2a99-442b-9ac6-34c35ee526f0',Имя:'ПредупреждениеОРазницеВоВремениССервером',Синоним:'Предупреждение о разнице во времени с сервером',Комментарий:'',ОсновнаяФорма:'62d56256-e3f0-4da1-8e21-f7eb32afcb8d'},{
Гуид:'a996190e-7429-45e4-a7ac-e6e96367bcff',Имя:'ПроведениеДокументовПоРегистрамНДС',Синоним:'Проведение документов по регистрам НДС',Комментарий:'(Регл)',ОсновнаяФорма:'198da19d-1ee4-44cb-af09-72181d97f328'},{
Гуид:'4066e9be-01ef-4c55-8239-eaf8484ee059',Имя:'ПроведениеПоПартиям',Синоним:'Проведение по партиям',Комментарий:'',ОсновнаяФорма:'98517f07-9cd6-43ff-84e7-98413f0335f6'},{
Гуид:'3262e5c8-bfca-412d-b14a-9095bb9703cc',Имя:'ПроверкаНастройкиВедущихВытесняющихВР',Синоним:'Проверка настройки ведущих и вытесняющих видов расчета',Комментарий:'',ОсновнаяФорма:'738b7ee5-2b66-480a-a2e1-79cc652b7e82'},{
Гуид:'a0cfa907-25c6-44e3-a7f3-264a8284986f',Имя:'ПроверкаШтрихкодов',Синоним:'Проверка штрихкодов',Комментарий:'',ОсновнаяФорма:'c274a9f1-015a-4f9f-aa6f-7f4f9aca6884'},{
Гуид:'1f6706fe-c595-461c-b880-9160c3ac6f2f',Имя:'РабочееМестоМенеджераПоПродажам',Синоним:'Рабочее место менеджера по продажам',Комментарий:'',ОсновнаяФорма:'e9b50a6c-4a89-4f0b-9249-8cd447d28e98'},{
Гуид:'4f39ab60-e06e-4b08-9cfc-880ba12bb546',Имя:'РабочийСтол',Синоним:'Рабочий стол',Комментарий:'',ОсновнаяФорма:'ce3564e7-3170-4475-8ecb-e44e8a2093c9'},{
Гуид:'d662a268-724e-4e48-8035-65127deae49c',Имя:'РабочийСтолМастераСмены',Синоним:'Рабочий стол мастера смены',Комментарий:'',ОсновнаяФорма:'8eadec19-b012-4188-bc33-a6d41c6bde73'},{
Гуид:'ef19ec19-b180-45a1-8f06-080034a7ae8f',Имя:'РасчетАвансовыхПлатежейПоЗемельномуНалогу',Синоним:'Расчет авансовых платежей по земельному налогу',Комментарий:'',ОсновнаяФорма:'c5ca221d-0585-4c15-95c8-e9f58f1b1b51'},{
Гуид:'ee787994-b7aa-47e8-9ec4-311d04ff5132',Имя:'РасчетАвансовыхПлатежейПоТранспортномуНалогу',Синоним:'Расчет авансовых платежей по транспортному налогу',Комментарий:'',ОсновнаяФорма:'97eec0d2-8c35-493f-a96f-40aa8ffd330d'},{
Гуид:'ae411d2e-facb-478c-85db-4b50c053fd2d',Имя:'РасчетЛимитовОтпускаМатериалов',Синоним:'Расчет лимитов отпуска материалов',Комментарий:'',ОсновнаяФорма:'4c19d3d2-022b-4bac-b4d8-a3eb782d2563'},{
Гуид:'26536ef4-4af6-49f6-93bc-c01a0ed44de3',Имя:'РасчетПлановойСебестоимости',Синоним:'Расчет плановой себестоимости',Комментарий:'',ОсновнаяФорма:'ebae97c7-ef04-417d-a18e-d0a28813d0d9'},{
Гуид:'0ccbe311-76e7-49b5-86ed-25fa723dbe97',Имя:'РасшифровкаРегламентированнойОтчетности',Синоним:'Расшифровка регламентированной отчетности',Комментарий:'',ОсновнаяФорма:'6419fc32-ada4-4a83-bf05-a71dad5eef91'},{
Гуид:'534eeb51-116a-4e49-9d12-ab127463e739',Имя:'РегистрацияИзмененийДляОбмена',Синоним:'Регистрация изменений для обмена',Комментарий:'Регистрация изменений для обмена',ОсновнаяФорма:'a9b76c7c-a4e3-47b4-8ca5-39716057038d'},{
Гуид:'03565ec5-0b50-46bc-ab05-e0314ee21e04',Имя:'РегистрацияСчетовФактурНаАванс',Синоним:'Регистрация счетов-фактур на аванс',Комментарий:'',ОсновнаяФорма:'2a131229-0d4e-4a97-bcd1-6e9e3f5ba45f'},{
Гуид:'712d4d2c-72a3-4896-854d-19fd00a9d99c',Имя:'РегистрацияСчетовФактурНалоговогоАгента',Синоним:'Регистрация счетов-фактур налогового агента',Комментарий:'',ОсновнаяФорма:'b538aec4-df05-4d71-91e0-8f5e47438f30'},{
Гуид:'c5c9295c-a8bd-42a5-86f7-f618a9959991',Имя:'РегистрацияСчетовФактурНаСуммовыеРазницы',Синоним:'Регистрация счетов-фактур на суммовые разницы',Комментарий:'',ОсновнаяФорма:'fd1f98b8-6295-46fe-b9cb-e061b2c4ca53'},{
Гуид:'48e12ac3-6d36-428e-aa46-11a82dfdf5b7',Имя:'РегламентированнаяОтчетностьСоотношенияПоказателей',Синоним:'Соотношения показателей в регламентированных отчетах',Комментарий:'',ОсновнаяФорма:'014e9d80-64e8-4335-8ed5-7b64f469c8da'},{
Гуид:'69ecbb4e-454f-43a4-8ca6-4781f82c22e4',Имя:'РегламентноеВосстановлениеСостоянияРасчетовОрганизаций',Синоним:'Восстановление последовательности расчетов',Комментарий:'(Регл) Выделение авансов, пересчет суммовых разниц и корректировок при расчетах в у.е., восстановление последовательности документов по расчетам с контрагентами.',ОсновнаяФорма:'732e6e74-f8ed-4774-9388-8bf8d3510c93'},{
Гуид:'7b925ad6-8a2a-4530-9fde-452c9b920e08',Имя:'РегламентныйПересчетПоМоделямБюджетирования',Синоним:'Регламентный пересчет по моделям бюджетирования',Комментарий:'',ОсновнаяФорма:'9d277ce8-d18b-4351-9972-fd716c5e7b8d'},{
Гуид:'a4f2da43-12d9-4742-a249-ce18219d9f9d',Имя:'РедактированиеВычетовНаДетей2011',Синоним:'Редактирование вычетов на детей - 2011',Комментарий:'',ОсновнаяФорма:'fcfa9045-e47b-467f-89c4-4e0b945a405a'},{
Гуид:'586a591f-938d-4b8e-9c10-0325dc1acdeb',Имя:'РедактированиеДанныхНезарегистрированныхКонтрагентов',Синоним:'Редактирование данных незарегистрированных контрагентов',Комментарий:'',ОсновнаяФорма:'e3295eb2-3898-40cc-8302-e35810e7022f'},{
Гуид:'835fae82-fa3e-4279-ac2f-1c2d5d906c60',Имя:'РедактированиеДанныхРаспределения',Синоним:'Редактирование данных распределения',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'52c43331-1a43-48aa-a633-947a523d4b3d',Имя:'РедактированиеКонтактнойИнформации',Синоним:'Редактирование контактной информации',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'a103c54f-83a3-46ac-a735-1760320df6c7',Имя:'СогласованиеЗаявок',Синоним:'Согласование заявок',Комментарий:'',ОсновнаяФорма:'3c59e7e6-f9a8-4d66-bb19-ae563597e039'},{
Гуид:'7392d842-edcb-4587-b538-e07bd03f9871',Имя:'СообщенияВыполняемыхДействий',Синоним:'Сообщения выполняемых действий',Комментарий:'',ОсновнаяФорма:'d57c9727-ca5f-44b7-8477-9fcd1886e1f4'},{
Гуид:'96431969-8320-4b9f-a4ff-02a474330c1d',Имя:'СоставНабора',Синоним:'Состав набора',Комментарий:'',ОсновнаяФорма:'a6fe3a1d-1c91-4a0d-90ab-55072cab7200'},{
Гуид:'9ad36dff-5ea8-4f1a-9a16-27db329f6818',Имя:'СписокПользователейИБ',Синоним:'Список пользователей ИБ',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'4788cba8-ac7b-4805-a105-550bc67dad4c',Имя:'СтруктураЗависимостейОборотов',Синоним:'Структура зависимостей оборотов',Комментарий:'',ОсновнаяФорма:'b67d85c3-80f8-4aad-8263-420864e4846d'},{
Гуид:'aee98b09-f921-4e3d-aff7-5453e6c316c0',Имя:'ТекущиеСделки',Синоним:'Текущие сделки',Комментарий:'',ОсновнаяФорма:'e3fa5702-05aa-45d6-82d1-6521b09b3e24'},{
Гуид:'4c033f06-c273-47c7-9aff-f863e0256e3b',Имя:'ТестированиеИИсправлениеКлючейРасширеннойАналитикиУчетаЗатрат',Синоним:'Тестирование и исправление ключей аналитики',Комментарий:'',ОсновнаяФорма:'7a2cd159-f0fd-4f22-a7b9-4cf68a3f607b'},{
Гуид:'5a1c2fe1-0ffb-4419-99c1-075989143fe8',Имя:'ТОВыгрузкаВВесыСПечатьюЭтикеток',Синоним:'Выгрузка данных в весы с печатью этикеток',Комментарий:'',ОсновнаяФорма:'608d3142-6e4e-41ca-b533-8f907b44cb0b'},{
Гуид:'a6e6c653-10d2-4b2f-bf31-21637a21c3be',Имя:'ТОВыгрузкаТСД',Синоним:'Выгрузка данных в терминал сбора данных',Комментарий:'',ОсновнаяФорма:'f05d58a2-32c7-4a83-a76a-bf0805b645da'},{
Гуид:'d75ec6d1-84c5-46ba-a25d-df83bb112715',Имя:'ТОЗагрузкаККМOffline',Синоним:'Загрузка данных в ККМ, подключаемые в режиме Off-Line',Комментарий:'Загрузка данных в ККМ, подключаемые в режиме Off-Line.',ОсновнаяФорма:'c72bd0bd-2d20-45e1-9140-cbd858317561'},{
Гуид:'3c0168f7-66ec-4732-b700-ec938055b89f',Имя:'ТОКлиентККМOnline',Синоним:'Клиент ККМ, подключаемой в режиме On-Line',Комментарий:'Данная обработка обрабатывает события от ККМ, подключаемых в режиме On-Line.',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'6e0f299b-c6c0-4b90-ba18-ca84daabf471',Имя:'ТОНастройка',Синоним:'Подключение и настройка торгового оборудования',Комментарий:'Обработка предназначена для настройки торгового оборудования, подключенного к данному компьютеру',ОсновнаяФорма:'e9653959-7866-46a6-9c1e-1bfcef08225e'},{
Гуид:'3d2bb7ef-4670-4fd2-8ac6-cfec08d082e2',Имя:'ТОСервер',Синоним:'Служебная обработка для взаимодействия с торговым оборудованием',Комментарий:'Механизм взаимодействия с торговым оборудованием.',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},{
Гуид:'08e6a9f5-a80f-4a3d-baa5-e56355fcc71c',Имя:'ТОУправлениеЭквайринговойСистемой',Синоним:'Управление эквайринговой системой',Комментарий:'',ОсновнаяФорма:'494ffeda-ce1d-49bb-9057-b3275b0c0f87'},{
Гуид:'15b71c9a-15b3-4b57-af9b-2e5f8e00abf3',Имя:'ТранспортныеУпаковки',Синоним:'Транспортные упаковки',Комментарий:'Обработка осуществляет формирование и печать штрихкодов транспортных упаковок.',ОсновнаяФорма:'c5bc4297-60c9-40fe-808a-f53cb6138407'},{
Гуид:'43f074ca-8ff5-4fcc-bd59-ebfdbed27c4d',Имя:'УдалениеПисемЭлектроннойПочты',Синоним:'Удаление писем электронной почты',Комментарий:'',ОсновнаяФорма:'bfac1d87-21ac-4c8f-bb67-d4ca99ccd558'},{
Гуид:'7dca913d-e37a-4740-8e3d-677d379605ee',Имя:'УдалениеПомеченныхОбъектов',Синоним:'Удаление помеченных объектов',Комментарий:'Поиск и удаление объектов, помеченных на удаление',ОсновнаяФорма:'bd1cf7ef-f3e2-4441-836b-16f2cc227aa9'},{
Гуид:'bbfd32ff-ecf0-49aa-8a7f-e9d348cf46a8',Имя:'УдалениеФайловОтработанныхПакетовЭД',Синоним:'Удаление файлов отработанных пакетов ЭД',Комментарий:'',ОсновнаяФорма:'89d14603-46ef-423b-b8c5-c5fc25aca9ca'},{
Гуид:'629db708-4f53-43f6-8465-0e6608d1957c',Имя:'УниверсальныйЖурналДокументов',Синоним:'Универсальный журнал документов',Комментарий:'',ОсновнаяФорма:'53ae3302-3d8a-4e14-89a0-9e00f317bf00'},{
Гуид:'d9d9bcc3-0776-41c6-adfd-6f61db326e44',Имя:'УниверсальныйОбменДаннымиXML',Синоним:'Универсальный обмен данными в формате XML',Комментарий:'',ОсновнаяФорма:'924bb6d0-1f42-412e-9719-f0ce7260720e'},{
Гуид:'7f85a543-88fd-4d2a-8ab9-d54aeaaab5b8',Имя:'УниверсальныйПоискОбъектов',Синоним:'Универсальный поиск объектов',Комментарий:'',ОсновнаяФорма:'37aeb924-c77b-4b9a-9703-2360b89417b0'},{
Гуид:'6230731f-5056-49fa-995a-f9bdff09ae00',Имя:'УправлениеДаннымиРаботника',Синоним:'Управление данными сотрудника',Комментарий:'',ОсновнаяФорма:'495d617a-e4c2-4479-affd-bce435ed97b4'},{
Гуид:'f3750ea4-5f9e-4ab3-9495-3f182ecff407',Имя:'УправлениеНастройкамиФорм',Синоним:'Управление настройками форм',Комментарий:'',ОсновнаяФорма:'337bd150-beaa-44e6-b336-359e23f8babe'},{
Гуид:'4daac7b9-391a-4305-838c-dd996c4a9b6d',Имя:'УправлениеПерсональнымиДанными',Синоним:'Управление персональными данными',Комментарий:'',ОсновнаяФорма:'a07ee1be-1037-4568-8f63-3456c7286353'},{
Гуид:'874882d4-463d-4cea-9ae6-f535745d4bd9',Имя:'УстановкаГраницыПоследовательностиПартионногоУчета',Синоним:'Установка границы последовательности партионного учета',Комментарий:'',ОсновнаяФорма:'bc80a287-e871-4aef-b26c-fde4c6865e1f'},{
Гуид:'6bcdaa54-6d13-4cb5-bcbd-61d9ce090517',Имя:'УтверждениеCхемыМотивации',Синоним:'Утверждение схемы мотивации',Комментарий:'',ОсновнаяФорма:'7fb3db8c-24f1-4030-9046-7dc5962d69bf'},{
Гуид:'9bfd0152-a519-4cec-b657-5a18a4a42460',Имя:'ФормированиеДокументовПоДаннымОперативногоУчетаПроизводства',Синоним:'Формирование документов по данным оперативного учета производства',Комментарий:'',ОсновнаяФорма:'aad3c8e7-62e2-4b70-b24e-706327849c47'},{
Гуид:'0afdc8ff-3185-4c77-bd14-66c82707c538',Имя:'ФормированиеДокументовПоДаннымОрдеров',Синоним:'Формирование документов по ордерам',Комментарий:'',ОсновнаяФорма:'3f0a39be-9b8e-454d-b4bb-3eeeef122b03'},{
Гуид:'ced7ef8c-58a4-4b74-9715-65816cc87d48',Имя:'ФормированиеДокументовПоНДС',Синоним:'Формирование документов по НДС',Комментарий:'',ОсновнаяФорма:'1579a80e-1bf8-4a2e-b1b4-ed828778290d'},{
Гуид:'3c6c04e5-6f15-4071-a72b-c39b8a8b174f',Имя:'ФормированиеЗаказовНаОбслуживаниеОС',Синоним:'Формирование заказов на обслуживание ОС',Комментарий:'',ОсновнаяФорма:'d6ee2da2-af82-4350-8fb0-0d9e324afc7b'},{
Гуид:'cdb57fe2-cf77-4c2e-ae52-8771bd51e9e3',Имя:'ФормированиеПоказателейСхемМотивации',Синоним:'Формирование показателей схем мотивации',Комментарий:'',ОсновнаяФорма:'83f1b21b-d45d-4665-947b-01bf957e9f70'},{
Гуид:'9182035b-1d9d-473b-a1c9-5b56175ee71d',Имя:'ФормированиеСпискаРаботников',Синоним:'Формирование списка сотрудников',Комментарий:'(Общ)',ОсновнаяФорма:'228f309b-1cff-486b-96f7-6e36f3ad2b2b'},{
Гуид:'ce91bb26-82ce-4d36-a486-8b7d126c981f',Имя:'ФормированиеЦен',Синоним:'Формирование цен',Комментарий:'(Упр)',ОсновнаяФорма:'d9018b89-f4d8-4d71-a88a-5092496a8eb5'},{
Гуид:'3be59c52-ff28-4808-98ca-0e09056cefdb',Имя:'ЭкспортИмпортКонтактныхДанныхОбъектов',Синоним:'Экспорт / Импорт контактных данных объектов',Комментарий:'',ОсновнаяФорма:'34b14f41-b692-4d2e-968b-58c956fe7616'},{
Гуид:'5b17e677-d67a-4179-bd11-3c107683864d',Имя:'ЭкспортСоответствияСчетовБУиМСФО',Синоним:'Экспорт соответствия счетов БУ и МСФО',Комментарий:'',ОсновнаяФорма:'a9457c66-8316-451f-9014-6729000b7dfe'},{
Гуид:'b652356e-15b7-4357-8551-f4547a7a206f',Имя:'ЭлектронныеДокументы',Синоним:'Обмен электронными документами',Комментарий:'',ОсновнаяФорма:'00000000-0000-0000-0000-000000000000'},
]);