
using System;
using System.Data.SqlClient;
using System.Collections.Generic;
using V82;
using V82.ДокументыСсылка;
using V82.Документы;//Менеджер;
using V82.ДокументыСсылка;
using V82.Перечисления;//Ссылка;
namespace V82.ДокументыВыборка
{
	///<summary>
	///Документом отрабытываются положения переходного периода по НДС, связанному со строительством (п.3 и п.6 статьи 3 закона №119-ФЗ)
	///</summary>
	public partial class УчетПоложенийПереходногоПериодаПоНДС: List<ДокументыСсылка.УчетПоложенийПереходногоПериодаПоНДС>
	{
	}
}