
using System;
using Rest;
using System.Globalization;
using System.Collections.Generic;
using ServiceStack.ServiceHost;
using ServiceStack.ServiceInterface;

namespace V82.Справочники
{
	//TarifyPochtovogoSbora
	[Маршрут("Справочники/ТарифыПочтовогоСбора","")]
	public class ТарифыПочтовогоСбораЗапрос: V82.СправочникиСсылка.ТарифыПочтовогоСбора,IReturn<ТарифыПочтовогоСбораЗапрос>
	{
	}
	[Маршрут("Справочники/ТарифыПочтовогоСбора/НайтиПоСсылке","{Ссылка}")]
	[Маршрут("Справочники/ТарифыПочтовогоСбора/ПоСсылке","{Ссылка}")]
	public class ТарифыПочтовогоСбораНайтиПоСсылке: V82.СправочникиСсылка.ТарифыПочтовогоСбора,IReturn<ТарифыПочтовогоСбораНайтиПоСсылке>
	{
	}
	[Маршрут("Справочники/ТарифыПочтовогоСбора/НайтиПоКоду","{Код}")]
	[Маршрут("Справочники/ТарифыПочтовогоСбора/ПоКоду","{Код}")]
	public class ТарифыПочтовогоСбораНайтиПоКоду: V82.СправочникиСсылка.ТарифыПочтовогоСбора,IReturn<ТарифыПочтовогоСбораНайтиПоКоду>
	{
	}
	[Маршрут("Справочники/ТарифыПочтовогоСбора/НайтиПоНаименованию","{Наименование}")]
	[Маршрут("Справочники/ТарифыПочтовогоСбора/ПоНаименованию","{Наименование}")]
	public class ТарифыПочтовогоСбораНайтиПоНаименованию: V82.СправочникиСсылка.ТарифыПочтовогоСбора,IReturn<ТарифыПочтовогоСбораНайтиПоНаименованию>
	{
	}
	[Маршрут("Справочники/ТарифыПочтовогоСбора/ВыбратьПоСсылке","{___Первые}/{___Мин}/{___Макс}")]
	public class ТарифыПочтовогоСбораВыбратьПоСсылке: V82.СправочникиСсылка.ТарифыПочтовогоСбора,IReturn<ТарифыПочтовогоСбораВыбратьПоСсылке>
	{
		public int ___Первые {get; set;}
		public Guid ___Мин {get; set;}
		public Guid ___Макс {get; set;}
	}
	[Маршрут("Справочники/ТарифыПочтовогоСбора/ВыбратьПоКоду","{___Первые}/{___Мин}/{___Макс}")]
	public class ТарифыПочтовогоСбораВыбратьПоКоду: V82.СправочникиСсылка.ТарифыПочтовогоСбора,IReturn<ТарифыПочтовогоСбораВыбратьПоКоду>
	{
		public int ___Первые {get; set;}
		public string ___Мин {get; set;}
		public string ___Макс {get; set;}
	}
	[Маршрут("Справочники/ТарифыПочтовогоСбора/ВыбратьПоНаименованию","{___Первые}/{___Мин}/{___Макс}")]
	public class ТарифыПочтовогоСбораВыбратьПоНаименованию: V82.СправочникиСсылка.ТарифыПочтовогоСбора,IReturn<ТарифыПочтовогоСбораВыбратьПоНаименованию>
	{
		public int ___Первые {get; set;}
		public string ___Мин {get; set;}
		public string ___Макс {get; set;}
	}

	public class ТарифыПочтовогоСбораОтвет
	{
		public string Ответ {get;set;}
	}

	public class ТарифыПочтовогоСбораСервис : Service
	{
		
		public object Get(ТарифыПочтовогоСбораНайтиПоСсылке Запрос)
		{
			return null;
		}
		
		public object Get(ТарифыПочтовогоСбораНайтиПоКоду Запрос)
		{
			if(Запрос.Код == null)
			{
				return null;
			}
			string СтрокаКод = System.Uri.UnescapeDataString(Запрос.Код);
			var Ссылка = V82.Справочники.ТарифыПочтовогоСбора.НайтиПоКоду(СтрокаКод);
			if (Ссылка == null)
			{
				return new ТарифыПочтовогоСбораОтвет() {Ответ = "ТарифыПочтовогоСбора c кодом '" + Запрос.Код+"' не найдено."};
			}
			return Ссылка;
		}
		
		public object Get(ТарифыПочтовогоСбораНайтиПоНаименованию Запрос)
		{
			return null;
		}
		
		public object Get(ТарифыПочтовогоСбораВыбратьПоСсылке Запрос)
		{
			return null;
		}
		
		public object Get(ТарифыПочтовогоСбораВыбратьПоКоду Запрос)
		{
			return null;
		}
		
		public object Get(ТарифыПочтовогоСбораВыбратьПоНаименованию Запрос)
		{
			return null;
		}

		public object Any(ТарифыПочтовогоСбораЗапрос Запрос)
		{
			return new ТарифыПочтовогоСбораОтвет {Ответ = "ТарифыПочтовогоСбора, "};
		}

		public object Post(ТарифыПочтовогоСбораЗапрос ЗапросТарифыПочтовогоСбора)
		{
			var Ссылка = (СправочникиСсылка.ТарифыПочтовогоСбора)ЗапросТарифыПочтовогоСбора;
			var Объект = Ссылка.ПолучитьОбъект();
			Объект.Записать();
			return null;
		}


	}
}