using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class АттестацииРаботниковДополнительный
	{
		////////////////////////////////////////////////////////////////////////////////
		// Вспомогательные процедуры, функции
		////////////////////////////////////////////////////////////////////////////////
		// Процедуры, функции объекта
		////////////////////////////////////////////////////////////////////////////////
		// Процедуры, функции для работы формы

		public void ОткрытьФормуОтбора(/*Форма, ОбработкаОбъект*/)
		{
			/*ПроцедурыУправленияПерсоналом.ОткрытьФормуОтбораСпискаРаботников(Форма, ОбщегоНазначения.ПолучитьРабочуюДату(), "Работники");*/
		}

		public void ПриОткрытииФормыДополнительно(/*Форма*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}
	}
}

