using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class ƒокументыѕоЌачислению«арплатыќрганизацийѕереопредел€емый
	{
		// ¬озвращает список видов документов дл€ этого журнала в виде списка значений
		//

		public object ѕолучить—писок¬идовƒокументов(/*м—писок¬идовƒокументов*/)
		{
			if(true/*м—писок¬идовƒокументов <> Ќеќпределено*/)
			{
			}
			/*м—писок¬идовƒокументов = Ќовый —писок«начений;*/
			/*м—писок¬идовƒокументов.ƒобавить("Ќачисление«арплаты–аботникамќрганизаций");*/
			/*м—писок¬идовƒокументов.ƒобавить();*/
			/*м—писок¬идовƒокументов.ƒобавить("ѕремии–аботниковќрганизаций");*/
			/*м—писок¬идовƒокументов.ƒобавить("–егистраци€–азовыхЌачислений–аботниковќрганизаций");*/
			/*м—писок¬идовƒокументов.ƒобавить("–егистраци€–азовых”держаний–аботниковќрганизаций");*/
			/*м—писок¬идовƒокументов.ƒобавить();*/
			/*–абота—ƒиалогами« .ƒополнить—писок¬идовƒокументов(ћетаданные.∆урналыƒокументов.ƒокументыѕоЌачислению«арплатыќрганизаций, м—писок¬идовƒокументов);*/
			return null;
		}
	}
}

