using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class ƒолжностиќрганизацийƒополнительный
	{
		////////////////////////////////////////////////////////////////////////////////
		// ¬спомогательные процедуры, функции
		////////////////////////////////////////////////////////////////////////////////
		// ѕроцедуры, функции объекта
		////////////////////////////////////////////////////////////////////////////////
		// ѕроцедуры, функции дл€ работы формы

		public void ‘ормаЁлементаѕередќткрытиемƒополнительно(/*‘орма, ќбработчикѕри»змении*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ¬ыполнитьƒополнительныеƒействи€ѕри»зменении(/*Ёлемент, ‘орма*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
	}
}

