using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class ƒоговорЌа¬ыполнение–абот—‘изЋицомѕереопредел€емый
	{

		public void ƒобавить—троку¬–егл”четѕлановыхЌачислений–аботниковќрганизаций(/*ќбъект, ¬ыборкаѕоЎапкеƒокумента*/)
		{
			/*// регистрируем способы отражени€ в учете
*/
			if(true/*Ќ≈ «начение«аполнено(ќбъект.—пособќтражени€¬Ѕухучете) » Ќ≈ «начение«аполнено(ќбъект.ќтнесение–асходов ƒе€тельности≈Ќ¬ƒ)*/)
			{
				/*//не задан способ отражени€, не регистрируем в регистре сведений
*/
			}
			/*//ƒвижени€ по регистру "–егл”четѕлановыхЌачислений–аботниковќрганизаций"
*/
			/*ƒвижение = ќбъект.ƒвижени€.–егл”четѕлановыхЌачислений–аботниковќрганизаций.ƒобавить();*/
			if(true/*ќбъект.’арактерќплаты = ѕеречислени€.’арактер¬ыплатыѕоƒоговору.ќднократно¬ онце—рока*/)
			{
				/*ƒвижение.ѕериод	= Ќачалоћес€ца(ќбъект.ƒатаќкончани€);*/
			}
			/*// »змерени€
*/
			/*ƒвижение.—отрудник			= ќбъект.—отрудник;*/
			/*ƒвижение.ќрганизаци€		= ќбщегоЌазначени€.√оловна€ќрганизаци€(ќбъект.ќрганизаци€);*/
			/*ƒвижение.¬ид–асчета			= ќбъект.¬ид–асчета;*/
			/*ƒвижение.ƒокументќснование 	= ќбъект.—сылка;*/
			/*// –есурсы
*/
			/*ƒвижение.—пособќтражени€¬Ѕухучете			= ќбъект.—пособќтражени€¬Ѕухучете;*/
			/*ƒвижение. одƒохода≈—Ќ						= ¬ыборкаѕоЎапкеƒокумента. одƒохода≈—Ќ;*/
			/*ƒвижение.ќтнесение–асходов ƒе€тельности≈Ќ¬ƒ = ќбъект.ќтнесение–асходов ƒе€тельности≈Ќ¬ƒ;*/
		}
		// ‘ормирует пон€тное описание пор€дка отражени€ в учете
		//
		// ѕараметры
		//  ќбъект - ƒокументќбъект.ƒоговорЌа¬ыполнение–абот—‘изЋицом -
		//                 документ, данные которого отображаютс€ на форме
		//
		// ¬озвращаемое значение:
		//   строка
		//

		public object ѕолучитьќписаниеќтражени€¬”чете(/*ќбъект, –асшифровкаќтражение¬Ѕухучете = Ќеопределено*/)
		{
			if(true/*–асшифровкаќтражение¬Ѕухучете = Ќеопределено*/)
			{
				/*–асшифровкаќтражение¬Ѕухучете = –абота—ƒиалогамиƒополнительный.ѕолучитьѕредставление—пособаќтражени€Ќачислени€¬”четах(ќбъект.—пособќтражени€¬Ѕухучете, »стина);*/
			}
			return null;
		}
		// ѕолучитьќписаниеќтражени€¬”чете()

		public void ќформить оманднуюѕанель‘ормы(/* омандна€ѕанель*/)
		{
			/*ƒоговорЌа¬ыполнение–абот—‘изЋицомƒополнительный.”точнить¬водЌаќсновании( омандна€ѕанель);*/
		}
	}
}

