using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class «а€вки андидатовѕереопредел€емый
	{
		////////////////////////////////////////////////////////////////////////////////
		// ¬спомогательные процедуры, функции
		////////////////////////////////////////////////////////////////////////////////
		// ѕроцедуры, функции объекта

		public void ƒополнить»нициализацию–еквизитов(/*Ётотќбъект*/)
		{
			/*–ежимЌабораѕерсонала = ѕроцедуры”правлени€ѕерсоналомƒополнительный.ѕолучить–ежимЌабораѕерсонала();*/
			if(true/*–ежимЌабораѕерсонала = ѕеречислени€.¬идыќрганизационной—труктурыѕредпри€ти€.ѕо÷ентрамќтветственности*/)
			{
				if(true/*Ётотќбъект.ѕодразделение = Ќеопределено »Ћ» Ётотќбъект.ѕодразделение.ѕуста€()*/)
				{
					/*Ётотќбъект.ѕодразделение = ”правлениеѕользовател€ми.ѕолучить«начениеѕо”молчанию(гл«начениеѕеременной("гл“екущийѕользователь"), "ќсновноеѕодразделение");*/
				}
			}
		}
		////////////////////////////////////////////////////////////////////////////////
		// ѕроцедуры, функции дл€ работы формы справочника

		public void ѕолучитьѕустоеѕодразделение(/*ѕодразделение*/)
		{
			/*–ежимЌабораѕерсонала = ѕроцедуры”правлени€ѕерсоналомƒополнительный.ѕолучить–ежимЌабораѕерсонала();*/
			if(true/*–ежимЌабораѕерсонала = ѕеречислени€.¬идыќрганизационной—труктурыѕредпри€ти€.ѕо—труктуреёридическихЋиц*/)
			{
				if(true/*“ип«нч(ѕодразделение) <> “ип("—правочник—сылка.ѕодразделени€ќрганизаций")*/)
				{
					/*ѕодразделение = —правочники.ѕодразделени€ќрганизаций.ѕуста€—сылка();*/
				}
			}
		}

		public void ”становить¬идимостьЁлементов”правлени€‘ормы—писка(/*‘орма*/)
		{
			/*–ежимЌабораѕерсонала = ѕроцедуры”правлени€ѕерсоналомƒополнительный.ѕолучить–ежимЌабораѕерсонала();*/
			/*ѕоказыватьќрганизацию = –ежимЌабораѕерсонала = ѕеречислени€.¬идыќрганизационной—труктурыѕредпри€ти€.ѕо—труктуреёридическихЋиц;*/
			/*‘орма.Ёлементы‘ормы.—правочник—писок. олонки.ќрганизаци€.¬идимость			= ѕоказыватьќрганизацию;*/
			/*‘орма.Ёлементы‘ормы.—правочник—писок. олонки.ќрганизаци€.»змен€тьЌастройку	= ѕоказыватьќрганизацию;*/
			/*‘орма.Ёлементы‘ормы.ќрганизаци€‘лаг.¬идимость								= ѕоказыватьќрганизацию;*/
			/*‘орма.Ёлементы‘ормы.ќрганизаци€.¬идимость									= ѕоказыватьќрганизацию;*/
		}

		public void ”становить¬идимостьЁлементов”правлени€‘ормыЁлемента(/*‘орма*/)
		{
			/*–ежимЌабораѕерсонала = ѕроцедуры”правлени€ѕерсоналомƒополнительный.ѕолучить–ежимЌабораѕерсонала();*/
			if(true/*–ежимЌабораѕерсонала = ѕеречислени€.¬идыќрганизационной—труктурыѕредпри€ти€.ѕо÷ентрамќтветственности*/)
			{
				/*‘орма.Ёлементы‘ормы.ѕанельќрганизаци€.—вертка	= –ежим—верткиЁлемента”правлени€.¬ерх;*/
			}
		}

		public void ¬ыполнитьќформление—троки(/*Ёлемент, ќформлени€—трок*/)
		{
			if(true/*Ёлемент.»м€ = "ѕереписка¬стречиќпросы"*/)
			{
			}
		}

		public object ƒоступенќтборѕоќрганизации(/**/)
		{
			/*–ежимЌабораѕерсонала = ѕроцедуры”правлени€ѕерсоналомƒополнительный.ѕолучить–ежимЌабораѕерсонала();*/
			return null;
		}
		////////////////////////////////////////////////////////////////////////////////
		// ѕроцедуры, функции работы с QR кодом

		public object ЁтоQR од онтакта(/*ќписание—обыти€*/)
		{
			/*// ¬ данной конфигурации распознавание QR кодов не поддерживаетс€
*/
			return null;
		}

		public object ќбработать—обытиеќт—канераЎтрихкода(/*ќписание—обыти€, ќписаниеќшибки = ""*/)
		{
			/*// ¬ данной конфигурации распознавание QR кодов не поддерживаетс€
*/
			return null;
		}
	}
}

