using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class КадровыйПланПереопределяемый
	{
		////////////////////////////////////////////////////////////////////////////////
		// Вспомогательные процедуры, функции
		////////////////////////////////////////////////////////////////////////////////
		// Процедуры, функции объекта
		////////////////////////////////////////////////////////////////////////////////
		// Процедуры, функции для работы формы

		public void ПриОткрытииДополнительно(/*ЭтаФорма*/)
		{
			/*ПодразделениеКолонка = ЭтаФорма.ЭлементыФормы.РегистрСведенийСписок.Колонки.Вставить(2, "Подразделение");*/
			/*ПодразделениеКолонка.Данные = "Подразделение";*/
			/*ЭтаФорма.ЭлементыФормы.РегистрСведенийСписок.Колонки["ПодразделениеОрганизации"].Положение = ПоложениеКолонки.НаСледующейСтроке;*/
		}
	}
}

