using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class КомандировкиОрганизацийПереопределяемый
	{
		////////////////////////////////////////////////////////////////////////////////
		// Процедуры, функции формы документа

		public void ФормаДокументаПередОткрытиемДополнительно(/*Форма, ДополнительныеОбработчики*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ВыполнитьДополнительныеДействияФормы(/*Форма, Кнопка*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}
	}
}
