using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class КомпетенцииРаботниковПереопределяемый
	{
		///////////////////////////////////////////////////////////////////////////////
		// Процедуры и функции, расширяющие действие обработчиков формы элемента

		public void ФормаЭлементаПередОткрытиемДополнительно(/*Форма, ДополнительныеДействия*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ФормаЭлементаПриОткрытииДополнительно(/*Форма*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ФормаЭлементаПриОткрытииДополнительно

		public void ФормаЭлементаПередЗаписьюДополнительно(/*Форма, Отказ*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ФормаЭлементаПередЗаписьюДополнительно

		public void ФормаЭлементаПриЗаписиДополнительно(/*Форма, Отказ*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ФормаЭлементаПриЗаписиДополнительно

		public void ВыполнитьДополнительныеДействия(/*ИмяКоманды, Форма*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}
	}
}
