using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class ћодульќбычногоѕриложени€ѕереопредел€емый
	{

		public void »нициализировать—тартовую‘орму(/**/)
		{
			if(true/*ѕравоƒоступа("»спользование", ћетаданные.ќбработки.Ќаборѕерсонала)
	   » ”правлениеѕользовател€ми.ѕолучить«начениеѕо”молчанию(гл«начениеѕеременной("гл“екущийѕользователь"), "јвтооткрытиеЌабораѕри«апускеѕрограммы") = »стина*/)
			{
				/*ќбработки.Ќаборѕерсонала.ѕолучить‘орму().ќткрыть();*/
			}
		}
	}
}

