using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class МодульПоискаВДанных
	{
		////////////////////////////////////////////////////////////////////////////////
		// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С УНИВЕРСАЛЬНЫМ ПОИСКОМ ДАННЫХ
		//функция создает сервисный объект для поиска номенклатуры

		public object СоздатьОбъектПоискаДанныхДляНоменклатуры(/*Знач ЭлементФормыЗначениеОтбора, Знач ОбъектФормыСписок, Знач СписокДанных*/)
		{
			//мПоискОбъектовВСпискахДанных = Обработки.ПоискОбъектовВСпискахДанных.Создать();
			//мПоискОбъектовВСпискахДанных.ТипОбъектовПоиска = Тип("СправочникСсылка.Номенклатура");
			//мПоискОбъектовВСпискахДанных.ПрефиксНазванияСпискаДляСохранения = "мСписокЗначенийОтбораНоменклатуры.";
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам = Новый СписокЗначений();
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Наименование", "Наименование");
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Артикул", "Артикул");
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("НаименованиеПолное", "Полное наименование");
			//мПоискОбъектовВСпискахДанных.ОбъектФормыЗначениеОтбораСпискаДанных = ЭлементФормыЗначениеОтбора;
			//мПоискОбъектовВСпискахДанных.ОбъектФормыСписок = ОбъектФормыСписок;
			//мПоискОбъектовВСпискахДанных.Список = СписокДанных;
			//мПоискОбъектовВСпискахДанных.ПрефиксПутиСохраненияНастроекПользователя = "Справочники.Номенклатура.ФормаСписка";
			return null;
		}
		//функция создает сервисный объект для поиска Контрагенты

		public object СоздатьОбъектПоискаДанныхДляКонтрагентов(/*Знач ЭлементФормыЗначениеОтбора, Знач ОбъектФормыСписок, Знач СписокДанных*/)
		{
			//мПоискОбъектовВСпискахДанных = Обработки.ПоискОбъектовВСпискахДанных.Создать();
			//мПоискОбъектовВСпискахДанных.ТипОбъектовПоиска = Тип("СправочникСсылка.Контрагенты");
			//мПоискОбъектовВСпискахДанных.ПрефиксНазванияСпискаДляСохранения = "мСписокЗначенийОтбораКонтрагенты.";
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам = Новый СписокЗначений();
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Код", "Код");
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Наименование", "Наименование");
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("НаименованиеПолное", "Полное наименование");
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("ИНН", "ИНН");
			//мПоискОбъектовВСпискахДанных.ОбъектФормыЗначениеОтбораСпискаДанных = ЭлементФормыЗначениеОтбора;
			//мПоискОбъектовВСпискахДанных.ОбъектФормыСписок = ОбъектФормыСписок;
			//мПоискОбъектовВСпискахДанных.Список = СписокДанных;
			//мПоискОбъектовВСпискахДанных.ПрефиксПутиСохраненияНастроекПользователя = "Справочники.Контрагенты.ФормаСписка";
			return null;
		}
		//функция создает сервисный объект для поиска Физические лица

		public object СоздатьОбъектПоискаДанныхДляФизЛиц(/*Знач ЭлементФормыЗначениеОтбора, Знач ОбъектФормыСписок, Знач СписокДанных*/)
		{
			//мПоискОбъектовВСпискахДанных = Обработки.ПоискОбъектовВСпискахДанных.Создать();
			//мПоискОбъектовВСпискахДанных.ТипОбъектовПоиска = Тип("СправочникСсылка.ФизическиеЛица");
			//мПоискОбъектовВСпискахДанных.ПрефиксНазванияСпискаДляСохранения = "мСписокЗначенийОтбораФизическиеЛица.";
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам = Новый СписокЗначений();
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("Наименование", "Наименование");
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("ИНН", "ИНН");
			//мПоискОбъектовВСпискахДанных.СписокБыстрыхОтборовПоРеквизитам.Добавить("СтраховойНомерПФР", "Страховой номер ПФР");
			//мПоискОбъектовВСпискахДанных.ОбъектФормыЗначениеОтбораСпискаДанных = ЭлементФормыЗначениеОтбора;
			//мПоискОбъектовВСпискахДанных.ОбъектФормыСписок = ОбъектФормыСписок;
			//мПоискОбъектовВСпискахДанных.Список = СписокДанных;
			//мПоискОбъектовВСпискахДанных.ПрефиксПутиСохраненияНастроекПользователя = "Справочники.ФизическиеЛица.ФормаСписка";
			return null;
		}
	}
}
