using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class МодульОбычногоПриложенияПереопределяемый
	{

		public void ИнициализироватьСтартовуюФорму(/**/)
		{
			if(true/*ПравоДоступа("Использование", Метаданные.Обработки.НаборПерсонала)
	   И УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "АвтооткрытиеНабораПриЗапускеПрограммы") = Истина*/)
			{
				/*Обработки.НаборПерсонала.ПолучитьФорму().Открыть();*/
			}
		}
	}
}

