using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class Ќачисление«арплаты–аботникамѕереопредел€емый
	{

		public object “екст«апросаѕоказателей¬ида–асчетов(/**/)
		{
			return null;
		}

		public void ƒобавитьќбъединение«начений≈жемес€чныхѕоказателей(/*“екст«апроса*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ƒобавитьќбъединениеƒополнительныхЌачислений”держаний(/*“екст«апроса, «аполн€тьЌачислени€, «аполн€ть”держани€*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ‘ормаƒокументаѕередќткрытиемƒополнительно(/*‘орма, ƒополнительныеќбработчики, ƒополнительныеќбработчикиѕол€*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ѕогашение«аймовƒоговор«аймаЌачало¬ыбораƒополнительно(/*Ёлементы‘ормыƒокумента, ‘ормаƒокумента, Ёлемент, —тандартна€ќбработка*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ѕогашение«аймовƒоговор«аймаЌачало¬ыбораƒополнительно()

		public void ѕогашение«аймовѕередЌачалом»зменени€ƒополнительно(/*Ёлементы‘ормыƒокумента, Ёлемент, ќтказ*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ѕогашение«аймовѕередЌачалом»зменени€()

		public void ѕогашение«аймовѕриѕолученииƒанныхƒополнительно(/*Ёлемент, ќформлени€—трок*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ѕогашение«аймовѕриѕолученииƒанных()

		public void ѕогашение«аймов¬идƒоговораѕри»змененииƒополнительно(/*Ёлементы‘ормыƒокумента, Ёлемент*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ѕогашение«аймов¬идƒоговораѕри»змененииƒополнительно()

		public void ѕогашение«аймовѕриЌачале–едактировани€ƒополнительно(/*Ёлементы‘ормыƒокумента, Ёлемент, Ќова€—трока,  опирование*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ѕогашение«аймовѕриЌачале–едактировани€ƒополнительно()
		// ‘ункци€ определ€ет вид учета времени дл€ записи в регистр расчета
		//  дл€ каждой строки документа
		//

		public object ¬иды”чета¬ремениѕоƒокументу(/*ƒокумент—сылка, ‘излицо = Ќеопределено*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
			return null;
		}
		// ¬иды”чета¬ремениѕоƒокументу

		public object ¬ид”чета¬ремени—трокиЌачислени€(/*¬ыборкаѕо—трокамƒокумента, ¬иды”чета¬ремени*/)
		{
			return null;
		}
	}
}

