using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class Ќачисление«арплаты–аботникамќрганизацийѕереопредел€емый
	{

		public void ‘ормаƒокументаѕередќткрытиемƒополнительно(/*‘орма, ƒополнительныеќбработчики, ƒополнительныеќбработчикиѕол€*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ”становить“екстƒополнительно(/*ячейки*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ”становить“екстƒополнительно()

		public void ќбработка¬ыбораƒополнительно(/*Ёлемент, ¬ыбранное«начение, —тандартна€ќбработка*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ќбработка¬ыбораƒополнительно()

		public void ƒоговор«аймаЌачало¬ыбораƒополнительно(/*Ёлементы‘ормыƒокумента, ‘ормаƒокумента, Ёлемент, —тандартна€ќбработка*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ƒоговор«аймаЌачало¬ыбораƒополнительно()

		public void ¬идƒоговораѕри»змененииƒополнительно(/*Ёлементы‘ормыƒокумента, Ёлемент*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ¬идƒоговораѕри»змененииƒополнительно()

		public void ѕогашение«аймовѕриЌачале–едактировани€ƒополнительно(/*Ёлементы‘ормыƒокумента, Ёлемент, Ќова€—трока,  опирование*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ѕогашение«аймовѕриЌачале–едактировани€ƒополнительно()

		public void ѕогашение«аймовѕередЌачалом»зменени€ƒополнительно(/*Ёлементы‘ормыƒокумента, м‘излица»справление, м“екущее‘излицо, Ёлемент, ќтказ*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ѕогашение«аймовѕередЌачалом»зменени€ƒополнительно()
	}
}

