using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class ОбработкаТабличныхЧастейПереопределяемый
	{
		////////////////////////////////////////////////////////////////////////////////
		// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ТАБЛИЧНЫМИ ПОЛЯМИ
		////////////////////////////////////////////////////////////////////////////////
		// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ РЕКВИЗИТОВ

		public void ПолучитьФизлицИзДополнительныхТабличныхЧастей(/*Источник, Отказ, РежимЗаписи, РежимПроведения, СоответствиеФизлица*/)
		{
			if(true/*Источник.Метаданные().ТабличныеЧасти.Найти("ОтражениеВУчете") = Неопределено*/)
			{
			}
		}
	}
}
