using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class ОбновлениеИнформационнойБазыКлиентПереопределяемый
	{
		///////////////////////////////////////////////////////////////////////////////
		// ИНТЕРФЕЙСНАЯ ЧАСТЬ ПЕРЕОПРЕДЕЛЯЕМОГО МОДУЛЯ
		// Вызывается при нажатии на гиперссылку или двойном щелчке на ячейке
		// табличного документа с описанием изменений системы.
		//
		// Параметры:
		//   Область - ОбластьЯчеекТабличногоДокумента - область документа, на
		//             которой произошло нажатие.
		//

		public void ПриНажатииНаГиперссылкуВДокументеОписанияОбновлений(/*Знач Область*/)
		{
			//БиблиотекаОбновленияИнформационнойБазыКлиент.ПриНажатииНаГиперссылкуВДокументеОписанияОбновлений(Область);
		}
	}
}

