using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class ОсновныеНачисленияРаботниковОрганизацийПереопределяемый
	{

		public void ПриОткрытииДополнительно(/*Форма*/)
		{
			//РаботаСДиалогами.ВставитьКолонкуВТабличноеПоле(, Форма.ЭлементыФормы.РегистрРасчетаСписок, "ВариантОбработкиЗаписиПриОтраженииВРеглУчете", "Вариант обработки записи при отражении в регл. учете", "ВариантОбработкиЗаписиПриОтраженииВРеглУчете");
		}
	}
}
