using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class ОтпускаОрганизацийПереопределяемый
	{

		public void ОбработкаЗаполненияДополнительно(/*ЭтотОбъект, Основание*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ДополнитьПодменюЗаполненияТЧ(/*ПодменюЗаполнить, Действие*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ОбработатьНажатиеНаКнопкуЗаполнения(/*Кнопка, Объект*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public object ПолучитьИмяДокументаДополнительно(/*Основание*/)
		{
			return null;
		}
	}
}

