using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class ѕроцедурыќбмена”“”ѕѕ
	{

		public object ѕолучитьћассив¬сех”злов(/**/)
		{
			/*«апрос = Ќовый «апрос;*/
			/*«апрос.“екст = "¬џЅ–ј“№ различные
	               |	ќбмен”правлениеѕредпри€тием”правление“орговлей.—сылка  ј  —сылка
	               |»«
	               |	ѕланќбмена.ќбмен”правлениеѕредпри€тием”правление“орговлей  ј  ќбмен”правлениеѕредпри€тием”правление“орговлей
				   |
				   |√ƒ≈
				   |
				   |	ќбмен”правлениеѕредпри€тием”правление“орговлей.—сылка <> &Ётот”зел";*/
			/*«апрос.”становитьѕараметр("Ётот”зел", ѕланыќбмена.ќбмен”правлениеѕредпри€тием”правление“орговлей.Ётот”зел());*/
			/*ћассив—сылок = «апрос.¬ыполнить().¬ыгрузить().¬ыгрузить олонку("—сылка");*/
			return null;
		}

		public object ¬ернутьћассив¬сех”злов»зѕараметров—еанса(/**/)
		{
			return null;
		}

		public object ѕолучить—оответствие”злов»ќрганизаций(/**/)
		{
			/*’ранилище = ѕараметры—еанса.—оответствиеќрганизаций»”зловќбмена”“”ѕѕ;*/
			/*—оответствие”злов»ќрганизаций = ’ранилище.ѕолучить();*/
			return null;
		}

		public object ¬ернутьћассив”зловѕоќднойќрганизации(/*ќрганизаци€, —оответствие”злов»ќрганизаций = Ќеопределено*/)
		{
			if(true/*—оответствие”злов»ќрганизаций = Ќеопределено*/)
			{
				/*—оответствие”злов»ќрганизаций = ѕолучить—оответствие”злов»ќрганизаций();*/
			}
			return null;
		}

		public object ѕолучить«апросомћассив”зловѕоќрганизации(/*ќрганизаци€*/)
		{
			/*«апрос = Ќовый «апрос;*/
			/*«апрос.“екст = "¬џЅ–ј“№ –азличные
	               |	ќбмен”правлениеѕредпри€тием”правление“орговлей.—сылка  ј  —сылка
	               |»«
	               |	ѕланќбмена.ќбмен”правлениеѕредпри€тием”правление“орговлей  ј  ќбмен”правлениеѕредпри€тием”правление“орговлей
				   |		Ћевое соединение ѕланќбмена.ќбмен”правлениеѕредпри€тием”правление“орговлей.ќрганизации  ј  —писокќрганизаций
				   |			ѕќ (ќбмен”правлениеѕредпри€тием”правление“орговлей.—сылка = —писокќрганизаций.—сылка)
				   |
	               |√ƒ≈
	               |	(—писокќрганизаций.ќрганизаци€ ¬ (&—сылкаЌаќрганизацию)
				   |		»Ћ» —писокќрганизаций.ќрганизаци€ ≈сть NULL)
				   |	» ќбмен”правлениеѕредпри€тием”правление“орговлей.—сылка <> &Ётот”зел";*/
			/*«апрос.”становитьѕараметр("—сылкаЌаќрганизацию", ќрганизаци€);*/
			/*«апрос.”становитьѕараметр("Ётот”зел", ѕланыќбмена.ќбмен”правлениеѕредпри€тием”правление“орговлей.Ётот”зел());*/
			/*ћассив—сылок = «апрос.¬ыполнить().¬ыгрузить().¬ыгрузить олонку("—сылка");*/
			return null;
		}

		public object ѕолучить“аблицу”злов»ƒат(/**/)
		{
			/*’ранилище = ѕараметры—еанса.—оответствие”злов»ƒатƒл€ќбмена”“”ѕѕ;*/
			/*“аблица”злов»ƒат = ’ранилище.ѕолучить();*/
			return null;
		}

		public object ѕолучитьћассив”зловѕоќрганизации(/*ќрганизаци€, —оответствие”злов»ќрганизаций = Ќеопределено*/)
		{
			if(true/*“ип«нч(ќрганизаци€) = “ип("ћассив")*/)
			{
				/* оличествоЁлементов¬ћассиве = ќрганизаци€. оличество();*/
				if(true/* оличествоЁлементов¬ћассиве = 0*/)
				{
					/*ќрганизаци€ƒл€ѕоиска = —правочники.ќрганизации.ѕуста€—сылка();*/
				}
			}
			if(true/*ќрганизаци€ƒл€ѕоиска <> Ќеопределено*/)
			{
				/*ћассив”злов = ¬ернутьћассив”зловѕоќднойќрганизации(ќрганизаци€ƒл€ѕоиска, —оответствие”злов»ќрганизаций);*/
			}
			return null;
		}

		public void «аполнить—труктуруѕараметровѕоЁлементу(/*Ёлемент, »м€Ѕазового“ипа, “ипЁлемента, —труктураѕараметров, 
	—труктураѕолучени€ оличества = Ќеопределено*/)
		{
			/*»м€ƒл€«апроса = "";*/
			/*Ёто—сылка = ќпределитьѕоЁлементуЁто—сылка(Ёлемент, »м€Ѕазового“ипа, “ипЁлемента, »м€ƒл€«апроса);*/
			if(true/*Ќ≈ Ёто—сылка*/)
			{
				if(true/*—труктураѕолучени€ оличества <> Ќеопределено*/)
				{
				}
			}
			/*// надо все единым запросом получить
*/
			/*//нужно построить запрос и вернуть параметр по ссылке
*/
			/*—трока»менѕараметров = "";*/
			if(true/*—труктураѕолучени€ оличества <> Ќеопределено*/)
			{
			}
			/*—трока»менѕараметров = —ред(—трока»менѕараметров, 2);*/
			/*«апрос = Ќовый «апрос();*/
			/*«апрос.“екст = "¬џЅ–ј“№
	               |	" + —трока»менѕараметров + "
	               |»«
	               |	" + »м€ƒл€«апроса + "  ј  ќбъектƒанных
	               |√ƒ≈
	               |	ќбъектƒанных.—сылка = &—сылка";*/
			/*«апрос.”становитьѕараметр("—сылка", Ёлемент);*/
			/*–езультат«апроса = «апрос.¬ыполнить();*/
			if(true/*Ќ≈ –езультат«апроса.ѕустой()*/)
			{
				/*¬ыборка = –езультат«апроса.¬ыбрать();*/
				/*¬ыборка.—ледующий();*/
				/*«аполнить«начени€—войств(—труктураѕараметров, ¬ыборка);*/
				if(true/*—труктураѕолучени€ оличества <> Ќеопределено*/)
				{
				}
			}
		}
		// функци€ по элементу определ€ет это группа и возвращает ссылку на него

		public object ќпределитьѕоЁлементуЁто√руппа»—сылку(/*Ёлемент, »м€Ѕазового“ипа, “ипЁлемента, Ќужноќпредел€тьЁто√руппа = Ћожь, Ёто√руппа = Ћожь*/)
		{
			/*»м€ƒл€«апроса = "";*/
			/*Ёто—сылка = ќпределитьѕоЁлементуЁто—сылка(Ёлемент, »м€Ѕазового“ипа, “ипЁлемента, »м€ƒл€«апроса);*/
			if(true/*Ќ≈ Ёто—сылка*/)
			{
				if(true/*Ќужноќпредел€тьЁто√руппа*/)
				{
					/*Ёто√руппа = Ёлемент.Ёто√руппа;*/
					if(true/*Ёто√руппа = Ќеопределено*/)
					{
						/*Ёто√руппа = Ћожь;*/
					}
				}
			}
			if(true/*Ќужноќпредел€тьЁто√руппа*/)
			{
				/*Ёто√руппа = ѕолучить«начениеѕараметраќбъекта»ли—сылки(Ёлемент, »м€Ѕазового“ипа, “ипЁлемента, "Ёто√руппа");*/
				if(true/*Ёто√руппа = Ќеопределено*/)
				{
					/*Ёто√руппа = Ћожь;*/
				}
			}
			return null;
		}

		public object ќпределитьѕоЁлементуЁто—сылка(/*Ёлемент, »м€Ѕазового“ипа, “ипЁлемента, »м€ƒл€«апроса*/)
		{
			/*ћетаданныеЁлемента = Ёлемент.ћетаданные();*/
			if(true/*»м€Ѕазового“ипа = "—правочники"*/)
			{
				/*“ип—сылки = “ип("—правочник—сылка." + ћетаданныеЁлемента.»м€);*/
				/*»м€ƒл€«апроса = "—правочник." + ћетаданныеЁлемента.»м€;*/
			}
			return null;
		}
		// функци€ анализирует Ёлемент это объект или нет
		// если объект возвращает его реквизит, иначе
		// строит по ссылке запрос и возвращает значение этого реквизита из запроса

		public object ѕолучить«начениеѕараметраќбъекта»ли—сылки(/*Ёлемент, »м€Ѕазового“ипа, “ипЁлемента, »м€ѕараметра*/)
		{
			/*»м€ƒл€«апроса = "";*/
			/*Ёто—сылка = ќпределитьѕоЁлементуЁто—сылка(Ёлемент, »м€Ѕазового“ипа, “ипЁлемента, »м€ƒл€«апроса);*/
			if(true/*Ќ≈ Ёто—сылка*/)
			{
			}
			/*«апрос = Ќовый «апрос();*/
			/*«апрос.“екст = "¬џЅ–ј“№
	               |	ќбъектƒанных." + »м€ѕараметра + "
				   |
	               |»«
	               |	" + »м€ƒл€«апроса + "  ј  ќбъектƒанных
	               |√ƒ≈
	               |	ќбъектƒанных.—сылка = &—сылка";*/
			/*«апрос.”становитьѕараметр("—сылка", Ёлемент);*/
			/*–езультат«апроса = «апрос.¬ыполнить();*/
			if(true/*–езультат«апроса.ѕустой()*/)
			{
			}
			/*¬ыборка = –езультат«апроса.¬ыбрать();*/
			/*¬ыборка.—ледующий();*/
			return null;
		}

		public void ƒополнитьћассив”зловƒл€¬ыгрузкиƒокумента(/*Ёлемент, ћассив”зловƒл€ѕередачи, 
	“ипЁлемента = Ќеопределено, ¬ыгружатьƒл€¬сех”злов = Ћожь, ¬озвращатьћассив¬сех”злов = »стина,
	—оответствие”злов»ќрганизаций = Ќеопределено, Ќужнојнализироватьќграничени€ѕоƒатам = Ћожь*/)
		{
			if(true/*“ипЁлемента = Ќеопределено*/)
			{
				/*“ипЁлемента = “ип«нч(Ёлемент);*/
			}
			/*—труктураѕараметров = Ќовый —труктура("ƒата");*/
			/*—труктураƒопѕараметров = Ќовый —труктура();*/
			/*// если нужно делаем органичени€ дл€ выгрузки дл€ организации
*/
			/*// не дл€ всех документов нужно такое органичение
*/
			/*// дл€ некотороыех документов если в шапке пуста€ организаци€ - значит документ едет везде
*/
			if(true/*“ипЁлемента = “ип("ƒокументќбъект.¬нутреннееѕеремещениеЌаличныхƒенежных—редств") 
		»Ћ» “ипЁлемента = “ип("ƒокумент—сылка.¬нутреннееѕеремещениеЌаличныхƒенежных—редств")*/)
			{
				/*—труктураѕараметров.¬ставить("ќрганизаци€ѕолучатель");*/
				/*«аполнить—труктуруѕараметровѕоЁлементу(Ёлемент, "ƒокументы", “ипЁлемента, —труктураѕараметров);*/
				/*ƒополнитьћассив”зламиѕоќрганизации(ћассив”зловƒл€ѕередачи, —труктураѕараметров.ќрганизаци€ѕолучатель, —оответствие”злов»ќрганизаций);*/
			}
			if(true/*Ќужнојнализироватьќграничени€ѕоƒатам*/)
			{
				/*// ограничение по датам смотрим
*/
				/*“аблицаƒат»”злов = ѕолучить“аблицу”злов»ƒат();*/
				/*Ќомер = 0;*/
				while(true/*Ќомер <= ћассив”зловƒл€ѕередачи. оличество() - 1*/)
				{
					/*—трока“аблицы = “аблицаƒат»”злов.Ќайти(ћассив”зловƒл€ѕередачи[Ќомер], "ссылка");*/
					if(true/*—трока“аблицы <> Ќеопределено
				» «начение«аполнено(—труктураѕараметров.ƒата)
				» —труктураѕараметров.ƒата < —трока“аблицы.ƒатаЌачала¬ыгрузкиƒокументов*/)
					{
						/*ћассив”зловƒл€ѕередачи.”далить(Ќомер);*/
					}
				}
				/*;;*/
			}
		}

		public void ƒополнитьћассив—сылками(/*“екущийћассив, ћассивƒл€ƒобавлени€*/)
		{
			if(true/*ћассивƒл€ƒобавлени€ = Ќеопределено*/)
			{
			}
		}

		public void ƒополнитьћассив”зламиѕо—правочнику»ѕараметру(/*»м€—правочника, »м€–еквизита, 
	—сылкаЌа—правочник, ћассив”зловƒл€ѕередачи, »м€–еквизитаќрганизации = "ќрганизаци€", —оответствие”злов»ќрганизаций = Ќеопределено*/)
		{
			if(true/*—сылкаЌа—правочник.ѕуста€()*/)
			{
			}
			/*–езультат«апроса = ѕолныеѕрава.ѕолучить–езультат«апросаѕо¬ыборкеќрганизаций(»м€—правочника, »м€–еквизита, »м€–еквизитаќрганизации, —сылкаЌа—правочник);*/
			if(true/*–езультат«апроса.ѕустой()*/)
			{
				/*ƒополнитьћассив”зламиѕоќрганизации(ћассив”зловƒл€ѕередачи, —правочники.ќрганизации.ѕуста€—сылка(), —оответствие”злов»ќрганизаций);*/
			}
		}

		public object ѕолучитьѕоЌабору«аписей–азличные«начени€–еквизита(/*Ќабор«аписей, »м€–еквизита*/)
		{
			if(true/*Ќабор«аписей. оличество() = 0*/)
			{
			}
			/*“аблицаƒанных = Ќабор«аписей.¬ыгрузить(, »м€–еквизита);*/
			/*“аблицаƒанных.—вернуть(»м€–еквизита);*/
			/*ћассивќрганизаций = “аблицаƒанных.¬ыгрузить олонку(»м€–еквизита);*/
			return null;
		}

		public void ƒополнитьћассив¬семи”злами(/*ћассив”зловƒл€ѕередачи*/)
		{
			/*ћассив”злов = ¬ернутьћассив¬сех”злов»зѕараметров—еанса();*/
			/*ƒополнитьћассив—сылками(ћассив”зловƒл€ѕередачи, ћассив”злов);*/
		}

		public void ƒополнитьћассив”зламиѕоќрганизации(/*ћассив”зловƒл€ѕередачи, ќрганизаци€, —оответствие”злов»ќрганизаций = Ќеопределено*/)
		{
			/*ћассив”злов = ѕолучитьћассив”зловѕоќрганизации(ќрганизаци€, —оответствие”злов»ќрганизаций);*/
			/*ƒополнитьћассив—сылками(ћассив”зловƒл€ѕередачи, ћассив”злов);*/
		}

		public void ƒополнитьћассив”зловƒл€¬ыгрузки—правочника(/*Ёлемент, ћассив”зловƒл€ѕередачи, 
	“ипЁлемента = Ќеопределено, ¬ыгружатьƒл€¬сех”злов = Ћожь, ¬озвращатьћассив¬сех”злов = »стина,
	—оответствие”злов»ќрганизаций = Ќеопределено*/)
		{
			/*// пердопределенные элементы выгружаем и загружаем послностью
*/
			if(true/*Ёлемент.ѕредопределенный*/)
			{
				/*ќбеспечить¬ыгрузкуќбъектаƒл€¬сех”злов(¬ыгружатьƒл€¬сех”злов, ¬озвращатьћассив¬сех”злов, ћассив”зловƒл€ѕередачи);*/
			}
			/*¬ыгружатьƒл€¬сех”злов = Ћожь;*/
			if(true/*“ипЁлемента = Ќеопределено*/)
			{
				/*“ипЁлемента = “ип«нч(Ёлемент);*/
			}
			if(true/*“ипЁлемента = “ип("—правочникќбъект.Ѕанковские—чета")
		»Ћ» “ипЁлемента = “ип("—правочник—сылка.Ѕанковские—чета")*/)
			{
				/*// нужно определить владельца
*/
				/*// если владелец не организаци€, тогда регистрируем изменени€ дл€ всех узлов, 
*/
				/*// если организаци€, то только дл€ тех узлов куда организаци€ передаетс€
*/
				/*¬ладелец = ѕолучить«начениеѕараметраќбъекта»ли—сылки(Ёлемент, "—правочники", “ипЁлемента, "¬ладелец");*/
				if(true/*“ип«нч(¬ладелец) = “ип("—правочник—сылка.ќрганизации")*/)
				{
					/*// только узлы с указанной организацией
*/
					/*ƒополнитьћассив”зламиѕоќрганизации(ћассив”зловƒл€ѕередачи, ¬ладелец, —оответствие”злов»ќрганизаций);*/
				}
			}
		}

		public void ќбеспечить¬ыгрузкуќбъектаƒл€¬сех”злов(/*¬ыгружатьƒл€¬сех”злов, ¬озвращатьћассив¬сех”злов, ћассив”зловƒл€ѕередачи*/)
		{
			/*¬ыгружатьƒл€¬сех”злов = »стина;*/
			if(true/*¬озвращатьћассив¬сех”злов*/)
			{
				/*ƒополнитьћассив¬семи”злами(ћассив”зловƒл€ѕередачи);*/
			}
		}

		public object ќпределение”зловƒл€¬ыгрузки—правочника(/*Ёлемент, “ипЁлемента = Ќеопределено, 
	¬ыгружатьƒл€¬сех”злов = Ћожь, ¬озвращатьћассив¬сех”злов = »стина, 
	—оответствие”злов»ќрганизаций = Ќеопределено*/)
		{
			/*ћассив”зловƒл€ѕередачи = Ќовый ћассив;*/
			/*ƒополнитьћассив”зловƒл€¬ыгрузки—правочника(Ёлемент, ћассив”зловƒл€ѕередачи, 
		“ипЁлемента, ¬ыгружатьƒл€¬сех”злов, ¬озвращатьћассив¬сех”злов, —оответствие”злов»ќрганизаций);*/
			return null;
		}

		public object ќпределение”зловƒл€¬ыгрузкиƒокумента(/*Ёлемент, “ип–еквизита = Ќеопределено, ¬ыгружатьƒл€¬сех”злов = Ћожь, 
	¬озвращатьћассив¬сех”злов = »стина, 
	—оответствие”злов»ќрганизаций = Ќеопределено, Ќужнојнализироватьќграничени€ѕоƒатам = Ћожь*/)
		{
			/*ћассив”зловƒл€ѕередачи = Ќовый ћассив;*/
			/*ƒополнитьћассив”зловƒл€¬ыгрузкиƒокумента(Ёлемент, ћассив”зловƒл€ѕередачи, 
		“ип–еквизита, ¬ыгружатьƒл€¬сех”злов, ¬озвращатьћассив¬сех”злов, —оответствие”злов»ќрганизаций, Ќужнојнализироватьќграничени€ѕоƒатам);*/
			return null;
		}

		public void ƒополнитьћассив”зловƒл€¬ыгрузки—сылочного“ипа(/*»м€Ѕазового“ипа, Ёлемент, ћассив”зловƒл€ѕередачи, 
	“ипЁлемента = Ќеопределено, ¬ыгружатьƒл€¬сех”злов = Ћожь, ¬озвращатьћассив¬сех”злов = »стина,
	—оответствие”злов»ќрганизаций = Ќеопределено*/)
		{
			if(true/*»м€Ѕазового“ипа = "—правочники"*/)
			{
				/*ƒополнитьћассив”зловƒл€¬ыгрузки—правочника(Ёлемент, ћассив”зловƒл€ѕередачи, 
			“ипЁлемента, ¬ыгружатьƒл€¬сех”злов, ¬озвращатьћассив¬сех”злов,
			—оответствие”злов»ќрганизаций);*/
			}
		}

		public object ќпределитьћассив”зловƒл€–егистрацииѕроизвольного“ипа(/*ƒанные, »м€Ѕазового“ипа, “ипЁлемента = Ќеопределено, ћетаданныеќбъекта = Ќеопределено,
	¬ыгружатьƒл€¬сех”злов = Ћожь, ¬озвращатьћассив¬сех”злов = »стина,
	—оответствие”злов»ќрганизаций = Ќеопределено, Ќужнојнализироватьќграничени€ѕоƒатам = »стина*/)
		{
			if(true/*»м€Ѕазового“ипа = "—правочники"*/)
			{
				/*ћассив”зловƒл€–егистрации—сылки = ќпределение”зловƒл€¬ыгрузки—правочника(ƒанные, “ипЁлемента, ¬ыгружатьƒл€¬сех”злов, 
			¬озвращатьћассив¬сех”злов, —оответствие”злов»ќрганизаций);*/
			}
			return null;
		}

		public void ќпределитьѕоЌаборуи–еквизитућассив”зловƒл€ѕередачи(/*Ќабор«аписей, ћассив”зловƒл€ѕередачи, 
	»м€–еквизита, “ипЁлемента = Ќеопределено, —оответствие”злов»ќрганизаций = Ќеопределено, »м€Ѕазового“ипа = "—правочники"*/)
		{
			/*ћассив–азличных«начений–еквизита = ѕолучитьѕоЌабору«аписей–азличные«начени€–еквизита(Ќабор«аписей, »м€–еквизита);*/
			/*ћассив”зловƒл€ѕередачи = Ќовый ћассив();*/
		}

		public object ќпределение”зловƒл€¬ыгрузкиЌабора«аписей–егистра—ведений(/*Ёлемент, ћетаданные–егистра, 
	¬ыгружатьƒл€¬сех”злов = Ћожь, ¬озвращатьћассив¬сех”злов = »стина, —оответствие”злов»ќрганизаций = Ќеопределено*/)
		{
			/*¬ыгружатьƒл€¬сех”злов = Ћожь;*/
			/*ћассив”зловƒл€ѕередачи = Ќовый ћассив;*/
			/*“ипЁлемента = “ип«нч(Ёлемент);*/
			/*ћетаданныеќбъекта = ћетаданные.Ќайтиѕо“ипу(“ипЁлемента);*/
			/*Ќаличиеќрганизации = (ћетаданныеќбъекта.»змерени€.Ќайти("ќрганизаци€") <> Ќеопределено);*/
			if(true/*Ќаличиеќрганизации*/)
			{
				/*ќпределитьѕоЌаборуи–еквизитућассив”зловƒл€ѕередачи(Ёлемент, ћассив”зловƒл€ѕередачи, "ќрганизаци€", 
			“ип("—правочник—сылка.ќрганизации"), —оответствие”злов»ќрганизаций);*/
			}
			return null;
		}

		public void «аполнитьѕолучателейƒл€ќбмена(/*»сточник, ћассив”зловƒл€–егистрацииѕеред«аписью, ћассив”зловƒл€–егистрацииѕри«аписи = Ќеопределено*/)
		{
			/*ѕроцедурыќбменаƒанными.ƒополнитьћассивѕолучателей”зламијвторегистрации(»сточник);*/
			/*// дл€ регистрации ссылки
*/
			if(true/*ћассив”зловƒл€–егистрацииѕри«аписи <> Ќеопределено*/)
			{
				/*// дл€ регистрации объекта
*/
			}
		}

		public void ѕеред«аписью—сылочного“ипаƒл€ќбменаѕоќрганизации(/*»сточник, ќтказ, »м€Ѕазового“ипа, 
	ћассив”зловƒл€–егистрации—сылки = Ќеопределено, ћассив”зловƒл€–егистрацииќбъекта = Ќеопределено*/)
		{
			if(true/*ќтказ
		»Ћ» Ќ≈ ѕараметры—еанса.Ќаличиеќбмена”“”ѕѕ*/)
			{
			}
			if(true/*»сточник.ЁтоЌовый()*/)
			{
				/*// элемент еще никуда не передавалс€
*/
				/*ћассив”зловƒл€–егистрации—сылки = Ќовый ћассив;*/
			}
			/*ћассив”зловƒл€–егистрацииќбъекта = ќпределитьћассив”зловƒл€–егистрацииѕроизвольного“ипа(»сточник, »м€Ѕазового“ипа);*/
			/*«аполнитьѕолучателейƒл€ќбмена(»сточник, ћассив”зловƒл€–егистрации—сылки, ћассив”зловƒл€–егистрацииќбъекта);*/
		}

		public void ѕеред«аписьюЌабора«аписейƒл€ќбменаѕоќрганизации(/*»сточник, ќтказ, «амещение, »м€Ѕазового“ипа, “ип«начени€»сточника = Ќеопределено*/)
		{
			if(true/*ќтказ
		»Ћ» Ќ≈ ѕараметры—еанса.Ќаличиеќбмена”“”ѕѕ*/)
			{
			}
			if(true/*“ип«начени€»сточника = Ќеопределено*/)
			{
				/*“ип«начени€»сточника = “ип«нч(»сточник);*/
			}
			/*ћетаданные–егистра = ћетаданные.Ќайтиѕо“ипу(“ип«начени€»сточника);*/
			if(true/*«амещение*/)
			{
				if(true/*»м€Ѕазового“ипа = "–егистры—ведений"*/)
				{
					/*—тарыйЌабор«аписей = –егистры—ведений[ћетаданные–егистра.»м€].—оздатьЌабор«аписей();*/
				}
				/*—тарыйЌабор«аписей.ѕрочитать();*/
				/*ћассив”зловƒл€–егистрации—сылки = ќпределитьћассив”зловƒл€–егистрацииѕроизвольного“ипа(—тарыйЌабор«аписей, »м€Ѕазового“ипа,  , ћетаданные–егистра);*/
			}
			/*ћассив”зловƒл€–егистрацииќбъекта = ќпределитьћассив”зловƒл€–егистрацииѕроизвольного“ипа(»сточник, »м€Ѕазового“ипа,  , ћетаданные–егистра);*/
			/*«аполнитьѕолучателейƒл€ќбмена(»сточник, ћассив”зловƒл€–егистрации—сылки, ћассив”зловƒл€–егистрацииќбъекта);*/
		}

		public void ѕеред«апись—правочникаƒл€ќбмена”“”ѕѕ(/*»сточник, ќтказ*/)
		{
			if(true/*ќтказ
		»Ћ» Ќ≈ ѕараметры—еанса.Ќаличиеќбмена”“”ѕѕ*/)
			{
			}
			/*ѕеред«аписью—сылочного“ипаƒл€ќбменаѕоќрганизации(»сточник, ќтказ, "—правочники");*/
		}

		public void ѕеред«аписьюƒокументаƒл€ќбмена”“”ѕѕ(/*»сточник, ќтказ, –ежим«аписи, –ежимѕроведени€*/)
		{
			if(true/*ќтказ
		»Ћ» Ќ≈ ѕараметры—еанса.Ќаличиеќбмена”“”ѕѕ*/)
			{
			}
			/*ѕеред«аписью—сылочного“ипаƒл€ќбменаѕоќрганизации(»сточник, ќтказ, "ƒокументы");*/
		}

		public void ѕеред«аписью–егистра—веденийќбмен”ѕѕ(/*»сточник, ќтказ, «амещение*/)
		{
			if(true/*ќтказ
		»Ћ» Ќ≈ ѕараметры—еанса.Ќаличиеќбмена”“”ѕѕ*/)
			{
			}
			/*“ип»сточника = “ип«нч(»сточник);*/
			if(true/*“ип»сточника = “ип("–егистр—веденийЌабор«аписей.ќбъектыƒоступаƒокументов")*/)
			{
				/*ƒокумент—сылка = »сточник.ќтбор.ƒокумент—сылка.«начение;*/
				if(true/*«начение«аполнено(ƒокумент—сылка)*/)
				{
					/*ћассив”зловƒл€–егистрации—сылки = ќпределитьћассив”зловƒл€–егистрацииѕроизвольного“ипа(ƒокумент—сылка, "ƒокументы");*/
					/*«аполнитьѕолучателейƒл€ќбмена(»сточник, ћассив”зловƒл€–егистрации—сылки);*/
				}
			}
		}

		public void ѕеред”далением—правочникаƒл€ќбмена”“”ѕѕ(/*»сточник, ќтказ*/)
		{
			if(true/*ќтказ
		»Ћ» Ќ≈ ѕараметры—еанса.Ќаличиеќбмена”“”ѕѕ*/)
			{
			}
			/*ѕеред«аписью—сылочного“ипаƒл€ќбменаѕоќрганизации(»сточник, ќтказ, "—правочники");*/
		}

		public void ѕеред”далениемƒокументаƒл€ќбмена”“”ѕѕ(/*»сточник, ќтказ*/)
		{
			if(true/*ќтказ
		»Ћ» Ќ≈ ѕараметры—еанса.Ќаличиеќбмена”“”ѕѕ*/)
			{
			}
			/*ѕеред«аписью—сылочного“ипаƒл€ќбменаѕоќрганизации(»сточник, ќтказ, "ƒокументы");*/
		}
	}
}

