using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class ПроверкаРазницыВремени
	{
		// Определяет текущую (системную) дату на компьютере сервера 1С:Предприятия.
		//
		// Возвращаемое значение:
		//   Дата   - текущая (системная) дата
		//

		public object ТекущаяДатаСервера(/**/)
		{
			return null;
		}
		// Установить начальное значение константы при обновлении версии ИБ.
		//

		public void ИнициализироватьПроверкуРазницыВремениССервером(/**/)
		{
			/*Константы.ПроверятьРазницуВоВремениССервером.Установить(Ложь);*/
		}
	}
}

