using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class РасчетОплатыНеявокПереопределяемый
	{
		// Возвращает список видов документов для этого журнала в виде списка значений
		//

		public object ПолучитьСписокВидовДокументов(/*мСписокВидовДокументов*/)
		{
			if(true/*мСписокВидовДокументов <> НеОпределено*/)
			{
			}
			//мСписокВидовДокументов = Новый СписокЗначений;
			//мСписокВидовДокументов.Добавить("НачислениеПоБольничномуЛисту");
			//мСписокВидовДокументов.Добавить("НачислениеОтпускаРаботникамОрганизаций");
			//мСписокВидовДокументов.Добавить("ОплатаПоСреднемуЗаработку");
			//мСписокВидовДокументов.Добавить("НевыходыВОрганизациях");
			//РаботаСДиалогамиЗК.ДополнитьСписокВидовДокументов(Метаданные.ЖурналыДокументов.РасчетОплатыНеявок, мСписокВидовДокументов);
			return null;
		}
	}
}
