using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class –асчетќплатыЌе€вокѕереопредел€емый
	{
		// ¬озвращает список видов документов дл€ этого журнала в виде списка значений
		//

		public object ѕолучить—писок¬идовƒокументов(/*м—писок¬идовƒокументов*/)
		{
			if(true/*м—писок¬идовƒокументов <> Ќеќпределено*/)
			{
			}
			/*м—писок¬идовƒокументов = Ќовый —писок«начений;*/
			/*м—писок¬идовƒокументов.ƒобавить("ЌачислениеѕоЅольничномуЋисту");*/
			/*м—писок¬идовƒокументов.ƒобавить("Ќачислениеќтпуска–аботникамќрганизаций");*/
			/*м—писок¬идовƒокументов.ƒобавить("ќплатаѕо—реднему«аработку");*/
			/*м—писок¬идовƒокументов.ƒобавить("Ќевыходы¬ќрганизаци€х");*/
			/*–абота—ƒиалогами« .ƒополнить—писок¬идовƒокументов(ћетаданные.∆урналыƒокументов.–асчетќплатыЌе€вок, м—писок¬идовƒокументов);*/
			return null;
		}
	}
}

