using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class РаботаСФайламиВызовСервера
	{
		// Сортирует массив структур по полю Дата - на сервере, т.к. на тонком клиенте нет ТаблицаЗначений

		public void СортироватьМассивСтруктур(/*МассивСтруктур*/)
		{
			//ТаблицаФайлов = Новый ТаблицаЗначений;
			//ТаблицаФайлов.Колонки.Добавить("Путь");
			//ТаблицаФайлов.Колонки.Добавить("Версия");
			//ТаблицаФайлов.Колонки.Добавить("Размер");
			//ТаблицаФайлов.Колонки.Добавить("ДатаПомещенияВРабочийКаталог", Новый ОписаниеТипов("Дата"));
			/*// Сортировка по дате - в начале будут самые давно помещенные в рабочий каталог
*/
			//ТаблицаФайлов.Сортировать("ДатаПомещенияВРабочийКаталог Возр");
			//МассивСтруктурВозврат = Новый Массив;
			//МассивСтруктур = МассивСтруктурВозврат;
		}
	}
}
