using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class РезультатИспытательногоСрокаДополнительный
	{
		////////////////////////////////////////////////////////////////////////////////
		// Вспомогательные процедуры, функции
		////////////////////////////////////////////////////////////////////////////////
		// Процедуры, функции объекта

		public void ПроверитьЗаполнениеШапкиДополнительно(/*ВыборкаПоШапкеДокумента, Отказ, Заголовок*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ДополнитьДвижениеСостоянияРаботникаНаИспытательномСроке(/*Движение, ВыборкаПоШапкеДокумента*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ДобавитьСтрокуВДвиженияПоРегистрамСведенийПродленДополнительно(/*Движения, ВыборкаПоШапкеДокумента*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public object ДополнитьЗапросПоШапке(/**/)
		{
			return null;
		}
		////////////////////////////////////////////////////////////////////////////////
		// Процедуры, функции для работы формы документа

		public void ПриИзмененииРешенияДополнительно(/*ЭтаФорма, ЭлементыФормы, Результат*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ПередОткрытиемДополнительно(/*ЭтаФорма, ЭлементыФормы*/)
		{
			/*// В этой конфигурации дополнительных действий не предусмотрено
*/
		}
	}
}
