using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class СторнированиеКлиент
	{
		////////////////////////////////////////////////////////////////////////////////
		// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ ФОРМЫ ЭЛЕМЕНТА
		// Процедура устанавливает режим работы набора записей

		public void НастроитьСвойстваДвижения(/*Документ, ИмяДвижений*/)
		{
			if(true/*ИмяДвижений = "ОсновныеНачисленияРаботниковОрганизаций"*/)
			{
				/*Документ.Движения[ИмяДвижений].мВыполнятьВспомогательныеРасчеты = Истина;*/
			}
			/*СторнированиеПереопределяемый.НастроитьСвойстваДвижения(Документ, ИмяДвижений);*/
		}
	}
}

