using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class ”вольнение»зќрганизацийѕереопредел€емый
	{
		////////////////////////////////////////////////////////////////////////////////
		// ¬спомогательные процедуры, функции
		////////////////////////////////////////////////////////////////////////////////
		// ѕроцедуры, функции объекта

		public void ƒополнить—труктуруѕечатных‘орм(/*—труктураѕечатных‘орм, ƒокументќбъект*/)
		{
			/*”вольнение»зќрганизацийƒополнительный.ƒополнить—труктуруѕечатных‘орм(—труктураѕечатных‘орм, ƒокументќбъект);*/
		}

		public object ѕечатьƒополнительных‘орм(/*»м€ћакета, ќбъект*/)
		{
			return null;
		}

		public void ќбработка«аполнени€ƒополнительно(/*“ипќсновани€, Ётотќбъект, ќснование*/)
		{
			if(true/*“ипќсновани€ = “ип("ƒокумент—сылка.”вольнение")*/)
			{
				/*// «аполним реквизиты из стандартного набора.
*/
				/*«аполнениеƒокументов.«аполнитьЎапкуƒокументаѕоќснованию(Ётотќбъект, ќснование);*/
				if(true/*ќснование.ѕроведен*/)
				{
					/*“екущийѕользователь = гл«начениеѕеременной("гл“екущийѕользователь");*/
					/*Ётотќбъект.–аботникиќрганизации.«агрузить(”вольнение»зќрганизацийƒополнительный.—формировать«апросќбработка«аполнени€ѕоƒокументам”вольнение(Ётотќбъект, ќснование).¬ыгрузить());*/
				}
			}
		}

		public void ѕроверить«аполнение—троки–аботникаќрганизацииƒополнительно(/*¬ыборкаѕо—трокамƒокумента, —трокаЌачала—ообщени€ќбќшибке, ќтказ, «аголовок*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ¬озвращает текст пол€ запроса
		//
		// ѕараметры
		//  нет
		//
		// ¬озвращаемое значение:
		//   строка
		//

		public object ƒополнительноеѕолеќписани€—отрудника(/**/)
		{
			return null;
		}
		// ѕолучитьѕоле()

		public void ƒобавитьƒополнительныеƒвижени€(/*ƒокументќбъект, ќтказ, «аголовок*/)
		{
			/*”вольнение»зќрганизацийƒополнительный.ƒобавитьƒополнительныеƒвижени€(ƒокументќбъект, ќтказ, «аголовок);*/
		}
		////////////////////////////////////////////////////////////////////////////////
		// ѕроцедуры, функции дл€ работы формы документа

		public void ƒополнительно”точнитьƒни омпенсации(/*—трокаƒанных, —ведени€ќ—отруднике*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ƒополнить нопки оманднойѕанели(/* омандна€ѕанель, ƒействие*/)
		{
			/*»спользовать”правленческий”чет«арплаты = гл«начениеѕеременной("гл»спользовать”правленческий”чет«арплаты");*/
			if(true/*»спользовать”правленческий”чет«арплаты*/)
			{
				/* нопка«аполнить”воленными =  омандна€ѕанель. нопки.ƒобавить("«аполнить”воленными", “ип нопки оманднойѕанели.ƒействие, "”воленными по предпри€тию", ƒействие);*/
				/* нопка«аполнить”воленными.ѕодсказка = "«аполнить уволенными";*/
			}
		}

		public void ¬ыполнитьƒополнительныеƒействи€(/*ƒокументќбъект, ‘ормаƒокумента*/)
		{
			/*”вольнение»зќрганизацийƒополнительный.«аполнить“абличную„асть–аботникиќрганизации”воленные(ƒокументќбъект, ‘ормаƒокумента);*/
		}

		public void ”точнитьќформление—троки—отрудника(/*ќформление—троки, —ведени€ќ—отруднике*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ‘ормаƒокументаѕередќткрытиемƒополнительно(/*‘орма*/)
		{
			/*”вольнение»зќрганизацийƒополнительный.‘ормаƒокументаѕередќткрытиемƒополнительно(‘орма);*/
		}
	}
}

