using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class ”правлениеѕечатьюѕереопредел€емый
	{
		// ‘ункци€ формировани€ печатной формы по внешнему источнику.
		// »сточникƒанных - ѕроизвольный - источник данных
		// ѕараметры»сточника - ѕроизвольный - параметры источника печати
		//
		// параметры, заполн€емые в функции:
		//  оллекци€ѕечатных‘орм - “аблица«начений - таблица печатных форм,
		//					структура совпадает с той, что формируетс€ при печати
		///					обычным способом
		// ќбъектыѕечати - —писок«начений - список объектов дл€ печати
		// ѕараметры¬ывода - —труктура - ключи и значени€ совпадает с теми,
		//					то формируетс€ при печати обычным способом
		//

		public object ѕечатьѕо¬нешнему»сточнику(/*»сточникƒанных,
								ѕараметры»сточника,
								 оллекци€ѕечатных‘орм,
								ќбъектыѕечати,
								ѕараметры¬ывода*/)
		{
			return null;
		}
	}
}

