using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ОбщиеМодули
{
	public partial class УправлениеПечатьюПереопределяемый
	{
		// Функция формирования печатной формы по внешнему источнику.
		// ИсточникДанных - Произвольный - источник данных
		// ПараметрыИсточника - Произвольный - параметры источника печати
		//
		// параметры, заполняемые в функции:
		// КоллекцияПечатныхФорм - ТаблицаЗначений - таблица печатных форм,
		//					структура совпадает с той, что формируется при печати
		///					обычным способом
		// ОбъектыПечати - СписокЗначений - список объектов для печати
		// ПараметрыВывода - Структура - ключи и значения совпадает с теми,
		//					то формируется при печати обычным способом
		//

		public object ПечатьПоВнешнемуИсточнику(/*ИсточникДанных,
								ПараметрыИсточника,
								КоллекцияПечатныхФорм,
								ОбъектыПечати,
								ПараметрыВывода*/)
		{
			return null;
		}
	}
}

