using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class ‘изическиеЋицаƒополнительный
	{

		public void ‘орма‘изическогоЋицаѕередќткрытием(/*‘орма, ƒополнительныеƒействи€*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ‘орма‘изическогоЋицаѕередќткрытием

		public void ‘орма‘изическогоЋицаѕриќткрытии(/*‘орма*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ‘орма‘изическогоЋицаѕриќткрытии

		public void ‘орма‘изическогоЋицаƒополнительныеƒействи€(/*Ёлемент, ‘орма*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ¬ыполнитьƒополнительныеƒействи€

		public void ‘орма‘изическогоЋицаќбработкаќповещени€(/*»м€—обыти€, ѕараметр, »сточник, Ёта‘орма, ƒополнительныеƒействи€*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		// ‘орма‘изическогоЋицаќбработкаќповещени€

		public void ѕри опировании(/*Ётотќбъект, ќбъект опировани€*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}

		public void ѕеред«аписью(/*Ётотќбъект, ќтказ*/)
		{
			/*// ¬ этой конфигурации дополнительных действий не предусмотрено
*/
		}
		////////////////////////////////////////////////////////////////////////////////
		// ѕроцедуры печати

		public void ѕечать(/*ћассивќбъектов, ѕараметрыѕечати,  оллекци€ѕечатных‘орм, ќбъектыѕечати, ѕараметры¬ывода*/)
		{
			/*// ¬ этой конфигурации печать не предусмотрена
*/
		}

		public object ѕечать—веденийќ‘излице(/*—сылка, ќбъектыѕечати = Ќеопределено, Ќазваниеќтчета = Ќеопределено, –езультат = Ќеопределено*/)
		{
			/*// ¬ этой конфигурации печать не предусмотрена
*/
			return null;
		}
	}
}

