using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace V82.ќбщиећодули
{
	public partial class ‘ормированиеѕечатных‘ормѕереопредел€емый
	{

		public void ”становитьѕараметры«апроса—реднего«аработка(/*«апрос, —пособ–асчета, —писок—оставл€ющих—реднего«аработка*/)
		{
			if(true/*—писок—оставл€ющих—реднего«аработка = Ќеопределено*/)
			{
				/*—писок—оставл€ющих—реднего«аработка = Ќовый ћассив(5);*/
				if(true/*—пособ–асчета = ѕеречислени€.—пособы–асчетаќплаты“руда.ѕо—реднему«аработкуƒл€ќтпускаѕо алендарнымƒн€м 
			»ли —пособ–асчета = ѕеречислени€.—пособы–асчетаќплаты“руда.ѕо—реднему«аработкуƒл€ќтпускаѕоЎестидневке 
			»ли —пособ–асчета = ѕеречислени€.—пособы–асчетаќплаты“руда.ѕо—реднему«аработку
			»ли —пособ–асчета = ѕеречислени€.—пособы–асчетаќплаты“руда.ƒоплатаƒо—реднего«аработка*/)
				{
					/*—писок—оставл€ющих—реднего«аработка = Ќовый ћассив(13);*/
					/*—писок—оставл€ющих—реднего«аработка[0] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработку;*/
					/*—писок—оставл€ющих—реднего«аработка[1] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€м;*/
					/*—писок—оставл€ющих—реднего«аработка[2] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘икс√одовойѕремии;*/
					/*—писок—оставл€ющих—реднего«аработка[3] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€м;*/
					/*—писок—оставл€ющих—реднего«аработка[4] = ѕланы¬идов–асчета.—редний«аработок.ѕо√одовойѕремии;*/
					/*—писок—оставл€ющих—реднего«аработка[5] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработку»ндексируемые;*/
					/*—писок—оставл€ющих—реднего«аработка[6] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработкуЌе»ндексируемые;*/
					/*—писок—оставл€ющих—реднего«аработка[7] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€м»ндексируемые;*/
					/*—писок—оставл€ющих—реднего«аработка[8] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€мЌе»ндексируемые;*/
					/*—писок—оставл€ющих—реднего«аработка[9] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€мЌе»ндексируемые;*/
					/*—писок—оставл€ющих—реднего«аработка[10] = ѕланы¬идов–асчета.—редний«аработок.ѕо√одовойѕремииЌе»ндексируемые;*/
					/*—писок—оставл€ющих—реднего«аработка[11] = ѕланы¬идов–асчета.—редний«аработок.ѕо√одовойѕремии»ндексируемые;*/
					/*—писок—оставл€ющих—реднего«аработка[12] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘икс√одовойѕремииЌе»ндексируемые;*/
				}
			}
			/*ќсновной«аработок = Ќовый ћассив(5);*/
			/*ќсновной«аработок[0] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработку;*/
			/*ќсновной«аработок[1] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработкуЅЋ;*/
			/*ќсновной«аработок[2] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработкуѕособий;*/
			/*ќсновной«аработок[3] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработку»ндексируемые;*/
			/*ќсновной«аработок[4] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработкуѕособий—2010;*/
			/*‘иксированныеѕремии = Ќовый ћассив(6);*/
			/*‘иксированныеѕремии[0] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€м;*/
			/*‘иксированныеѕремии[1] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€мЅЋ;*/
			/*‘иксированныеѕремии[2] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘икс√одовойѕремии;*/
			/*‘иксированныеѕремии[3] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘икс√одовойѕремииЅЋ;*/
			/*‘иксированныеѕремии[4] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€мЌе»ндексируемые;*/
			/*‘иксированныеѕремии[5] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘икс√одовойѕремииЌе»ндексируемые;*/
			/*ѕо‘иксѕреми€м = Ќовый ћассив(3);*/
			/*ѕо‘иксѕреми€м[0] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€м;*/
			/*ѕо‘иксѕреми€м[1] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€мЅЋ;*/
			/*ѕоѕреми€м = Ќовый ћассив(9);*/
			/*ѕоѕреми€м[0] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€м;*/
			/*ѕоѕреми€м[1] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€мЅЋ;*/
			/*ѕоѕреми€м[2] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€мѕособий;*/
			/*ѕоѕреми€м[3] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€мѕособий;*/
			/*ѕоѕреми€м[4] = ѕланы¬идов–асчета.—редний«аработок.ѕо√одовойѕремииѕособий;*/
			/*ѕоѕреми€м[5] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘икс√одовойѕремииѕособий;*/
			/*ѕоѕреми€м[6] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€м»ндексируемые;*/
			/*ѕоѕреми€м[7] = ѕланы¬идов–асчета.—редний«аработок.ѕо√одовойѕремии»ндексируемые;*/
			/*ѕоѕреми€м[8] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€мѕособий—2010;*/
			/*ѕо‘иксѕреми€мЌе»ндексируемые = Ќовый ћассив(4);*/
			/*ѕо‘иксѕреми€мЌе»ндексируемые[0] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘икс√одовойѕремии;*/
			/*ѕо‘иксѕреми€мЌе»ндексируемые[1] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘икс√одовойѕремииЅЋ;*/
			/*ѕо‘иксѕреми€мЌе»ндексируемые[2] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘икс√одовойѕремииЌе»ндексируемые;*/
			/*ѕо‘иксѕреми€мЌе»ндексируемые[3] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€мЌе»ндексируемые;*/
			/*»ндексируемые = Ќовый ћассив(7);*/
			/*»ндексируемые[0] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработку»ндексируемые;*/
			/*»ндексируемые[1] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€м»ндексируемые;*/
			/*»ндексируемые[2] = ѕланы¬идов–асчета.—редний«аработок.ѕо√одовойѕремии»ндексируемые;*/
			/*»ндексируемые[3] = ѕланы¬идов–асчета.—редний«аработок.ѕо‘иксѕреми€м;*/
			/*»ндексируемые[4] = ѕланы¬идов–асчета.—редний«аработок.ѕоѕреми€м;*/
			/*»ндексируемые[5] = ѕланы¬идов–асчета.—редний«аработок.ѕо«аработку;*/
			/*»ндексируемые[6] = ѕланы¬идов–асчета.—редний«аработок.ѕо√одовойѕремии;*/
			/*«апрос.”становитьѕараметр("»ндексируемые",						»ндексируемые);*/
			/*«апрос.”становитьѕараметр("ќсновной«аработок",					ќсновной«аработок);*/
			/*«апрос.”становитьѕараметр("ѕо‘иксѕреми€м",						ѕо‘иксѕреми€м);*/
			/*«апрос.”становитьѕараметр("ѕоѕреми€м",							ѕоѕреми€м);*/
			/*«апрос.”становитьѕараметр("¬се‘иксированныеѕремии",				‘иксированныеѕремии);*/
			/*«апрос.”становитьѕараметр("ѕо‘иксѕреми€мЌе»ндексируемые",		ѕо‘иксѕреми€мЌе»ндексируемые);*/
			/*«апрос.”становитьѕараметр("—писок—оставл€ющих—реднего«аработка", —писок—оставл€ющих—реднего«аработка);*/
		}
	}
}

