Ext.define('Документы.ИнвентаризацияРасчетовСконтрагентами.ФормаСписка',
	{
	extend: 'Ext.window.Window',
	style: 'position:absolute;width:630px;height:300px;',
	iconCls: 'bogus',
	minimizable: true,
	maximizable: true,
	title: 'Инвентаризация расчетов с контрагентами',
	
	items:
	[
		{
			xtype: 'grid',
			style: 'position:absolute;left:8px;top:33px;width:614px;height:259px;',
			height: 259,width: 614,
			columns:
			[
				{
					text:'',
					width:'20',
				},
				{
					text:'Дата',
					width:'118',
				},
				{
					text:'Номер',
					width:'80',
				},
				{
					text:'Организация',
					width:'146',
				},
				{
					text:'Комментарий',
					width:'191',
				},
			]
		},
		{
			xtype: 'toolbar',
			style: 'position:absolute;left:0px;top:0px;width:630px;height:25px;',
			items:
			[
				{
					text:'Поиск по номеру...',
				},
				{
					text:'Вывести список...',
				},
				{
					text:'Отбор по значению в текущей колонке',
				},
				{
					text:'&Скопировать',
				},
				{
					text:'Установить пометку удаления',
				},
				{
					text:'',
				},
				'-',
				{
					text:'Отключить отбор',
				},
				{
					text:'&Удалить',
				},
				'-',
				{
					text:'Отключить отбор',
				},
				{
					text:'&Изменить',
				},
				{
					text:'Поиск по номеру...',
				},
				{
					text:'Установить интервал дат...',
				},
				'-',
				{
					text:'&Скопировать',
				},
				{
					text:'Установить отбор и сортировку списка...',
				},
				'-',
				'-',
				'-',
				{
					text:'Отбор по значению в текущей колонке',
				},
				{
					text:'Обновить',
				},
				{
					text:'Установить пометку удаления',
				},
				{
					text:'&Изменить',
				},
				'-',
				{
					text:'',
				},
				'-',
				{
					text:'Справка',
				},
				{
					text:'&Добавить',
				},
				'-',
				{
					text:'Установить отбор и сортировку списка...',
				},
				{
					text:'Настройка списка...',
				},
				'-',
				{
					text:'&Добавить',
				},
				{
					text:'',
				},
				{
					text:'Обновить',
				},
				{
					text:'Установить интервал дат...',
				},
				'-',
			]
		},
	]
});