
using System;
using V82;
using V82.—правочники—сылка;
using V82.ƒокументы—сылка;
using V82.ƒокументыќбъект;
using V82.ѕеречислени€;//—сылка;
namespace V82.ƒокументыќбъект
{
	///<summary>
	///(–егл)
	///</summary>
	public partial class јнкета«астрахованногоЋица:ƒокументќбъект
	{
		public V82.—правочники—сылка.ќрганизации ќрганизаци€;
		public V82.—правочники—сылка.ѕользователи ќтветственный;
		///<summary>
		///Ћюба€ дополнительна€ информаци€
		///</summary>
		public string/*(0)*/  омментарий;
		public V82.—правочники—сылка.‘изическиеЋица »сполнитель;
		public string/*(100)*/  раткий—оставƒокумента;// раткий состав документа
		public V82.ѕеречислени€/*—сылка*/.‘ормат‘айлаѕ‘– ‘ормат‘айла;//‘ормат файла
		public string/*(5)*/ Ќомерѕачки;//Ќомер пачки
		public bool «амен€тьЅукву≈;//«амен€ть букву "Є"
	}
}
