
using System;
using V82;
using V82.—правочники—сылка;
using V82.ƒокументы—сылка;
using V82.ƒокументыќбъект;
using V82.ѕеречислени€;//—сылка;
namespace V82.ƒокументыќбъект
{
	///<summary>
	///(”пр)
	///</summary>
	public partial class јттестаци€–аботника:ƒокументќбъект
	{
		public V82.—правочники—сылка.‘изическиеЋица ‘излицо;
		public V82.—правочники—сылка.ѕользователи ќтветственный;
		///<summary>
		///(ќбщ) Ћюба€ дополнительна€ информаци€
		///</summary>
		public string/*(0)*/  омментарий;
		public V82.—правочники—сылка.—отрудникиќрганизаций —отрудник;
	}
}
