
using System;
using V82;
using V82.—правочники—сылка;
using V82.ƒокументы—сылка;
using V82.ƒокументыќбъект;
using V82.ѕеречислени€;//—сылка;
namespace V82.ƒокументыќбъект
{
	///<summary>
	///(ќбщ)
	///</summary>
	public partial class ѕереоценка“оваровѕрин€тыхЌа омиссию:ƒокументќбъект
	{
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬”правленческом”чете;//ќтражать в управленческом учете
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ѕухгалтерском”чете;//ќтражать в бухгалтерском учете
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ќрганизации ќрганизаци€;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.—клады —клад;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.“ипы÷енЌоменклатуры онтрагентов “ип÷ен;//“ип цен
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.¬алюты ¬алютаƒокумента;//¬алюта документа
		///<summary>
		///(ќбщ)
		///</summary>
		public decimal/*(10.4)*/  урс¬заиморасчетов;// урс взаиморасчетов
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка. онтрагенты  онтрагент;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ƒоговоры онтрагентов ƒоговор онтрагента;//ƒоговор контрагента
		///<summary>
		///(”пр)
		///</summary>
		public V82.—правочники—сылка.ѕодразделени€ ѕодразделение;
		///<summary>
		///(ќбщ) Ћюба€ дополнительна€ информаци€
		///</summary>
		public string/*(0)*/  омментарий;
		///<summary>
		///(ќбщ)
		///</summary>
		public decimal/*(10)*/  ратность¬заиморасчетов;// ратность взаиморасчетов
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ѕользователи ќтветственный;
		///<summary>
		///(ќбщ)
		///</summary>
		public object —делка;
		public string/*(20)*/ Ќомер¬ход€щегоƒокументаЁлектронногоќбмена;//Ќомер вход€щего документа электронного обмена
		public DateTime ƒата¬ход€щегоƒокументаЁлектронногоќбмена;//ƒата вход€щего документа электронного обмена
	}
}
