
using System;
using V82;
using V82.—правочники—сылка;
using V82.ƒокументы—сылка;
using V82.ƒокументыќбъект;
using V82.ѕеречислени€;//—сылка;
namespace V82.ƒокументыќбъект
{
	///<summary>
	///(ќбщ)
	///</summary>
	public partial class ѕеремещение“оваров:ƒокументќбъект
	{
		public V82.ѕеречислени€/*—сылка*/.¬идыќперацийѕеремещение“оваров ¬идќперации;//¬ид операции
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ќрганизации ќрганизаци€;
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬”правленческом”чете;//ќтражать в управленческом учете
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ѕухгалтерском”чете;//ќтражать в бухгалтерском учете
		///<summary>
		///(ќбщ)
		///</summary>
		public bool ќтражать¬Ќалоговом”чете;//ќтражать в налоговом учете
		///<summary>
		///(”пр)
		///</summary>
		public V82.—правочники—сылка.ѕодразделени€ ѕодразделение;
		///<summary>
		///(ќбщ) Ћюба€ дополнительна€ информаци€
		///</summary>
		public string/*(0)*/  омментарий;
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.—клады —кладќтправитель;//—клад отправитель
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.—клады —кладѕолучатель;//—клад получатель
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.ѕользователи ќтветственный;
		public V82.ƒокументы—сылка.¬нутренний«аказ ¬нутренний«аказ;//¬нутренний заказ
		///<summary>
		///Ќеобходимые действи€ по включению или исключению Ќƒ— в стоимости товаров при перемещении
		///</summary>
		public V82.ѕеречислени€/*—сылка*/.ƒействиеЌƒ—¬—тоимости“оваров Ќƒ—в—тоимости“оваров;//Ќƒ— в стоимости товаров
		///<summary>
		///(–егл)
		///</summary>
		public object —чет—писани€Ќƒ—;//—чет списани€ Ќƒ—
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто—писани€Ќƒ—1;//—убконто 1
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто—писани€Ќƒ—2;//—убконто 2
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто—писани€Ќƒ—3;//—убконто 3
		///<summary>
		///(–егл)
		///</summary>
		public object —чет—писани€Ќƒ—Ќ”;//—чет списани€ Ќƒ— (Ќ”)
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто—писани€Ќƒ—Ќ”1;//—убконто 1 (налоговый учет)
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто—писани€Ќƒ—Ќ”2;//—убконто 2 (налоговый учет)
		///<summary>
		///(–егл)
		///</summary>
		public object —убконто—писани€Ќƒ—Ќ”3;//—убконто 3 (налоговый учет)
		///<summary>
		///ƒл€ Ќƒ—
		///</summary>
		public V82.—правочники—сылка.Ќоменклатурные√руппы Ќоменклатурна€√руппа;//Ќоменклатурна€ группа
		///<summary>
		///(ќбщ)
		///</summary>
		public V82.—правочники—сылка.—татьи«атрат —тать€«атрат—писани€Ќƒ—;//—тать€ затрат списани€ Ќƒ—
		///<summary>
		///(–егл)
		///</summary>
		public V82.—правочники—сылка.ѕодразделени€ќрганизаций ѕодразделениеќрганизации;//ѕодразделение организации
		///<summary>
		///(ќбщ) —умма в розничных ценах
		///</summary>
		public decimal/*(15.2)*/ —уммаƒокумента–ознична€;//–ознична€ сумма документа
		public bool –аспределениеќстатков“оваровќрганизацийѕо—кладам;//–аспределение остатков товаров организаций по складам
	}
}
