
using System;
using V82;
using V82.—правочники—сылка;
using V82.ƒокументы—сылка;
using V82.ƒокументыќбъект;
using V82.ѕеречислени€;//—сылка;
namespace V82.ƒокументыќбъект
{
	///<summary>
	///(–егл)
	///</summary>
	public partial class ”вольнение»зќрганизаций:ƒокументќбъект
	{
		public V82.—правочники—сылка.ќрганизации ќрганизаци€;
		///<summary>
		///Ћюба€ дополнительна€ информаци€
		///</summary>
		public string/*(0)*/  омментарий;
		public V82.—правочники—сылка.ѕользователи ќтветственный;
		public string/*(100)*/  раткий—оставƒокумента;// раткий состав документа
		public bool ƒанныеѕрошлой¬ерсии;//ѕеренесен из 7.7
		public V82.ƒокументы—сылка.”вольнение»зќрганизаций »справл€емыйƒокумент;//»справл€емый документ
		public ’ранилище«начени€ ƒвижени€»справл€емогоƒокумента;//ƒвижени€ исправл€емого документа
	}
}
