Ext.require(['Данные.Обработки.РабочийСтол'], function () 
{
	Ext.define('Обработки.РабочийСтол.Форма',
	{
	extend: 'Ext.window.Window',
	id: 'Форма',
	style: 'position:absolute;width:918px;height:573px;',
	iconCls: 'bogus',
	minimizable: true,
	maximizable: true,
	resizable: false,
	title: 'Рабочий стол',
	
	layout: {type: "fit",align: "stretch"},
	items:
	[{
		xtype: 'form',
		ПервоеОткрытие: true,
		items:
		[
		{
			xtype: 'panel',
			id: ОсновнаяПанель,
			style: 'position:absolute;left:0px;top:38px;width:700px;height:535px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Левая', Номер: 2112, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Форма', Граница: 'Нижняя', Номер: 0, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:535,
			Ширина:700,
			Верх:38,
			Лево:0,
			height: 535,width: 700,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Главная,
					items:
					[
		{
			xtype: 'label',
			id: 'НастройкаПараметровУчета1',
			text: 'Параметры учета',
			style: 'position:absolute;left:218px;top:48px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НастройкаПараметровУчета1', Граница: 'Левая', Номер: 57, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НастройкаПараметровУчета1', Граница: 'Верхняя', Номер: 57, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:48,
			Лево:218,
		},
		{
			xtype: 'label',
			id: 'ОбновлениеКонфигурации1',
			text: 'Обновление конфигурации',
			style: 'position:absolute;left:577px;top:269px;width:115px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОбновлениеКонфигурации1', Граница: 'Левая', Номер: 63, Координата: 0},
					Левая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 536, Координата: 0},
					Нижняя: { Элемент: 'ОбновлениеКонфигурации1', Граница: 'Верхняя', Номер: 63, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:115,
			Верх:269,
			Лево:577,
		},
		{
			xtype: 'label',
			id: 'ФизическиеЛица1',
			text: 'Физические лица',
			style: 'position:absolute;left:39px;top:474px;width:148px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ФизическиеЛица1', Граница: 'Левая', Номер: 69, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'ФизическиеЛица1', Граница: 'Верхняя', Номер: 69, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:148,
			Верх:474,
			Лево:39,
		},
		{
			xtype: 'label',
			id: 'Обозреватель1',
			text: 'Web-страница конфигурации',
			style: 'position:absolute;left:218px;top:474px;width:182px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Обозреватель1', Граница: 'Левая', Номер: 75, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'Обозреватель1', Граница: 'Верхняя', Номер: 75, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:182,
			Верх:474,
			Лево:218,
		},
		{
			xtype: 'label',
			id: 'Письмо1',
			text: 'Написать письмо в техподдержку',
			style: 'position:absolute;left:218px;top:491px;width:182px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Письмо1', Граница: 'Левая', Номер: 76, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'Письмо1', Граница: 'Верхняя', Номер: 76, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:182,
			Верх:491,
			Лево:218,
		},
		{
			xtype: 'label',
			id: 'ОтзывОПрограмме1',
			text: 'Написать отзыв о программе',
			style: 'position:absolute;left:218px;top:508px;width:182px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОтзывОПрограмме1', Граница: 'Левая', Номер: 77, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'ОтзывОПрограмме1', Граница: 'Верхняя', Номер: 77, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:182,
			Верх:508,
			Лево:218,
		},
		{
			xtype: 'label',
			id: 'Сайт1С',
			text: 'Сайт фирмы 1С',
			style: 'position:absolute;left:201px;top:457px;width:199px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Сайт1С', Граница: 'Левая', Номер: 78, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'Сайт1С', Граница: 'Верхняя', Номер: 78, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:199,
			Верх:457,
			Лево:201,
		},
		{
			xtype: 'label',
			id: 'НадписьГлавная',
			text: 'Предприятие',
			style: 'position:absolute;left:56px;top:0px;width:162px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьГлавная', Граница: 'Левая', Номер: 79, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьГлавная', Граница: 'Верхняя', Номер: 79, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:162,
			Верх:0,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'НадписьОтчеты4',
			text: 'Отчеты',
			style: 'position:absolute;left:56px;top:298px;width:243px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьОтчеты4', Граница: 'Левая', Номер: 279, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьОтчеты4', Граница: 'Верхняя', Номер: 279, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:243,
			Верх:298,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'НадписьОтчеты8',
			text: 'Отчеты',
			style: 'position:absolute;left:56px;top:298px;width:311px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьОтчеты8', Граница: 'Левая', Номер: 384, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: 'Форма', Граница: 'Центр', Номер: 0, Координата: 0},
					Нижняя: { Элемент: 'Форма', Граница: 'Центр', Номер: 0, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:311,
			Верх:298,
			Лево:56,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы1',
			title: '',
			style: 'position:absolute;left:8px;top:317px;width:684px;height:6px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 2079, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы1', Граница: 'Верхняя', Номер: 420, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:6,
			Ширина:684,
			Верх:317,
			Лево:8,
		},
		{
			xtype: 'panel',
			id: Панель1,
			style: 'position:absolute;left:516px;top:42px;width:163px;height:102px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:102,
			Ширина:163,
			Верх:42,
			Лево:516,
			height: 102,width: 163,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Страница1,
					items:
					[
		{
			xtype: 'label',
			id: 'ЗадачаИсполнителя1',
			text: 'Мои задачи',
			style: 'position:absolute;left:40px;top:50px;width:101px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗадачаИсполнителя1', Граница: 'Левая', Номер: 533, Координата: 0},
					Левая: { Элемент: '', Граница: 'Левая', Номер: 541, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Верхняя', Номер: 541, Координата: 0},
					Нижняя: { Элемент: 'ЗадачаИсполнителя1', Граница: 'Верхняя', Номер: 533, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:101,
			Верх:50,
			Лево:40,
		},
		{
			xtype: 'label',
			id: 'МоиНастройки',
			text: 'Мои настройки...',
			style: 'position:absolute;left:40px;top:69px;width:101px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'МоиНастройки', Граница: 'Левая', Номер: 534, Координата: 0},
					Левая: { Элемент: '', Граница: 'Левая', Номер: 541, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Верхняя', Номер: 541, Координата: 0},
					Нижняя: { Элемент: 'МоиНастройки', Граница: 'Верхняя', Номер: 534, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:101,
			Верх:69,
			Лево:40,
		},
		{
			xtype: 'label',
			id: 'ИмяПользователя',
			text: 'Пользователь\r\n(имя не задано)',
			style: 'position:absolute;left:40px;top:8px;width:115px;height:42px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ИмяПользователя', Граница: 'Левая', Номер: 535, Координата: 0},
					Левая: { Элемент: '', Граница: 'Левая', Номер: 541, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Верхняя', Номер: 541, Координата: 0},
					Нижняя: { Элемент: 'ИмяПользователя', Граница: 'Верхняя', Номер: 535, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:115,
			Верх:8,
			Лево:40,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы11',
			title: '',
			style: 'position:absolute;left:0px;top:0px;width:163px;height:101px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РамкаГруппы11', Граница: 'Левая', Номер: 541, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы11', Граница: 'Верхняя', Номер: 541, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:101,
			Ширина:163,
			Верх:0,
			Лево:0,
		},
					]
				},
			]
		},
		{
			xtype: 'label',
			id: 'НастройкиПрограммы',
			text: 'Настройка программы',
			style: 'position:absolute;left:379px;top:48px;width:128px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НастройкиПрограммы', Граница: 'Левая', Номер: 542, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НастройкиПрограммы', Граница: 'Верхняя', Номер: 542, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:128,
			Верх:48,
			Лево:379,
		},
		{
			xtype: 'label',
			id: 'МониторЗаконодательства',
			text: 'Монитор законодательства',
			style: 'position:absolute;left:413px;top:457px;width:182px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'МониторЗаконодательства', Граница: 'Левая', Номер: 578, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'МониторЗаконодательства', Граница: 'Верхняя', Номер: 578, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:182,
			Верх:457,
			Лево:413,
		},
		{
			xtype: 'label',
			id: 'СайтБУХру',
			text: 'Интернет-ресурс\r\nБУХ.1С',
			style: 'position:absolute;left:413px;top:474px;width:182px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СайтБУХру', Граница: 'Левая', Номер: 579, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'СайтБУХру', Граница: 'Верхняя', Номер: 579, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:182,
			Верх:474,
			Лево:413,
		},
		{
			xtype: 'label',
			id: 'НовоеПисьмо',
			text: 'Написать письмо',
			style: 'position:absolute;left:577px;top:174px;width:115px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НовоеПисьмо', Граница: 'Левая', Номер: 598, Координата: 0},
					Левая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 536, Координата: 0},
					Нижняя: { Элемент: 'НовоеПисьмо', Граница: 'Верхняя', Номер: 598, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:115,
			Верх:174,
			Лево:577,
		},
		{
			xtype: 'label',
			id: 'ДолжностиОрганизаций1',
			text: 'Должности',
			style: 'position:absolute;left:56px;top:132px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДолжностиОрганизаций1', Граница: 'Левая', Номер: 610, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 2052, Координата: 0},
					Нижняя: { Элемент: 'ДолжностиОрганизаций1', Граница: 'Верхняя', Номер: 610, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:132,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ШтатноеРасписаниеОрганизаций1',
			text: 'Штатное расписание',
			style: 'position:absolute;left:56px;top:174px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ШтатноеРасписаниеОрганизаций1', Граница: 'Левая', Номер: 611, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 2052, Координата: 0},
					Нижняя: { Элемент: 'ШтатноеРасписаниеОрганизаций1', Граница: 'Верхняя', Номер: 611, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:174,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'СотрудникиОрганизаций1',
			text: 'Сотрудники',
			style: 'position:absolute;left:56px;top:48px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СотрудникиОрганизаций1', Граница: 'Левая', Номер: 612, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СотрудникиОрганизаций1', Граница: 'Верхняя', Номер: 612, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:48,
			Лево:56,
		},
		{
			xtype: 'panel',
			id: ГлавнаяОтчеты,
			style: 'position:absolute;left:56px;top:369px;width:373px;height:46px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:46,
			Ширина:373,
			Верх:369,
			Лево:56,
			height: 46,width: 373,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'СпискиРаботниковОрганизаций1',
			text: 'Списки сотрудников организаций',
			style: 'position:absolute;left:0px;top:23px;width:179px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпискиРаботниковОрганизаций1', Граница: 'Левая', Номер: 70, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпискиРаботниковОрганизаций1', Граница: 'Верхняя', Номер: 70, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:179,
			Верх:23,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ33',
			text: 'Унифицированная форма Т-3',
			style: 'position:absolute;left:194px;top:6px;width:168px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ33', Граница: 'Левая', Номер: 555, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ33', Граница: 'Верхняя', Номер: 555, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:168,
			Верх:6,
			Лево:194,
		},
		{
			xtype: 'label',
			id: 'ОрганизационнаяСтруктура1',
			text: 'Организационная структура',
			style: 'position:absolute;left:194px;top:23px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОрганизационнаяСтруктура1', Граница: 'Левая', Номер: 613, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОрганизационнаяСтруктура1', Граница: 'Верхняя', Номер: 613, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:23,
			Лево:194,
		},
		{
			xtype: 'label',
			id: 'СпискиРаботников4',
			text: 'Списки сотрудников компании',
			style: 'position:absolute;left:0px;top:6px;width:162px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпискиРаботников4', Граница: 'Левая', Номер: 1980, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпискиРаботников4', Граница: 'Верхняя', Номер: 1980, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:162,
			Верх:6,
			Лево:0,
		},
					]
				},
				{
					id: Регл,
					items:
					[
		{
			xtype: 'label',
			id: 'СпискиРаботниковОрганизаций4',
			text: 'Списки сотрудников организаций',
			style: 'position:absolute;left:0px;top:6px;width:179px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпискиРаботниковОрганизаций4', Граница: 'Левая', Номер: 1983, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпискиРаботниковОрганизаций4', Граница: 'Верхняя', Номер: 1983, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:179,
			Верх:6,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ35',
			text: 'Унифицированная форма Т-3',
			style: 'position:absolute;left:0px;top:23px;width:168px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ35', Граница: 'Левая', Номер: 1984, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ35', Граница: 'Верхняя', Номер: 1984, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:168,
			Верх:23,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ОрганизационнаяСтруктура2',
			text: 'Организационная структура',
			style: 'position:absolute;left:207px;top:6px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОрганизационнаяСтруктура2', Граница: 'Левая', Номер: 2065, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОрганизационнаяСтруктура2', Граница: 'Верхняя', Номер: 2065, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:6,
			Лево:207,
		},
					]
				},
			]
		},
		{
			xtype: 'panel',
			id: ПанельПодразделенияГлавная,
			style: 'position:absolute;left:56px;top:90px;width:138px;height:42px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:138,
			Верх:90,
			Лево:56,
			height: 42,width: 138,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'Подразделения6',
			text: 'Подразделения',
			style: 'position:absolute;left:0px;top:0px;width:138px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Подразделения6', Граница: 'Левая', Номер: 2054, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Подразделения6', Граница: 'Верхняя', Номер: 2054, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:138,
			Верх:0,
			Лево:0,
		},
					]
				},
				{
					id: Регл,
					items:
					[
		{
			xtype: 'label',
			id: 'ПодразделенияОрганизаций',
			text: 'Подразделения',
			style: 'position:absolute;left:0px;top:0px;width:137px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПодразделенияОрганизаций', Граница: 'Левая', Номер: 2055, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПодразделенияОрганизаций', Граница: 'Верхняя', Номер: 2055, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:137,
			Верх:0,
			Лево:0,
		},
					]
				},
			]
		},
		{
			xtype: 'label',
			id: 'Территории',
			text: 'Территории',
			style: 'position:absolute;left:56px;top:491px;width:131px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Территории', Граница: 'Левая', Номер: 2074, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'Территории', Граница: 'Верхняя', Номер: 2074, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:131,
			Верх:491,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'Помещения',
			text: 'Помещения',
			style: 'position:absolute;left:56px;top:508px;width:131px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Помещения', Граница: 'Левая', Номер: 2075, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'Помещения', Граница: 'Верхняя', Номер: 2075, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:131,
			Верх:508,
			Лево:56,
		},
		{
			xtype: 'panel',
			id: ПанельНашиОрганизации,
			style: 'position:absolute;left:218px;top:242px;width:323px;height:58px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:58,
			Ширина:323,
			Верх:242,
			Лево:218,
			height: 58,width: 323,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Страница1,
					items:
					[
		{
			xtype: 'label',
			id: 'Организации1',
			text: 'Наши организации',
			style: 'position:absolute;left:32px;top:39px;width:150px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Организации1', Граница: 'Левая', Номер: 56, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Организации1', Граница: 'Верхняя', Номер: 56, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:150,
			Верх:39,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'Надпись1',
			text: 'Если в программе ведется учет сразу по нескольким организациям, то для редактирования их списка используйте команду "Наши организации"',
			style: 'position:absolute;left:32px;top:0px;width:291px;height:39px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Надпись1', Граница: 'Левая', Номер: 538, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Надпись1', Граница: 'Верхняя', Номер: 538, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:39,
			Ширина:291,
			Верх:0,
			Лево:32,
		},
					]
				},
			]
		},
		{
			xtype: 'label',
			id: 'ИнтернетИТС',
			text: 'Интернет-ИТС',
			style: 'position:absolute;left:413px;top:491px;width:182px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ИнтернетИТС', Граница: 'Левая', Номер: 2108, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1982, Координата: 0},
					Нижняя: { Элемент: 'ИнтернетИТС', Граница: 'Верхняя', Номер: 2108, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:182,
			Верх:491,
			Лево:413,
		},
		{
			xtype: 'label',
			id: 'УправлениеПерсональнымиДанными',
			text: 'Управление персональными данными (152-ФЗ)',
			style: 'position:absolute;left:379px;top:132px;width:137px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УправлениеПерсональнымиДанными', Граница: 'Левая', Номер: 2110, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УправлениеПерсональнымиДанными', Граница: 'Верхняя', Номер: 2110, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:137,
			Верх:132,
			Лево:379,
		},
					]
				},
				{
					id: КадровыйУчет,
					items:
					[
		{
			xtype: 'label',
			id: 'ШтатноеРасписаниеОрганизаций3',
			text: 'Штатное расписание',
			style: 'position:absolute;left:306px;top:48px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ШтатноеРасписаниеОрганизаций3', Граница: 'Левая', Номер: 119, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ШтатноеРасписаниеОрганизаций3', Граница: 'Верхняя', Номер: 119, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:48,
			Лево:306,
		},
		{
			xtype: 'label',
			id: 'СотрудникиОрганизаций2',
			text: 'Сотрудники',
			style: 'position:absolute;left:56px;top:48px;width:102px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СотрудникиОрганизаций2', Граница: 'Левая', Номер: 120, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СотрудникиОрганизаций2', Граница: 'Верхняя', Номер: 120, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:102,
			Верх:48,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ВоинскийУчет2',
			text: 'Записи воинского учета',
			style: 'position:absolute;left:451px;top:282px;width:220px;height:18px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВоинскийУчет2', Граница: 'Левая', Номер: 123, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1817, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1972, Координата: 0},
					Нижняя: { Элемент: 'ВоинскийУчет2', Граница: 'Верхняя', Номер: 123, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:18,
			Ширина:220,
			Верх:282,
			Лево:451,
		},
		{
			xtype: 'label',
			id: 'ИзвещенияВВоенкоматы2',
			text: 'Извещения в военкоматы',
			style: 'position:absolute;left:467px;top:307px;width:223px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ИзвещенияВВоенкоматы2', Граница: 'Левая', Номер: 124, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1817, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1972, Координата: 0},
					Нижняя: { Элемент: 'ИзвещенияВВоенкоматы2', Граница: 'Верхняя', Номер: 124, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:223,
			Верх:307,
			Лево:467,
		},
		{
			xtype: 'label',
			id: 'ДонесениеОКоличествеГражданПребывающихВЗапасе2',
			text: 'Донесение о количестве граждан запаса (форма №11/МУ)',
			style: 'position:absolute;left:467px;top:325px;width:223px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДонесениеОКоличествеГражданПребывающихВЗапасе2', Граница: 'Левая', Номер: 125, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1817, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1972, Координата: 0},
					Нижняя: { Элемент: 'ДонесениеОКоличествеГражданПребывающихВЗапасе2', Граница: 'Верхняя', Номер: 125, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:223,
			Верх:325,
			Лево:467,
		},
		{
			xtype: 'label',
			id: 'ПринятыеИУволенныеРаботникиПодлежащиеПризыву2',
			text: 'Сотрудники, подлежащие призыву (приемы и увольнения)',
			style: 'position:absolute;left:467px;top:357px;width:223px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПринятыеИУволенныеРаботникиПодлежащиеПризыву2', Граница: 'Левая', Номер: 126, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1817, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1972, Координата: 0},
					Нижняя: { Элемент: 'ПринятыеИУволенныеРаботникиПодлежащиеПризыву2', Граница: 'Верхняя', Номер: 126, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:223,
			Верх:357,
			Лево:467,
		},
		{
			xtype: 'label',
			id: 'ПринятыеИУволенныеВоеннообязанные',
			text: 'Военнообязанные (приемы и увольнения)',
			style: 'position:absolute;left:467px;top:389px;width:223px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПринятыеИУволенныеВоеннообязанные', Граница: 'Левая', Номер: 127, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1817, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1972, Координата: 0},
					Нижняя: { Элемент: 'ПринятыеИУволенныеВоеннообязанные', Граница: 'Верхняя', Номер: 127, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:223,
			Верх:389,
			Лево:467,
		},
		{
			xtype: 'label',
			id: 'ДанныеДляКарточкиУчетаОрганизацииВВоенкомате2',
			text: 'Карточка учета организации в военкомате (форма №18)',
			style: 'position:absolute;left:467px;top:407px;width:223px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДанныеДляКарточкиУчетаОрганизацииВВоенкомате2', Граница: 'Левая', Номер: 128, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1817, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1972, Координата: 0},
					Нижняя: { Элемент: 'ДанныеДляКарточкиУчетаОрганизацииВВоенкомате2', Граница: 'Верхняя', Номер: 128, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:223,
			Верх:407,
			Лево:467,
		},
		{
			xtype: 'label',
			id: 'ЧисленностьРаботающихИЗабронированныхГражданЗапаса2',
			text: 'Численность работающих и забронированных (форма №6)',
			style: 'position:absolute;left:467px;top:438px;width:223px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЧисленностьРаботающихИЗабронированныхГражданЗапаса2', Граница: 'Левая', Номер: 129, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1817, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1972, Координата: 0},
					Нижняя: { Элемент: 'ЧисленностьРаботающихИЗабронированныхГражданЗапаса2', Граница: 'Верхняя', Номер: 129, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:223,
			Верх:438,
			Лево:467,
		},
		{
			xtype: 'label',
			id: 'СписокПервоначальнойПостановкиНаВоинскийУчет2',
			text: 'Список первоначальной постановки на воинский учет',
			style: 'position:absolute;left:467px;top:469px;width:223px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СписокПервоначальнойПостановкиНаВоинскийУчет2', Граница: 'Левая', Номер: 130, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1817, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1972, Координата: 0},
					Нижняя: { Элемент: 'СписокПервоначальнойПостановкиНаВоинскийУчет2', Граница: 'Верхняя', Номер: 130, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:223,
			Верх:469,
			Лево:467,
		},
		{
			xtype: 'label',
			id: 'СписокГражданПодлежащихПостановкеНаВоинскийУчет2',
			text: 'Список граждан, подлежащих постановке на воинский учет',
			style: 'position:absolute;left:467px;top:500px;width:223px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СписокГражданПодлежащихПостановкеНаВоинскийУчет2', Граница: 'Левая', Номер: 131, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1817, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СписокГражданПодлежащихПостановкеНаВоинскийУчет2', Граница: 'Верхняя', Номер: 131, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:223,
			Верх:500,
			Лево:467,
		},
		{
			xtype: 'label',
			id: 'НадписьКадровыйУчет',
			text: 'Кадровый учет',
			style: 'position:absolute;left:56px;top:0px;width:170px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьКадровыйУчет', Граница: 'Левая', Номер: 132, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьКадровыйУчет', Граница: 'Верхняя', Номер: 132, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:170,
			Верх:0,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ГрафикиРаботы2',
			text: 'Графики  работы',
			style: 'position:absolute;left:306px;top:90px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ГрафикиРаботы2', Граница: 'Левая', Номер: 135, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ГрафикиРаботы2', Граница: 'Верхняя', Номер: 135, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:90,
			Лево:306,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы2',
			title: 'Воинский учет сотрудников',
			style: 'position:absolute;left:459px;top:263px;width:203px;height:16px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:16,
			Ширина:203,
			Верх:263,
			Лево:459,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы3',
			title: '',
			style: 'position:absolute;left:8px;top:250px;width:386px;height:5px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 617, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы3', Граница: 'Верхняя', Номер: 443, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:5,
			Ширина:386,
			Верх:250,
			Лево:8,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы4',
			title: '',
			style: 'position:absolute;left:467px;top:303px;width:223px;height:7px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РамкаГруппы4', Граница: 'Левая', Номер: 444, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1972, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы4', Граница: 'Верхняя', Номер: 444, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:7,
			Ширина:223,
			Верх:303,
			Лево:467,
		},
		{
			xtype: 'label',
			id: 'НовыйСотрудник',
			text: 'Новый сотрудник',
			style: 'position:absolute;left:170px;top:48px;width:102px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НовыйСотрудник', Граница: 'Левая', Номер: 550, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НовыйСотрудник', Граница: 'Верхняя', Номер: 550, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:102,
			Верх:48,
			Лево:170,
		},
		{
			xtype: 'panel',
			id: ПанельКадровыеДокументы,
			style: 'position:absolute;left:56px;top:90px;width:247px;height:145px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:145,
			Ширина:247,
			Верх:90,
			Лево:56,
			height: 145,width: 247,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'УчетКадров3',
			text: 'Кадровые документы',
			style: 'position:absolute;left:0px;top:0px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УчетКадров3', Граница: 'Левая', Номер: 618, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УчетКадров3', Граница: 'Верхняя', Номер: 618, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:0,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ПриемНаРаботу3',
			text: 'Прием на  работу',
			style: 'position:absolute;left:32px;top:41px;width:197px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПриемНаРаботу3', Граница: 'Левая', Номер: 619, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПриемНаРаботу3', Граница: 'Верхняя', Номер: 619, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:197,
			Верх:41,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'КадровоеПеремещение3',
			text: 'Кадровое перемещение',
			style: 'position:absolute;left:32px;top:58px;width:197px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КадровоеПеремещение3', Граница: 'Левая', Номер: 620, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'КадровоеПеремещение3', Граница: 'Верхняя', Номер: 620, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:197,
			Верх:58,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'Увольнение3',
			text: 'Увольнение',
			style: 'position:absolute;left:32px;top:75px;width:197px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Увольнение3', Граница: 'Левая', Номер: 621, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Увольнение3', Граница: 'Верхняя', Номер: 621, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:197,
			Верх:75,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'СотрудникиОрганизаций5',
			text: 'Трудовые договоры',
			style: 'position:absolute;left:32px;top:101px;width:150px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СотрудникиОрганизаций5', Граница: 'Левая', Номер: 622, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СотрудникиОрганизаций5', Граница: 'Верхняя', Номер: 622, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:150,
			Верх:101,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'СпискиДоговорниковОрганизаций3',
			text: 'Отчет по договорникам',
			style: 'position:absolute;left:32px;top:120px;width:150px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпискиДоговорниковОрганизаций3', Граница: 'Левая', Номер: 2078, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпискиДоговорниковОрганизаций3', Граница: 'Верхняя', Номер: 2078, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:150,
			Верх:120,
			Лево:32,
		},
					]
				},
				{
					id: Регл,
					items:
					[
		{
			xtype: 'label',
			id: 'УчетКадровОрганизаций2',
			text: 'Кадровые документы',
			style: 'position:absolute;left:0px;top:0px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УчетКадровОрганизаций2', Граница: 'Левая', Номер: 2021, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УчетКадровОрганизаций2', Граница: 'Верхняя', Номер: 2021, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:0,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ПриемНаРаботуВОрганизацию2',
			text: 'Прием на  работу',
			style: 'position:absolute;left:32px;top:41px;width:197px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПриемНаРаботуВОрганизацию2', Граница: 'Левая', Номер: 2022, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПриемНаРаботуВОрганизацию2', Граница: 'Верхняя', Номер: 2022, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:197,
			Верх:41,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'КадровоеПеремещениеОрганизаций2',
			text: 'Кадровое перемещение',
			style: 'position:absolute;left:32px;top:58px;width:197px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КадровоеПеремещениеОрганизаций2', Граница: 'Левая', Номер: 2023, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'КадровоеПеремещениеОрганизаций2', Граница: 'Верхняя', Номер: 2023, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:197,
			Верх:58,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'УвольнениеИзОрганизаций2',
			text: 'Увольнение',
			style: 'position:absolute;left:32px;top:75px;width:197px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УвольнениеИзОрганизаций2', Граница: 'Левая', Номер: 2024, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УвольнениеИзОрганизаций2', Граница: 'Верхняя', Номер: 2024, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:197,
			Верх:75,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'СотрудникиОрганизаций4',
			text: 'Трудовые договоры',
			style: 'position:absolute;left:32px;top:101px;width:150px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СотрудникиОрганизаций4', Граница: 'Левая', Номер: 2025, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СотрудникиОрганизаций4', Граница: 'Верхняя', Номер: 2025, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:150,
			Верх:101,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'СпискиДоговорниковОрганизаций2',
			text: 'Отчет по договорникам',
			style: 'position:absolute;left:32px;top:120px;width:150px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпискиДоговорниковОрганизаций2', Граница: 'Левая', Номер: 2027, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпискиДоговорниковОрганизаций2', Граница: 'Верхняя', Номер: 2027, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:150,
			Верх:120,
			Лево:32,
		},
					]
				},
			]
		},
		{
			xtype: 'panel',
			id: ПанельВстречиМероприятия,
			style: 'position:absolute;left:306px;top:178px;width:150px;height:41px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:41,
			Ширина:150,
			Верх:178,
			Лево:306,
			height: 41,width: 150,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'Встречи',
			text: 'Встречи',
			style: 'position:absolute;left:0px;top:0px;width:150px;height:32px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Встречи', Граница: 'Левая', Номер: 650, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Встречи', Граница: 'Верхняя', Номер: 650, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:32,
			Ширина:150,
			Верх:0,
			Лево:0,
		},
					]
				},
				{
					id: Регл,
				},
			]
		},
		{
			xtype: 'panel',
			id: КадровыйУчетОтчеты,
			style: 'position:absolute;left:8px;top:255px;width:424px;height:280px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:280,
			Ширина:424,
			Верх:255,
			Лево:8,
			height: 280,width: 424,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'ДвижениеРаботников',
			text: 'Отчет о кадровых перемещениях',
			style: 'position:absolute;left:48px;top:130px;width:176px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДвижениеРаботников', Граница: 'Левая', Номер: 1818, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДвижениеРаботников', Граница: 'Верхняя', Номер: 1818, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:176,
			Верх:130,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ32',
			text: 'Унифицированная форма Т-3',
			style: 'position:absolute;left:248px;top:93px;width:168px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ32', Граница: 'Левая', Номер: 1820, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ32', Граница: 'Верхняя', Номер: 1820, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:168,
			Верх:93,
			Лево:248,
		},
		{
			xtype: 'label',
			id: 'СредняяЧисленностьРаботниковОрганизаций2',
			text: 'Средняя численность',
			style: 'position:absolute;left:248px;top:166px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СредняяЧисленностьРаботниковОрганизаций2', Граница: 'Левая', Номер: 1821, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СредняяЧисленностьРаботниковОрганизаций2', Граница: 'Верхняя', Номер: 1821, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:166,
			Лево:248,
		},
		{
			xtype: 'label',
			id: 'ДвижениеРаботниковОрганизаций2',
			text: 'Отчет о кадровых перемещениях',
			style: 'position:absolute;left:248px;top:130px;width:176px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДвижениеРаботниковОрганизаций2', Граница: 'Левая', Номер: 1822, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДвижениеРаботниковОрганизаций2', Граница: 'Верхняя', Номер: 1822, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:176,
			Верх:130,
			Лево:248,
		},
		{
			xtype: 'label',
			id: 'ШтатнаяРасстановкаОрганизаций2',
			text: 'Отчет по штатной расстановке',
			style: 'position:absolute;left:248px;top:112px;width:168px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ШтатнаяРасстановкаОрганизаций2', Граница: 'Левая', Номер: 1823, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ШтатнаяРасстановкаОрганизаций2', Граница: 'Верхняя', Номер: 1823, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:168,
			Верх:112,
			Лево:248,
		},
		{
			xtype: 'label',
			id: 'СтатистикаКадров',
			text: 'Статистические данные',
			style: 'position:absolute;left:48px;top:93px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СтатистикаКадров', Граница: 'Левая', Номер: 1824, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СтатистикаКадров', Граница: 'Верхняя', Номер: 1824, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:93,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ22',
			text: 'Личная карточка Т-2',
			style: 'position:absolute;left:248px;top:147px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ22', Граница: 'Левая', Номер: 1825, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ22', Граница: 'Верхняя', Номер: 1825, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:147,
			Лево:248,
		},
		{
			xtype: 'label',
			id: 'НадписьОтчеты2',
			text: 'Отчеты',
			style: 'position:absolute;left:48px;top:0px;width:162px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:162,
			Верх:0,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'СпискиРаботников',
			text: 'Списки сотрудников',
			style: 'position:absolute;left:48px;top:75px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпискиРаботников', Граница: 'Левая', Номер: 1827, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпискиРаботников', Граница: 'Верхняя', Номер: 1827, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:75,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'СтатистикаКадровОрганизации4',
			text: 'Статистические данные ',
			style: 'position:absolute;left:248px;top:76px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СтатистикаКадровОрганизации4', Граница: 'Левая', Номер: 1828, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СтатистикаКадровОрганизации4', Граница: 'Верхняя', Номер: 1828, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:76,
			Лево:248,
		},
		{
			xtype: 'label',
			id: 'ШтатнаяРасстановка',
			text: 'Отчет по штатной расстановке',
			style: 'position:absolute;left:48px;top:112px;width:168px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ШтатнаяРасстановка', Граница: 'Левая', Номер: 1829, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ШтатнаяРасстановка', Граница: 'Верхняя', Номер: 1829, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:168,
			Верх:112,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'ПерсонифицированныйУчетПФР3',
			text: 'Персонифицированный учет',
			style: 'position:absolute;left:216px;top:223px;width:162px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПерсонифицированныйУчетПФР3', Граница: 'Левая', Номер: 1830, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПерсонифицированныйУчетПФР3', Граница: 'Верхняя', Номер: 1830, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:162,
			Верх:223,
			Лево:216,
		},
		{
			xtype: 'label',
			id: 'ДолжностиОрганизаций8',
			text: 'Должности',
			style: 'position:absolute;left:48px;top:240px;width:152px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДолжностиОрганизаций8', Граница: 'Левая', Номер: 1831, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДолжностиОрганизаций8', Граница: 'Верхняя', Номер: 1831, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:152,
			Верх:240,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'НадписьСмТакже17',
			text: 'См. также',
			style: 'position:absolute;left:48px;top:191px;width:162px;height:32px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьСмТакже17', Граница: 'Левая', Номер: 1833, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьСмТакже17', Граница: 'Верхняя', Номер: 1833, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:32,
			Ширина:162,
			Верх:191,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'ФизическиеЛица3',
			text: 'Физические лица',
			style: 'position:absolute;left:31px;top:257px;width:168px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ФизическиеЛица3', Граница: 'Левая', Номер: 1834, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ФизическиеЛица3', Граница: 'Верхняя', Номер: 1834, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:168,
			Верх:257,
			Лево:31,
		},
		{
			xtype: 'label',
			id: 'Подразделения4',
			text: 'Подразделения',
			style: 'position:absolute;left:48px;top:223px;width:133px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Подразделения4', Граница: 'Левая', Номер: 1835, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Подразделения4', Граница: 'Верхняя', Номер: 1835, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:133,
			Верх:223,
			Лево:48,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаПоОрганизациям',
			title: 'По организациям',
			style: 'position:absolute;left:248px;top:49px;width:138px;height:14px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаПоОрганизациям', Граница: 'Верхняя', Номер: 1836, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:14,
			Ширина:138,
			Верх:49,
			Лево:248,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаПоОрганизациям2',
			title: 'По компании',
			style: 'position:absolute;left:48px;top:49px;width:138px;height:14px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Левая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаПоОрганизациям2', Граница: 'Верхняя', Номер: 1837, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:14,
			Ширина:138,
			Верх:49,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ42',
			text: 'Учетная карточка Т-4',
			style: 'position:absolute;left:248px;top:184px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ42', Граница: 'Левая', Номер: 2084, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ42', Граница: 'Верхняя', Номер: 2084, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:184,
			Лево:248,
		},
					]
				},
				{
					id: Регл,
					items:
					[
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ34',
			text: 'Унифицированная форма Т-3',
			style: 'position:absolute;left:216px;top:66px;width:168px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ34', Граница: 'Левая', Номер: 2038, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ34', Граница: 'Верхняя', Номер: 2038, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:168,
			Верх:66,
			Лево:216,
		},
		{
			xtype: 'label',
			id: 'СредняяЧисленностьРаботниковОрганизаций3',
			text: 'Средняя численность',
			style: 'position:absolute;left:48px;top:102px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СредняяЧисленностьРаботниковОрганизаций3', Граница: 'Левая', Номер: 2039, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СредняяЧисленностьРаботниковОрганизаций3', Граница: 'Верхняя', Номер: 2039, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:102,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'ДвижениеРаботниковОрганизаций3',
			text: 'Отчет о кадровых перемещениях',
			style: 'position:absolute;left:216px;top:102px;width:176px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДвижениеРаботниковОрганизаций3', Граница: 'Левая', Номер: 2040, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДвижениеРаботниковОрганизаций3', Граница: 'Верхняя', Номер: 2040, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:176,
			Верх:102,
			Лево:216,
		},
		{
			xtype: 'label',
			id: 'ШтатнаяРасстановкаОрганизаций3',
			text: 'Отчет по штатной расстановке',
			style: 'position:absolute;left:216px;top:84px;width:168px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ШтатнаяРасстановкаОрганизаций3', Граница: 'Левая', Номер: 2041, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ШтатнаяРасстановкаОрганизаций3', Граница: 'Верхняя', Номер: 2041, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:168,
			Верх:84,
			Лево:216,
		},
		{
			xtype: 'label',
			id: 'СтатистикаКадровОрганизации5',
			text: 'Статистические данные',
			style: 'position:absolute;left:48px;top:84px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СтатистикаКадровОрганизации5', Граница: 'Левая', Номер: 2042, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СтатистикаКадровОрганизации5', Граница: 'Верхняя', Номер: 2042, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:84,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ25',
			text: 'Личная карточка Т-2',
			style: 'position:absolute;left:48px;top:120px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ25', Граница: 'Левая', Номер: 2043, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ25', Граница: 'Верхняя', Номер: 2043, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:120,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'НадписьОтчеты13',
			text: 'Отчеты',
			style: 'position:absolute;left:48px;top:0px;width:162px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьОтчеты13', Граница: 'Левая', Номер: 2044, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьОтчеты13', Граница: 'Верхняя', Номер: 2044, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:162,
			Верх:0,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'СпискиРаботниковОрганизаций5',
			text: 'Списки сотрудников',
			style: 'position:absolute;left:48px;top:66px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпискиРаботниковОрганизаций5', Граница: 'Левая', Номер: 2045, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпискиРаботниковОрганизаций5', Граница: 'Верхняя', Номер: 2045, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:66,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'ПерсонифицированныйУчетПФР4',
			text: 'Персонифицированный учет',
			style: 'position:absolute;left:216px;top:223px;width:162px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПерсонифицированныйУчетПФР4', Граница: 'Левая', Номер: 2046, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПерсонифицированныйУчетПФР4', Граница: 'Верхняя', Номер: 2046, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:162,
			Верх:223,
			Лево:216,
		},
		{
			xtype: 'label',
			id: 'ДолжностиОрганизаций9',
			text: 'Должности',
			style: 'position:absolute;left:48px;top:240px;width:152px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДолжностиОрганизаций9', Граница: 'Левая', Номер: 2047, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДолжностиОрганизаций9', Граница: 'Верхняя', Номер: 2047, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:152,
			Верх:240,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'НадписьСмТакже19',
			text: 'См. также',
			style: 'position:absolute;left:48px;top:191px;width:162px;height:32px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьСмТакже19', Граница: 'Левая', Номер: 2049, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьСмТакже19', Граница: 'Верхняя', Номер: 2049, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:32,
			Ширина:162,
			Верх:191,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'ПодразделенияОрганизаций4',
			text: 'Подразделения',
			style: 'position:absolute;left:48px;top:223px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПодразделенияОрганизаций4', Граница: 'Левая', Номер: 2050, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПодразделенияОрганизаций4', Граница: 'Верхняя', Номер: 2050, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:223,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'ФизическиеЛица9',
			text: 'Физические лица',
			style: 'position:absolute;left:32px;top:257px;width:168px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ФизическиеЛица9', Граница: 'Левая', Номер: 2051, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ФизическиеЛица9', Граница: 'Верхняя', Номер: 2051, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:168,
			Верх:257,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ41',
			text: 'Учетная карточка Т-4',
			style: 'position:absolute;left:48px;top:138px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ41', Граница: 'Левая', Номер: 2083, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ41', Граница: 'Верхняя', Номер: 2083, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:138,
			Лево:48,
		},
					]
				},
			]
		},
		{
			xtype: 'label',
			id: 'ПоказНамеченныхСобытийПоПерсоналу3',
			text: 'Запланированные кадровые перестановки',
			style: 'position:absolute;left:306px;top:134px;width:161px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПоказНамеченныхСобытийПоПерсоналу3', Граница: 'Левая', Номер: 1953, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 617, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПоказНамеченныхСобытийПоПерсоналу3', Граница: 'Верхняя', Номер: 1953, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:161,
			Верх:134,
			Лево:306,
		},
		{
			xtype: 'panel',
			id: ПанельОтклонения,
			style: 'position:absolute;left:467px;top:48px;width:215px;height:217px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:217,
			Ширина:215,
			Верх:48,
			Лево:467,
			height: 217,width: 215,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'Отклонения4',
			text: 'Отпуска, отсутствия,  командировки, неявки',
			style: 'position:absolute;left:0px;top:0px;width:215px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Отклонения4', Граница: 'Левая', Номер: 1973, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Отклонения4', Граница: 'Верхняя', Номер: 1973, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:215,
			Верх:0,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ФормаОстатковОтпусков',
			text: 'Остатки отпусков',
			style: 'position:absolute;left:0px;top:130px;width:181px;height:35px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ФормаОстатковОтпусков', Граница: 'Левая', Номер: 1974, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ФормаОстатковОтпусков', Граница: 'Верхняя', Номер: 1974, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:35,
			Ширина:181,
			Верх:130,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ГрафикОтпусков3',
			text: 'График отпусков',
			style: 'position:absolute;left:32px;top:165px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ГрафикОтпусков3', Граница: 'Левая', Номер: 1975, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ГрафикОтпусков3', Граница: 'Верхняя', Номер: 1975, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:165,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'УчастиеВМероприятиях',
			text: 'Регистрация участия в мероприятиях',
			style: 'position:absolute;left:32px;top:48px;width:150px;height:38px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УчастиеВМероприятиях', Граница: 'Левая', Номер: 1976, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УчастиеВМероприятиях', Граница: 'Верхняя', Номер: 1976, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:38,
			Ширина:150,
			Верх:48,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'УчастиеРаботниковВМероприятиях',
			text: 'Участие в мероприятиях',
			style: 'position:absolute;left:32px;top:86px;width:150px;height:19px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УчастиеРаботниковВМероприятиях', Граница: 'Левая', Номер: 1977, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УчастиеРаботниковВМероприятиях', Граница: 'Верхняя', Номер: 1977, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:150,
			Верх:86,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'Отпуска',
			text: 'Отчет по отпускам',
			style: 'position:absolute;left:32px;top:182px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Отпуска', Граница: 'Левая', Номер: 1978, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Отпуска', Граница: 'Верхняя', Номер: 1978, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:182,
			Лево:32,
		},
					]
				},
				{
					id: Регл,
					items:
					[
		{
			xtype: 'label',
			id: 'ОтклоненияОрганизаций3',
			text: 'Отпуска, командировки, неявки',
			style: 'position:absolute;left:0px;top:0px;width:182px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОтклоненияОрганизаций3', Граница: 'Левая', Номер: 2028, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОтклоненияОрганизаций3', Граница: 'Верхняя', Номер: 2028, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:182,
			Верх:0,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ОтпускаОрганизаций2',
			text: 'Отпуска',
			style: 'position:absolute;left:32px;top:43px;width:118px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОтпускаОрганизаций2', Граница: 'Левая', Номер: 2029, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОтпускаОрганизаций2', Граница: 'Верхняя', Номер: 2029, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:118,
			Верх:43,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'КомандировкиОрганизаций2',
			text: 'Командировки',
			style: 'position:absolute;left:32px;top:60px;width:118px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КомандировкиОрганизаций2', Граница: 'Левая', Номер: 2030, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'КомандировкиОрганизаций2', Граница: 'Верхняя', Номер: 2030, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:118,
			Верх:60,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'НеявкиИБолезниОрганизаций2',
			text: 'Неявки и болезни',
			style: 'position:absolute;left:32px;top:77px;width:118px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НеявкиИБолезниОрганизаций2', Граница: 'Левая', Номер: 2031, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НеявкиИБолезниОрганизаций2', Граница: 'Верхняя', Номер: 2031, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:118,
			Верх:77,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ВозвратНаРаботуОрганизаций2',
			text: 'Возврат на работу',
			style: 'position:absolute;left:32px;top:94px;width:118px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВозвратНаРаботуОрганизаций2', Граница: 'Левая', Номер: 2032, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВозвратНаРаботуОрганизаций2', Граница: 'Верхняя', Номер: 2032, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:118,
			Верх:94,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ОстаткиОтпусковОрганизаций2',
			text: 'Остатки отпусков',
			style: 'position:absolute;left:0px;top:130px;width:198px;height:35px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОстаткиОтпусковОрганизаций2', Граница: 'Левая', Номер: 2033, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОстаткиОтпусковОрганизаций2', Граница: 'Верхняя', Номер: 2033, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:35,
			Ширина:198,
			Верх:130,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'Отпуска1',
			text: 'Отчет по отпускам',
			style: 'position:absolute;left:32px;top:182px;width:164px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Отпуска1', Граница: 'Левая', Номер: 2035, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Отпуска1', Граница: 'Верхняя', Номер: 2035, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:164,
			Верх:182,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ГрафикОтпусковОрганизаций',
			text: 'График отпусков',
			style: 'position:absolute;left:32px;top:165px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ГрафикОтпусковОрганизаций', Граница: 'Левая', Номер: 2063, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ГрафикОтпусковОрганизаций', Граница: 'Верхняя', Номер: 2063, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:165,
			Лево:32,
		},
					]
				},
			]
		},
					]
				},
				{
					id: РасчетЗарплаты,
					items:
					[
		{
			xtype: 'label',
			id: 'ГрафикиРаботы1',
			text: 'Графики  работы',
			style: 'position:absolute;left:218px;top:132px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ГрафикиРаботы1', Граница: 'Левая', Номер: 59, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:132,
			Лево:218,
		},
		{
			xtype: 'label',
			id: 'ВводИндивидуальныхГрафиковРаботыОрганизации4',
			text: 'Индивидуальные графики работы',
			style: 'position:absolute;left:305px;top:254px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводИндивидуальныхГрафиковРаботыОрганизации4', Граница: 'Левая', Номер: 211, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводИндивидуальныхГрафиковРаботыОрганизации4', Граница: 'Верхняя', Номер: 211, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:254,
			Лево:305,
		},
		{
			xtype: 'label',
			id: 'ОтпускаПоУходуЗаРебенком4',
			text: 'Отпуска по уходу за ребенком',
			style: 'position:absolute;left:273px;top:191px;width:194px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОтпускаПоУходуЗаРебенком4', Граница: 'Левая', Номер: 212, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОтпускаПоУходуЗаРебенком4', Граница: 'Верхняя', Номер: 212, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:194,
			Верх:191,
			Лево:273,
		},
		{
			xtype: 'label',
			id: 'АнализНеявок4',
			text: 'Анализ неявок',
			style: 'position:absolute;left:305px;top:271px;width:143px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'АнализНеявок4', Граница: 'Левая', Номер: 213, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'АнализНеявок4', Граница: 'Верхняя', Номер: 213, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:143,
			Верх:271,
			Лево:305,
		},
		{
			xtype: 'label',
			id: 'ТабельУчетаРабочегоВремениОрганизации4',
			text: 'Табель учета рабочего времени',
			style: 'position:absolute;left:305px;top:237px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ТабельУчетаРабочегоВремениОрганизации4', Граница: 'Левая', Номер: 214, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ТабельУчетаРабочегоВремениОрганизации4', Граница: 'Верхняя', Номер: 214, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:237,
			Лево:305,
		},
		{
			xtype: 'label',
			id: 'НачислениеПоБольничномуЛисту4',
			text: 'Начисление по больничному',
			style: 'position:absolute;left:305px;top:107px;width:164px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НачислениеПоБольничномуЛисту4', Граница: 'Левая', Номер: 219, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НачислениеПоБольничномуЛисту4', Граница: 'Верхняя', Номер: 219, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:164,
			Верх:107,
			Лево:305,
		},
		{
			xtype: 'label',
			id: 'НачислениеОтпускаРаботникамОрганизаций4',
			text: 'Начисление отпуска',
			style: 'position:absolute;left:305px;top:89px;width:164px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НачислениеОтпускаРаботникамОрганизаций4', Граница: 'Левая', Номер: 220, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НачислениеОтпускаРаботникамОрганизаций4', Граница: 'Верхняя', Номер: 220, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:164,
			Верх:89,
			Лево:305,
		},
		{
			xtype: 'label',
			id: 'НадписьЗарплата',
			text: 'Расчет зарплаты',
			style: 'position:absolute;left:54px;top:0px;width:210px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьЗарплата', Граница: 'Левая', Номер: 223, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьЗарплата', Граница: 'Верхняя', Номер: 223, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:210,
			Верх:0,
			Лево:54,
		},
		{
			xtype: 'label',
			id: 'ОплатаПоСреднемуЗаработку3',
			text: 'Оплата по среднему заработку',
			style: 'position:absolute;left:305px;top:143px;width:164px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОплатаПоСреднемуЗаработку3', Граница: 'Левая', Номер: 229, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОплатаПоСреднемуЗаработку3', Граница: 'Верхняя', Номер: 229, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:164,
			Верх:143,
			Лево:305,
		},
		{
			xtype: 'label',
			id: 'НевыходыВОрганизациях3',
			text: 'Невыходы',
			style: 'position:absolute;left:305px;top:125px;width:164px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НевыходыВОрганизациях3', Граница: 'Левая', Номер: 230, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НевыходыВОрганизациях3', Граница: 'Верхняя', Номер: 230, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:164,
			Верх:125,
			Лево:305,
		},
		{
			xtype: 'label',
			id: 'РасчетОплатыНеявок4',
			text: 'Журнал оплачиваемых неявок',
			style: 'position:absolute;left:273px;top:48px;width:196px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетОплатыНеявок4', Граница: 'Левая', Номер: 264, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетОплатыНеявок4', Граница: 'Верхняя', Номер: 264, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:196,
			Верх:48,
			Лево:273,
		},
		{
			xtype: 'label',
			id: 'ЗаявкаНаОткрытиеСчетов4',
			text: 'Заявки на открытие лицевого счета',
			style: 'position:absolute;left:518px;top:283px;width:174px;height:34px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗаявкаНаОткрытиеСчетов4', Граница: 'Левая', Номер: 269, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗаявкаНаОткрытиеСчетов4', Граница: 'Верхняя', Номер: 269, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:34,
			Ширина:174,
			Верх:283,
			Лево:518,
		},
		{
			xtype: 'label',
			id: 'ДоговорНаВыполнениеРаботСФизЛицом4',
			text: 'Договоры ГПХ',
			style: 'position:absolute;left:56px;top:480px;width:126px;height:15px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДоговорНаВыполнениеРаботСФизЛицом4', Граница: 'Левая', Номер: 270, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 777, Координата: 0},
					Нижняя: { Элемент: 'ДоговорНаВыполнениеРаботСФизЛицом4', Граница: 'Верхняя', Номер: 270, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:15,
			Ширина:126,
			Верх:480,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ИсполнительныйЛист4',
			text: 'Исполнительные листы',
			style: 'position:absolute;left:56px;top:496px;width:126px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ИсполнительныйЛист4', Граница: 'Левая', Номер: 273, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 777, Координата: 0},
					Нижняя: { Элемент: 'ИсполнительныйЛист4', Граница: 'Верхняя', Номер: 273, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:126,
			Верх:496,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ПерерасчетЗарплатыОрганизаций4',
			text: 'Перерасчет зарплаты',
			style: 'position:absolute;left:56px;top:512px;width:126px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПерерасчетЗарплатыОрганизаций4', Граница: 'Левая', Номер: 275, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 777, Координата: 0},
					Нижняя: { Элемент: 'ПерерасчетЗарплатыОрганизаций4', Граница: 'Верхняя', Номер: 275, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:126,
			Верх:512,
			Лево:56,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы5',
			title: '',
			style: 'position:absolute;left:8px;top:324px;width:684px;height:6px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: 'Форма', Граница: 'Левая', Номер: 0, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы5', Граница: 'Верхняя', Номер: 454, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:6,
			Ширина:684,
			Верх:324,
			Лево:8,
		},
		{
			xtype: 'label',
			id: 'НадписьСмТакже10',
			text: 'См. также',
			style: 'position:absolute;left:56px;top:450px;width:162px;height:27px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьСмТакже10', Граница: 'Левая', Номер: 456, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 1854, Координата: 0},
					Нижняя: { Элемент: 'НадписьСмТакже10', Граница: 'Верхняя', Номер: 456, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:27,
			Ширина:162,
			Верх:450,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ДоговорЗаймаСРаботником',
			text: 'Договор займа с сотрудником',
			style: 'position:absolute;left:518px;top:266px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДоговорЗаймаСРаботником', Граница: 'Левая', Номер: 671, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДоговорЗаймаСРаботником', Граница: 'Верхняя', Номер: 671, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:266,
			Лево:518,
		},
		{
			xtype: 'panel',
			id: РасчетЗарплатыОтчеты,
			style: 'position:absolute;left:8px;top:330px;width:677px;height:121px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:121,
			Ширина:677,
			Верх:330,
			Лево:8,
			height: 121,width: 677,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'РасчетныеЛистки5',
			text: 'Расчетные листки',
			style: 'position:absolute;left:48px;top:62px;width:126px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетныеЛистки5', Граница: 'Левая', Номер: 778, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетныеЛистки5', Граница: 'Верхняя', Номер: 778, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:126,
			Верх:62,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'КнигаАналитическогоУчетаДепонированнойЗарплаты5',
			text: 'Книга депонентов',
			style: 'position:absolute;left:474px;top:97px;width:141px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КнигаАналитическогоУчетаДепонированнойЗарплаты5', Граница: 'Левая', Номер: 779, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'КнигаАналитическогоУчетаДепонированнойЗарплаты5', Граница: 'Верхняя', Номер: 779, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:141,
			Верх:97,
			Лево:474,
		},
		{
			xtype: 'label',
			id: 'НадписьОтчеты11',
			text: 'Отчеты',
			style: 'position:absolute;left:48px;top:0px;width:208px;height:40px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьОтчеты11', Граница: 'Левая', Номер: 781, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьОтчеты11', Граница: 'Верхняя', Номер: 781, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:40,
			Ширина:208,
			Верх:0,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ132',
			text: 'Табель учета рабочего времени',
			style: 'position:absolute;left:474px;top:79px;width:166px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ132', Граница: 'Левая', Номер: 782, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ132', Граница: 'Верхняя', Номер: 782, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:166,
			Верх:79,
			Лево:474,
		},
		{
			xtype: 'label',
			id: 'СтруктураЗадолженностиОрганизаций5',
			text: 'Структура задолженности',
			style: 'position:absolute;left:474px;top:60px;width:141px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СтруктураЗадолженностиОрганизаций5', Граница: 'Левая', Номер: 784, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СтруктураЗадолженностиОрганизаций5', Граница: 'Верхняя', Номер: 784, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:141,
			Верх:60,
			Лево:474,
		},
		{
			xtype: 'label',
			id: 'СводНачисленнойЗарплаты6',
			text: 'Свод начисленной зарплаты',
			style: 'position:absolute;left:48px;top:97px;width:148px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СводНачисленнойЗарплаты6', Граница: 'Левая', Номер: 785, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СводНачисленнойЗарплаты6', Граница: 'Верхняя', Номер: 785, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:148,
			Верх:97,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'РасчетнаяВедомость',
			text: 'Расчетная ведомость',
			style: 'position:absolute;left:48px;top:79px;width:126px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетнаяВедомость', Граница: 'Левая', Номер: 786, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетнаяВедомость', Граница: 'Верхняя', Номер: 786, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:126,
			Верх:79,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'РасчетныеЛисткиОрганизаций6',
			text: 'Расчетные листки',
			style: 'position:absolute;left:265px;top:62px;width:126px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетныеЛисткиОрганизаций6', Граница: 'Левая', Номер: 787, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетныеЛисткиОрганизаций6', Граница: 'Верхняя', Номер: 787, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:126,
			Верх:62,
			Лево:265,
		},
		{
			xtype: 'label',
			id: 'РасчетныеВедомостиОрганизаций3',
			text: 'Расчетная ведомость',
			style: 'position:absolute;left:265px;top:79px;width:126px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетныеВедомостиОрганизаций3', Граница: 'Левая', Номер: 788, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетныеВедомостиОрганизаций3', Граница: 'Верхняя', Номер: 788, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:126,
			Верх:79,
			Лево:265,
		},
		{
			xtype: 'label',
			id: 'СводНачисленнойЗарплатыОрганизаций7',
			text: 'Свод начисленной зарплаты',
			style: 'position:absolute;left:265px;top:97px;width:148px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СводНачисленнойЗарплатыОрганизаций7', Граница: 'Левая', Номер: 789, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СводНачисленнойЗарплатыОрганизаций7', Граница: 'Верхняя', Номер: 789, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:148,
			Верх:97,
			Лево:265,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаПоОрганизациям1',
			title: 'По организациям',
			style: 'position:absolute;left:265px;top:43px;width:138px;height:14px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РамкаПоОрганизациям1', Граница: 'Левая', Номер: 1141, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаПоОрганизациям1', Граница: 'Верхняя', Номер: 1141, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:14,
			Ширина:138,
			Верх:43,
			Лево:265,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаПоКомпании',
			title: 'По компании',
			style: 'position:absolute;left:48px;top:43px;width:138px;height:14px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Левая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаПоКомпании', Граница: 'Верхняя', Номер: 1490, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:14,
			Ширина:138,
			Верх:43,
			Лево:48,
		},
					]
				},
				{
					id: Регл,
					items:
					[
		{
			xtype: 'label',
			id: 'РасчетныеЛисткиОрганизаций4',
			text: 'Расчетные листки',
			style: 'position:absolute;left:48px;top:47px;width:126px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетныеЛисткиОрганизаций4', Граница: 'Левая', Номер: 2008, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетныеЛисткиОрганизаций4', Граница: 'Верхняя', Номер: 2008, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:126,
			Верх:47,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'КнигаАналитическогоУчетаДепонированнойЗарплаты4',
			text: 'Книга депонентов',
			style: 'position:absolute;left:192px;top:64px;width:127px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КнигаАналитическогоУчетаДепонированнойЗарплаты4', Граница: 'Левая', Номер: 2009, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'КнигаАналитическогоУчетаДепонированнойЗарплаты4', Граница: 'Верхняя', Номер: 2009, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:127,
			Верх:64,
			Лево:192,
		},
		{
			xtype: 'label',
			id: 'НадписьОтчеты3',
			text: 'Отчеты',
			style: 'position:absolute;left:48px;top:0px;width:208px;height:40px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьОтчеты3', Граница: 'Левая', Номер: 2011, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьОтчеты3', Граница: 'Верхняя', Номер: 2011, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:40,
			Ширина:208,
			Верх:0,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'УнифицированнаяФормаТ131',
			text: 'Табель учета рабочего времени',
			style: 'position:absolute;left:351px;top:64px;width:166px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УнифицированнаяФормаТ131', Граница: 'Левая', Номер: 2012, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УнифицированнаяФормаТ131', Граница: 'Верхняя', Номер: 2012, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:166,
			Верх:64,
			Лево:351,
		},
		{
			xtype: 'label',
			id: 'СтруктураЗадолженностиОрганизаций4',
			text: 'Структура задолженности',
			style: 'position:absolute;left:192px;top:47px;width:141px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СтруктураЗадолженностиОрганизаций4', Граница: 'Левая', Номер: 2013, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СтруктураЗадолженностиОрганизаций4', Граница: 'Верхняя', Номер: 2013, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:141,
			Верх:47,
			Лево:192,
		},
		{
			xtype: 'label',
			id: 'СводНачисленнойЗарплатыОрганизаций5',
			text: 'Свод начисленной зарплаты',
			style: 'position:absolute;left:351px;top:47px;width:148px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СводНачисленнойЗарплатыОрганизаций5', Граница: 'Левая', Номер: 2014, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СводНачисленнойЗарплатыОрганизаций5', Граница: 'Верхняя', Номер: 2014, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:148,
			Верх:47,
			Лево:351,
		},
		{
			xtype: 'label',
			id: 'РасчетныеВедомостиОрганизаций1',
			text: 'Расчетная ведомость',
			style: 'position:absolute;left:48px;top:64px;width:126px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетныеВедомостиОрганизаций1', Граница: 'Левая', Номер: 2015, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетныеВедомостиОрганизаций1', Граница: 'Верхняя', Номер: 2015, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:126,
			Верх:64,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'ВыплатыЧерезБанк',
			text: 'Выплаты через банк',
			style: 'position:absolute;left:48px;top:81px;width:127px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВыплатыЧерезБанк', Граница: 'Левая', Номер: 2066, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВыплатыЧерезБанк', Граница: 'Верхняя', Номер: 2066, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:127,
			Верх:81,
			Лево:48,
		},
		{
			xtype: 'label',
			id: 'ВыработкаРаботников',
			text: 'Выработка сотрудников',
			style: 'position:absolute;left:544px;top:47px;width:127px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВыработкаРаботников', Граница: 'Левая', Номер: 2067, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВыработкаРаботников', Граница: 'Верхняя', Номер: 2067, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:127,
			Верх:47,
			Лево:544,
		},
					]
				},
			]
		},
		{
			xtype: 'panel',
			id: НачисленияУдержания,
			style: 'position:absolute;left:375px;top:468px;width:317px;height:61px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:61,
			Ширина:317,
			Верх:468,
			Лево:375,
			height: 61,width: 317,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'ФормаНачислений',
			text: 'Начисления',
			style: 'position:absolute;left:9px;top:10px;width:111px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ФормаНачислений', Граница: 'Левая', Номер: 1693, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ФормаНачислений', Граница: 'Верхняя', Номер: 1693, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:111,
			Верх:10,
			Лево:9,
		},
		{
			xtype: 'label',
			id: 'ФормаУдержаний',
			text: 'Удержания',
			style: 'position:absolute;left:9px;top:28px;width:111px;height:15px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ФормаУдержаний', Граница: 'Левая', Номер: 1694, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ФормаУдержаний', Граница: 'Верхняя', Номер: 1694, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:15,
			Ширина:111,
			Верх:28,
			Лево:9,
		},
		{
			xtype: 'label',
			id: 'ПлановыеНачисленияРаботников',
			text: 'Плановые начисления ',
			style: 'position:absolute;left:129px;top:10px;width:161px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПлановыеНачисленияРаботников', Граница: 'Левая', Номер: 1695, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПлановыеНачисленияРаботников', Граница: 'Верхняя', Номер: 1695, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:161,
			Верх:10,
			Лево:129,
		},
		{
			xtype: 'label',
			id: 'ПлановыеУдержанияРаботников',
			text: 'Плановые удержания ',
			style: 'position:absolute;left:129px;top:26px;width:162px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПлановыеУдержанияРаботников', Граница: 'Левая', Номер: 1696, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПлановыеУдержанияРаботников', Граница: 'Верхняя', Номер: 1696, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:162,
			Верх:26,
			Лево:129,
		},
					]
				},
				{
					id: Регл,
					items:
					[
		{
			xtype: 'label',
			id: 'ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций4',
			text: 'Постоянные начисления',
			style: 'position:absolute;left:183px;top:11px;width:134px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций4', Граница: 'Левая', Номер: 2016, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций4', Граница: 'Верхняя', Номер: 2016, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:134,
			Верх:11,
			Лево:183,
		},
		{
			xtype: 'label',
			id: 'ВводСведенийОПлановыхУдержанияхРаботниковОрганизаций4',
			text: 'Постоянные удержания',
			style: 'position:absolute;left:183px;top:28px;width:134px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводСведенийОПлановыхУдержанияхРаботниковОрганизаций4', Граница: 'Левая', Номер: 2017, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводСведенийОПлановыхУдержанияхРаботниковОрганизаций4', Граница: 'Верхняя', Номер: 2017, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:134,
			Верх:28,
			Лево:183,
		},
		{
			xtype: 'label',
			id: 'ОсновныеНачисленияОрганизаций',
			text: 'Основные начисления',
			style: 'position:absolute;left:9px;top:11px;width:131px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОсновныеНачисленияОрганизаций', Граница: 'Левая', Номер: 2018, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОсновныеНачисленияОрганизаций', Граница: 'Верхняя', Номер: 2018, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:131,
			Верх:11,
			Лево:9,
		},
		{
			xtype: 'label',
			id: 'УдержанияОрганизаций1',
			text: 'Удержания',
			style: 'position:absolute;left:9px;top:44px;width:131px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УдержанияОрганизаций1', Граница: 'Левая', Номер: 2019, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УдержанияОрганизаций1', Граница: 'Верхняя', Номер: 2019, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:131,
			Верх:44,
			Лево:9,
		},
		{
			xtype: 'label',
			id: 'ДополнительныеНачисленияОрганизаций1',
			text: 'Дополнительные начисления',
			style: 'position:absolute;left:9px;top:28px;width:156px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДополнительныеНачисленияОрганизаций1', Граница: 'Левая', Номер: 2020, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДополнительныеНачисленияОрганизаций1', Граница: 'Верхняя', Номер: 2020, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:156,
			Верх:28,
			Лево:9,
		},
					]
				},
			]
		},
		{
			xtype: 'panel',
			id: ПанельНачисленияЗарплаты,
			style: 'position:absolute;left:56px;top:48px;width:209px;height:269px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:269,
			Ширина:209,
			Верх:48,
			Лево:56,
			height: 269,width: 209,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'НачислениеЗарплатыРаботникам5',
			text: 'Начисление зарплаты',
			style: 'position:absolute;left:32px;top:41px;width:172px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НачислениеЗарплатыРаботникам5', Граница: 'Левая', Номер: 1855, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НачислениеЗарплатыРаботникам5', Граница: 'Верхняя', Номер: 1855, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:172,
			Верх:41,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ДокументыПоНачислениюЗарплаты',
			text: 'Журнал начисления зарплаты',
			style: 'position:absolute;left:0px;top:0px;width:194px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДокументыПоНачислениюЗарплаты', Граница: 'Левая', Номер: 1856, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДокументыПоНачислениюЗарплаты', Граница: 'Верхняя', Номер: 1856, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:194,
			Верх:0,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ВводСведенийОПлановыхНачисленияхУдержанияхРаботников',
			text: 'Ввод плановых начислений и удержаний',
			style: 'position:absolute;left:32px;top:77px;width:172px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводСведенийОПлановыхНачисленияхУдержанияхРаботников', Граница: 'Левая', Номер: 1857, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводСведенийОПлановыхНачисленияхУдержанияхРаботников', Граница: 'Верхняя', Номер: 1857, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:172,
			Верх:77,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'СдельныйНаряд4',
			text: 'Сдельный наряд',
			style: 'position:absolute;left:32px;top:59px;width:171px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СдельныйНаряд4', Граница: 'Левая', Номер: 1858, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СдельныйНаряд4', Граница: 'Верхняя', Номер: 1858, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:171,
			Верх:59,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'АнализПоказателей',
			text: 'Анализ показателей',
			style: 'position:absolute;left:32px;top:177px;width:170px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'АнализПоказателей', Граница: 'Левая', Номер: 1859, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'АнализПоказателей', Граница: 'Верхняя', Номер: 1859, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:170,
			Верх:177,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'МотивацияПерсонала',
			text: 'Мотивация персонала',
			style: 'position:absolute;left:0px;top:112px;width:201px;height:32px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'МотивацияПерсонала', Граница: 'Левая', Номер: 1860, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'МотивацияПерсонала', Граница: 'Верхняя', Номер: 1860, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:32,
			Ширина:201,
			Верх:112,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'АнализСхемМотивации',
			text: 'Анализ схем мотивации',
			style: 'position:absolute;left:32px;top:144px;width:170px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'АнализСхемМотивации', Граница: 'Левая', Номер: 1861, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'АнализСхемМотивации', Граница: 'Верхняя', Номер: 1861, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:170,
			Верх:144,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'УтверждениеCхемыМотивации',
			text: 'Утверждение схемы мотивации',
			style: 'position:absolute;left:32px;top:160px;width:170px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УтверждениеCхемыМотивации', Граница: 'Левая', Номер: 1862, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УтверждениеCхемыМотивации', Граница: 'Верхняя', Номер: 1862, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:170,
			Верх:160,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ЗначенияПоказателейСхемМотивации1',
			text: 'Показатели для расчета зарплаты',
			style: 'position:absolute;left:0px;top:200px;width:203px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗначенияПоказателейСхемМотивации1', Граница: 'Левая', Номер: 1865, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗначенияПоказателейСхемМотивации1', Граница: 'Верхняя', Номер: 1865, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:203,
			Верх:200,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ВводПостоянногоНачисленияИлиУдержания',
			text: 'Ввод постоянного начисления или удержания',
			style: 'position:absolute;left:32px;top:236px;width:174px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводПостоянногоНачисленияИлиУдержания', Граница: 'Левая', Номер: 1866, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводПостоянногоНачисленияИлиУдержания', Граница: 'Верхняя', Номер: 1866, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:174,
			Верх:236,
			Лево:32,
		},
					]
				},
				{
					id: Регл,
					items:
					[
		{
			xtype: 'label',
			id: 'НачислениеЗарплатыРаботникамОрганизаций4',
			text: 'Начисление зарплаты',
			style: 'position:absolute;left:32px;top:44px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НачислениеЗарплатыРаботникамОрганизаций4', Граница: 'Левая', Номер: 1995, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НачислениеЗарплатыРаботникамОрганизаций4', Граница: 'Верхняя', Номер: 1995, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:44,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ДокументыПоНачислениюЗарплатыОрганизаций',
			text: 'Журнал начисления зарплаты',
			style: 'position:absolute;left:0px;top:0px;width:194px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДокументыПоНачислениюЗарплатыОрганизаций', Граница: 'Левая', Номер: 1996, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДокументыПоНачислениюЗарплатыОрганизаций', Граница: 'Верхняя', Номер: 1996, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:194,
			Верх:0,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'РегистрацияРазовыхНачисленийРаботниковОрганизаций1',
			text: 'Регистрация разовых начислений',
			style: 'position:absolute;left:32px;top:78px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РегистрацияРазовыхНачисленийРаботниковОрганизаций1', Граница: 'Левая', Номер: 1997, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РегистрацияРазовыхНачисленийРаботниковОрганизаций1', Граница: 'Верхняя', Номер: 1997, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:78,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ПремииРаботниковОрганизаций3',
			text: 'Премии сотрудников',
			style: 'position:absolute;left:32px;top:61px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПремииРаботниковОрганизаций3', Граница: 'Левая', Номер: 1998, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПремииРаботниковОрганизаций3', Граница: 'Верхняя', Номер: 1998, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:61,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'РегистрацияРазовыхУдержанийРаботниковОрганизаций3',
			text: 'Регистрация разовых удержаний',
			style: 'position:absolute;left:32px;top:95px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РегистрацияРазовыхУдержанийРаботниковОрганизаций3', Граница: 'Левая', Номер: 1999, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РегистрацияРазовыхУдержанийРаботниковОрганизаций3', Граница: 'Верхняя', Номер: 1999, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:95,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ОплатаПраздничныхИВыходныхДнейОрганизаций3',
			text: 'Оплата праздничных и выходных',
			style: 'position:absolute;left:32px;top:112px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОплатаПраздничныхИВыходныхДнейОрганизаций3', Граница: 'Левая', Номер: 2000, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОплатаПраздничныхИВыходныхДнейОрганизаций3', Граница: 'Верхняя', Номер: 2000, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:112,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ОплатаСверхурочныхЧасов3',
			text: 'Оплата сверхурочных часов',
			style: 'position:absolute;left:32px;top:129px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОплатаСверхурочныхЧасов3', Граница: 'Левая', Номер: 2001, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОплатаСверхурочныхЧасов3', Граница: 'Верхняя', Номер: 2001, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:129,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'СдельныйНаряд3',
			text: 'Сдельный наряд',
			style: 'position:absolute;left:32px;top:146px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СдельныйНаряд3', Граница: 'Левая', Номер: 2002, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СдельныйНаряд3', Граница: 'Верхняя', Номер: 2002, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:146,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'РегистрацияПростоевРаботниковОрганизаций3',
			text: 'Регистрация простоев',
			style: 'position:absolute;left:32px;top:163px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РегистрацияПростоевРаботниковОрганизаций3', Граница: 'Левая', Номер: 2003, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РегистрацияПростоевРаботниковОрганизаций3', Граница: 'Верхняя', Номер: 2003, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:163,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'РасчетПриУвольненииРаботникаОрганизаций3',
			text: 'Расчет при увольнении',
			style: 'position:absolute;left:32px;top:180px;width:177px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетПриУвольненииРаботникаОрганизаций3', Граница: 'Левая', Номер: 2004, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетПриУвольненииРаботникаОрганизаций3', Граница: 'Верхняя', Номер: 2004, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:177,
			Верх:180,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ЗначенияПоказателейСхемМотивации2',
			text: 'Показатели для расчета зарплаты',
			style: 'position:absolute;left:2px;top:204px;width:207px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗначенияПоказателейСхемМотивации2', Граница: 'Левая', Номер: 2006, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗначенияПоказателейСхемМотивации2', Граница: 'Верхняя', Номер: 2006, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:207,
			Верх:204,
			Лево:2,
		},
		{
			xtype: 'label',
			id: 'ВводПостоянногоНачисленияИлиУдержанияСотрудникамОрганизации',
			text: 'Ввод постоянного начисления или удержания',
			style: 'position:absolute;left:32px;top:236px;width:177px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводПостоянногоНачисленияИлиУдержанияСотрудникамОрганизации', Граница: 'Левая', Номер: 2007, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводПостоянногоНачисленияИлиУдержанияСотрудникамОрганизации', Граница: 'Верхняя', Номер: 2007, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:177,
			Верх:236,
			Лево:32,
		},
					]
				},
			]
		},
		{
			xtype: 'panel',
			id: ПанельВыплатыЗарплаты,
			style: 'position:absolute;left:486px;top:48px;width:206px;height:213px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:213,
			Ширина:206,
			Верх:48,
			Лево:486,
			height: 213,width: 206,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'ДокументыПоВыплатеЗарплаты',
			text: 'Журнал выплаты зарплаты',
			style: 'position:absolute;left:0px;top:0px;width:179px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДокументыПоВыплатеЗарплаты', Граница: 'Левая', Номер: 1923, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДокументыПоВыплатеЗарплаты', Граница: 'Верхняя', Номер: 1923, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:179,
			Верх:0,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ЗарплатаКВыплате4',
			text: 'Зарплата к выплате',
			style: 'position:absolute;left:32px;top:43px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗарплатаКВыплате4', Граница: 'Левая', Номер: 1924, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗарплатаКВыплате4', Граница: 'Верхняя', Номер: 1924, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:43,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ПлатежноеПоручениеИсходящее1',
			text: 'Платежное поручение исходящее',
			style: 'position:absolute;left:32px;top:61px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПлатежноеПоручениеИсходящее1', Граница: 'Левая', Номер: 1925, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПлатежноеПоручениеИсходящее1', Граница: 'Верхняя', Номер: 1925, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:61,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'РасходныйКассовыйОрдер1',
			text: 'Расходный кассовый ордер',
			style: 'position:absolute;left:32px;top:78px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасходныйКассовыйОрдер1', Граница: 'Левая', Номер: 1926, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасходныйКассовыйОрдер1', Граница: 'Верхняя', Номер: 1926, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:78,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ПриходныйКассовыйОрдер4',
			text: 'Возврат сотрудником долга по зарплате (ПКО)',
			style: 'position:absolute;left:32px;top:180px;width:174px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПриходныйКассовыйОрдер4', Граница: 'Левая', Номер: 1927, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПриходныйКассовыйОрдер4', Граница: 'Верхняя', Номер: 1927, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:174,
			Верх:180,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'СписаниеДепонентовВДоходыОрганизаций4',
			text: 'Выплата (списание) депонентов',
			style: 'position:absolute;left:32px;top:132px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СписаниеДепонентовВДоходыОрганизаций4', Граница: 'Левая', Номер: 1928, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СписаниеДепонентовВДоходыОрганизаций4', Граница: 'Верхняя', Номер: 1928, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:132,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ПереносЗадолженностиРаботниковОрганизаций4',
			text: 'Перенос задолженности',
			style: 'position:absolute;left:32px;top:114px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПереносЗадолженностиРаботниковОрганизаций4', Граница: 'Левая', Номер: 1929, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПереносЗадолженностиРаботниковОрганизаций4', Граница: 'Верхняя', Номер: 1929, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:114,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ДепонированиеОрганизаций1',
			text: 'Депонирование',
			style: 'position:absolute;left:32px;top:96px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДепонированиеОрганизаций1', Граница: 'Левая', Номер: 1931, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДепонированиеОрганизаций1', Граница: 'Верхняя', Номер: 1931, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:96,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ПлатежныйОрдерСписаниеДенежныхСредств1',
			text: 'Выписка из банка на перечисление зарплаты',
			style: 'position:absolute;left:32px;top:147px;width:174px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПлатежныйОрдерСписаниеДенежныхСредств1', Граница: 'Левая', Номер: 1932, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПлатежныйОрдерСписаниеДенежныхСредств1', Граница: 'Верхняя', Номер: 1932, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:174,
			Верх:147,
			Лево:32,
		},
					]
				},
				{
					id: Регл,
					items:
					[
		{
			xtype: 'label',
			id: 'ДокументыПоВыплатеЗарплатыОрганизаций4',
			text: 'Журнал выплаты зарплаты',
			style: 'position:absolute;left:0px;top:0px;width:179px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДокументыПоВыплатеЗарплатыОрганизаций4', Граница: 'Левая', Номер: 1985, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДокументыПоВыплатеЗарплатыОрганизаций4', Граница: 'Верхняя', Номер: 1985, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:179,
			Верх:0,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ЗарплатаКВыплатеОрганизаций3',
			text: 'Зарплата к выплате',
			style: 'position:absolute;left:32px;top:43px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗарплатаКВыплатеОрганизаций3', Граница: 'Левая', Номер: 1986, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗарплатаКВыплатеОрганизаций3', Граница: 'Верхняя', Номер: 1986, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:43,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ПлатежноеПоручениеИсходящее',
			text: 'Платежное поручение исходящее',
			style: 'position:absolute;left:32px;top:61px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПлатежноеПоручениеИсходящее', Граница: 'Левая', Номер: 1987, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПлатежноеПоручениеИсходящее', Граница: 'Верхняя', Номер: 1987, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:61,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'РасходныйКассовыйОрдер',
			text: 'Расходный кассовый ордер',
			style: 'position:absolute;left:32px;top:78px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасходныйКассовыйОрдер', Граница: 'Левая', Номер: 1988, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасходныйКассовыйОрдер', Граница: 'Верхняя', Номер: 1988, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:78,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ПриходныйКассовыйОрдер3',
			text: 'Возврат сотрудником долга по зарплате (ПКО)',
			style: 'position:absolute;left:32px;top:178px;width:174px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПриходныйКассовыйОрдер3', Граница: 'Левая', Номер: 1989, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПриходныйКассовыйОрдер3', Граница: 'Верхняя', Номер: 1989, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:174,
			Верх:178,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'СписаниеДепонентовВДоходыОрганизаций3',
			text: 'Выплата (списание) депонентов',
			style: 'position:absolute;left:32px;top:130px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СписаниеДепонентовВДоходыОрганизаций3', Граница: 'Левая', Номер: 1990, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СписаниеДепонентовВДоходыОрганизаций3', Граница: 'Верхняя', Номер: 1990, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:130,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ПереносЗадолженностиРаботниковОрганизаций3',
			text: 'Перенос задолженности',
			style: 'position:absolute;left:32px;top:112px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПереносЗадолженностиРаботниковОрганизаций3', Граница: 'Левая', Номер: 1991, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПереносЗадолженностиРаботниковОрганизаций3', Граница: 'Верхняя', Номер: 1991, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:112,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ДепонированиеОрганизаций',
			text: 'Депонирование',
			style: 'position:absolute;left:32px;top:95px;width:174px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДепонированиеОрганизаций', Граница: 'Левая', Номер: 1993, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДепонированиеОрганизаций', Граница: 'Верхняя', Номер: 1993, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:174,
			Верх:95,
			Лево:32,
		},
		{
			xtype: 'label',
			id: 'ПлатежныйОрдерСписаниеДенежныхСредств',
			text: 'Выписка из банка на перечисление зарплаты',
			style: 'position:absolute;left:32px;top:145px;width:174px;height:33px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПлатежныйОрдерСписаниеДенежныхСредств', Граница: 'Левая', Номер: 1994, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПлатежныйОрдерСписаниеДенежныхСредств', Граница: 'Верхняя', Номер: 1994, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:174,
			Верх:145,
			Лево:32,
		},
					]
				},
			]
		},
		{
			xtype: 'label',
			id: 'Сторнирование',
			text: 'Сторнирование',
			style: 'position:absolute;left:305px;top:298px;width:164px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Сторнирование', Граница: 'Левая', Номер: 2062, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 1854, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Сторнирование', Граница: 'Верхняя', Номер: 2062, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:164,
			Верх:298,
			Лево:305,
		},
		{
			xtype: 'label',
			id: 'СправкаДругогоСтрахователяОЗаработке1',
			text: 'Справки других страхователей',
			style: 'position:absolute;left:202px;top:480px;width:163px;height:15px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СправкаДругогоСтрахователяОЗаработке1', Граница: 'Левая', Номер: 2098, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 777, Координата: 0},
					Нижняя: { Элемент: 'СправкаДругогоСтрахователяОЗаработке1', Граница: 'Верхняя', Номер: 2098, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:15,
			Ширина:163,
			Верх:480,
			Лево:202,
		},
		{
			xtype: 'label',
			id: 'ЗапросыВПФРиФСС2',
			text: 'Запросы в ПФР и ФСС',
			style: 'position:absolute;left:202px;top:498px;width:163px;height:15px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗапросыВПФРиФСС2', Граница: 'Левая', Номер: 2109, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 777, Координата: 0},
					Нижняя: { Элемент: 'ЗапросыВПФРиФСС2', Граница: 'Верхняя', Номер: 2109, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:15,
			Ширина:163,
			Верх:498,
			Лево:202,
		},
		{
			xtype: 'label',
			id: 'РеестрыПособийФСС3',
			text: 'Реестры (пилотный проект ФСС)',
			style: 'position:absolute;left:202px;top:514px;width:170px;height:15px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РеестрыПособийФСС3', Граница: 'Левая', Номер: 2111, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 777, Координата: 0},
					Нижняя: { Элемент: 'РеестрыПособийФСС3', Граница: 'Верхняя', Номер: 2111, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:15,
			Ширина:170,
			Верх:514,
			Лево:202,
		},
					]
				},
				{
					id: ПерсонифицированныйУчет,
					items:
					[
		{
			xtype: 'label',
			id: 'РегламентированныйПроизводственныйКалендарь1',
			text: 'Производственный календарь',
			style: 'position:absolute;left:218px;top:90px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РегламентированныйПроизводственныйКалендарь1', Граница: 'Левая', Номер: 62, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 2052, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:90,
			Лево:218,
		},
		{
			xtype: 'label',
			id: 'НадписьОтчетностьВФонды',
			text: 'Персонифицированный учет',
			style: 'position:absolute;left:56px;top:0px;width:346px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьОтчетностьВФонды', Граница: 'Левая', Номер: 327, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьОтчетностьВФонды', Граница: 'Верхняя', Номер: 327, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:346,
			Верх:0,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ФормаВводаДанныхСЗВ46',
			text: 'Ввод данных для форм СЗВ',
			style: 'position:absolute;left:425px;top:175px;width:199px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ФормаВводаДанныхСЗВ46', Граница: 'Левая', Номер: 332, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ФормаВводаДанныхСЗВ46', Граница: 'Верхняя', Номер: 332, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:199,
			Верх:175,
			Лево:425,
		},
		{
			xtype: 'label',
			id: 'ПередачаСЗВ4вПФР6',
			text: 'Опись сведений АДВ-6-2',
			style: 'position:absolute;left:88px;top:166px;width:200px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПередачаСЗВ4вПФР6', Граница: 'Левая', Номер: 333, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПередачаСЗВ4вПФР6', Граница: 'Верхняя', Номер: 333, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:200,
			Верх:166,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'СведенияОТрудовомСтажеИЗаработкеСЗВ46',
			text: 'Пачки СЗВ-6 (Сведения о страховом стаже и взносах)',
			style: 'position:absolute;left:88px;top:183px;width:285px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СведенияОТрудовомСтажеИЗаработкеСЗВ46', Граница: 'Левая', Номер: 334, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СведенияОТрудовомСтажеИЗаработкеСЗВ46', Граница: 'Верхняя', Номер: 334, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:285,
			Верх:183,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'АнкетаЗастрахованногоЛица6',
			text: 'Анкета застрахованного лица (АДВ-1)',
			style: 'position:absolute;left:88px;top:132px;width:200px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'АнкетаЗастрахованногоЛица6', Граница: 'Левая', Номер: 335, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'АнкетаЗастрахованногоЛица6', Граница: 'Верхняя', Номер: 335, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:200,
			Верх:132,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'ЗаявлениеОбОбменеДубликатеСтраховогоСвидетельства6',
			text: 'Заявление об обмене (АДВ-2, АДВ-3)',
			style: 'position:absolute;left:88px;top:149px;width:200px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗаявлениеОбОбменеДубликатеСтраховогоСвидетельства6', Граница: 'Левая', Номер: 336, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗаявлениеОбОбменеДубликатеСтраховогоСвидетельства6', Граница: 'Верхняя', Номер: 336, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:200,
			Верх:149,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'ВидыОбщественноПолезнойДеятельности6',
			text: 'Виды общественно полезной деятельности',
			style: 'position:absolute;left:328px;top:474px;width:225px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВидыОбщественноПолезнойДеятельности6', Граница: 'Левая', Номер: 344, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВидыОбщественноПолезнойДеятельности6', Граница: 'Верхняя', Номер: 344, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:225,
			Верх:474,
			Лево:328,
		},
		{
			xtype: 'label',
			id: 'ОснованияИсчисляемогоТрудовогоСтажа6',
			text: 'Основания исчисляемого трудового стажа',
			style: 'position:absolute;left:56px;top:457px;width:225px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОснованияИсчисляемогоТрудовогоСтажа6', Граница: 'Левая', Номер: 345, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОснованияИсчисляемогоТрудовогоСтажа6', Граница: 'Верхняя', Номер: 345, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:225,
			Верх:457,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ОсобыеУсловияТруда6',
			text: 'Особые условия труда',
			style: 'position:absolute;left:56px;top:491px;width:216px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОсобыеУсловияТруда6', Граница: 'Левая', Номер: 346, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОсобыеУсловияТруда6', Граница: 'Верхняя', Номер: 346, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:216,
			Верх:491,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ОснованияВыслугиЛет6',
			text: 'Основания выслуги лет',
			style: 'position:absolute;left:56px;top:474px;width:216px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОснованияВыслугиЛет6', Граница: 'Левая', Номер: 347, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОснованияВыслугиЛет6', Граница: 'Верхняя', Номер: 347, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:216,
			Верх:474,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ТерриториальныеУсловия6',
			text: 'Территориальные условия',
			style: 'position:absolute;left:328px;top:457px;width:210px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ТерриториальныеУсловия6', Граница: 'Левая', Номер: 348, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ТерриториальныеУсловия6', Граница: 'Верхняя', Номер: 348, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:210,
			Верх:457,
			Лево:328,
		},
		{
			xtype: 'label',
			id: 'СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения6',
			text: 'Профессии и должности льготного пенсионного обеспечения',
			style: 'position:absolute;left:328px;top:491px;width:323px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения6', Граница: 'Левая', Номер: 349, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения6', Граница: 'Верхняя', Номер: 349, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:323,
			Верх:491,
			Лево:328,
		},
		{
			xtype: 'label',
			id: 'НадписьОтчеты9',
			text: 'Отчеты',
			style: 'position:absolute;left:56px;top:298px;width:150px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьОтчеты9', Граница: 'Левая', Номер: 490, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьОтчеты9', Граница: 'Верхняя', Номер: 490, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:150,
			Верх:298,
			Лево:56,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы10',
			title: '',
			style: 'position:absolute;left:8px;top:292px;width:684px;height:6px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы10', Граница: 'Верхняя', Номер: 491, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:6,
			Ширина:684,
			Верх:292,
			Лево:8,
		},
		{
			xtype: 'label',
			id: 'НадписьСмТакже15',
			text: 'См. также',
			style: 'position:absolute;left:56px;top:425px;width:177px;height:32px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьСмТакже15', Граница: 'Левая', Номер: 493, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьСмТакже15', Граница: 'Верхняя', Номер: 493, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:32,
			Ширина:177,
			Верх:425,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'СтатистикаКадровОрганизации3',
			text: 'Статистические данные',
			style: 'position:absolute;left:56px;top:363px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СтатистикаКадровОрганизации3', Граница: 'Левая', Номер: 494, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СтатистикаКадровОрганизации3', Граница: 'Верхняя', Номер: 494, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:363,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'СпискиРаботниковОрганизаций3',
			text: 'Списки сотрудников',
			style: 'position:absolute;left:56px;top:346px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпискиРаботниковОрганизаций3', Граница: 'Левая', Номер: 495, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпискиРаботниковОрганизаций3', Граница: 'Верхняя', Номер: 495, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:346,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ПерсонифицированныйУчетПФР1',
			text: 'Журнал документов персонифицированного учета',
			style: 'position:absolute;left:56px;top:90px;width:195px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПерсонифицированныйУчетПФР1', Граница: 'Левая', Номер: 498, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПерсонифицированныйУчетПФР1', Граница: 'Верхняя', Номер: 498, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:195,
			Верх:90,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'СведенияОТрудовомСтажеЗастрахованногоЛицаСЗВК7',
			text: 'Сведения о трудовом стаже (СЗВ-К)',
			style: 'position:absolute;left:88px;top:268px;width:200px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СведенияОТрудовомСтажеЗастрахованногоЛицаСЗВК7', Граница: 'Левая', Номер: 499, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СведенияОТрудовомСтажеЗастрахованногоЛицаСЗВК7', Граница: 'Верхняя', Номер: 499, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:200,
			Верх:268,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'ПередачаДСВвПФР1',
			text: 'Передача заявлений ДСВ-1 в ПФР',
			style: 'position:absolute;left:88px;top:234px;width:200px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПередачаДСВвПФР1', Граница: 'Левая', Номер: 500, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПередачаДСВвПФР1', Граница: 'Верхняя', Номер: 500, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:200,
			Верх:234,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'ПодготовкаДанныхПФР20101',
			text: 'Подготовка данных для ПФР',
			style: 'position:absolute;left:56px;top:48px;width:195px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПодготовкаДанныхПФР20101', Граница: 'Левая', Номер: 527, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПодготовкаДанныхПФР20101', Граница: 'Верхняя', Номер: 527, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:195,
			Верх:48,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'РеестрДСВ31',
			text: 'Реестры по форме ДСВ-3',
			style: 'position:absolute;left:88px;top:251px;width:200px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РеестрДСВ31', Граница: 'Левая', Номер: 573, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РеестрДСВ31', Граница: 'Верхняя', Номер: 573, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:200,
			Верх:251,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'ЗаявлениеДСВ11',
			text: 'Заявление о добровольном вступлении в правоотношения (ДСВ-1)',
			style: 'position:absolute;left:425px;top:132px;width:199px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗаявлениеДСВ11', Граница: 'Левая', Номер: 577, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗаявлениеДСВ11', Граница: 'Верхняя', Номер: 577, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:199,
			Верх:132,
			Лево:425,
		},
		{
			xtype: 'label',
			id: 'ОсновнаяОрганизация',
			text: 'ОсновнаяОрганизация',
			style: 'position:absolute;left:218px;top:0px;width:275px;height:42px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:275,
			Верх:0,
			Лево:218,
		},
		{
			xtype: 'label',
			id: 'СведенияОВзносахИСтраховомСтажеСПВ11',
			text: 'Пачки СПВ-1 (пенсионные формы)',
			style: 'position:absolute;left:88px;top:217px;width:200px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СведенияОВзносахИСтраховомСтажеСПВ11', Граница: 'Левая', Номер: 2086, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СведенияОВзносахИСтраховомСтажеСПВ11', Граница: 'Верхняя', Номер: 2086, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:200,
			Верх:217,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'СведенияОНачисленномЗаработкеСЗВ631',
			text: 'Пачки СЗВ-6-3 (Сведения о начисленном заработке)',
			style: 'position:absolute;left:88px;top:200px;width:284px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СведенияОНачисленномЗаработкеСЗВ631', Граница: 'Левая', Номер: 2104, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СведенияОНачисленномЗаработкеСЗВ631', Граница: 'Верхняя', Номер: 2104, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:284,
			Верх:200,
			Лево:88,
		},
					]
				},
				{
					id: Налоги,
					items:
					[
		{
			xtype: 'label',
			id: 'НадписьНалоги',
			text: 'Налоги и взносы',
			style: 'position:absolute;left:56px;top:0px;width:182px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьНалоги', Граница: 'Левая', Номер: 300, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьНалоги', Граница: 'Верхняя', Номер: 300, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:182,
			Верх:0,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'НадписьОтчеты5',
			text: 'Отчеты',
			style: 'position:absolute;left:56px;top:318px;width:162px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьОтчеты5', Граница: 'Левая', Номер: 302, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьОтчеты5', Граница: 'Верхняя', Номер: 302, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:162,
			Верх:318,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'РасчетСтраховыхВзносов5',
			text: 'Журнал расчета страховых взносов в ПФР, ФОМС и ФСС',
			style: 'position:absolute;left:56px;top:48px;width:196px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетСтраховыхВзносов5', Граница: 'Левая', Номер: 305, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетСтраховыхВзносов5', Граница: 'Верхняя', Номер: 305, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:196,
			Верх:48,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'НДФЛВозвратНалога5',
			text: 'Возврат НДФЛ',
			style: 'position:absolute;left:88px;top:166px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НДФЛВозвратНалога5', Граница: 'Левая', Номер: 306, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НДФЛВозвратНалога5', Граница: 'Верхняя', Номер: 306, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:166,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'НДФЛПерерасчет5',
			text: 'Перерасчет НДФЛ',
			style: 'position:absolute;left:88px;top:183px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НДФЛПерерасчет5', Граница: 'Левая', Номер: 307, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НДФЛПерерасчет5', Граница: 'Верхняя', Номер: 307, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:183,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'РегистрНалоговогоУчетаПоНДФЛ',
			text: 'Регистр налогового учета по налогу на доходы физических лиц',
			style: 'position:absolute;left:340px;top:90px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РегистрНалоговогоУчетаПоНДФЛ', Граница: 'Левая', Номер: 310, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РегистрНалоговогоУчетаПоНДФЛ', Граница: 'Верхняя', Номер: 310, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:90,
			Лево:340,
		},
		{
			xtype: 'label',
			id: 'АнализНачисленныхНалоговИВзносов5',
			text: 'Анализ начисленных налогов и взносов',
			style: 'position:absolute;left:56px;top:366px;width:211px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'АнализНачисленныхНалоговИВзносов5', Граница: 'Левая', Номер: 311, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'АнализНачисленныхНалоговИВзносов5', Граница: 'Верхняя', Номер: 311, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:211,
			Верх:366,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'КарточкаУчетаПоСтраховымВзносам5',
			text: 'Карточка по страховым взносам',
			style: 'position:absolute;left:340px;top:48px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КарточкаУчетаПоСтраховымВзносам5', Граница: 'Левая', Номер: 312, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'КарточкаУчетаПоСтраховымВзносам5', Граница: 'Верхняя', Номер: 312, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:48,
			Лево:340,
		},
		{
			xtype: 'label',
			id: 'ДоходыНДФЛ5',
			text: 'Коды доходов НДФЛ',
			style: 'position:absolute;left:56px;top:457px;width:214px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДоходыНДФЛ5', Граница: 'Левая', Номер: 316, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДоходыНДФЛ5', Граница: 'Верхняя', Номер: 316, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:214,
			Верх:457,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ВычетыНДФЛ5',
			text: 'Вычеты по НДФЛ',
			style: 'position:absolute;left:56px;top:474px;width:214px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВычетыНДФЛ5', Граница: 'Левая', Номер: 317, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВычетыНДФЛ5', Граница: 'Верхняя', Номер: 317, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:214,
			Верх:474,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ДоходыПоСтраховымВзносам5',
			text: 'Способы учета доходов при исчислении страховых взносов',
			style: 'position:absolute;left:56px;top:491px;width:317px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ДоходыПоСтраховымВзносам5', Граница: 'Левая', Номер: 318, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ДоходыПоСтраховымВзносам5', Граница: 'Верхняя', Номер: 318, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:317,
			Верх:491,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'УчетНДФЛиЕСН1',
			text: 'Журнал документов учета НДФЛ, страховых взносов в ПФР, ФСС, ФОМС',
			style: 'position:absolute;left:56px;top:90px;width:253px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УчетНДФЛиЕСН1', Граница: 'Левая', Номер: 470, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УчетНДФЛиЕСН1', Граница: 'Верхняя', Номер: 470, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:253,
			Верх:90,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'НДФЛПодтверждениеПраваНаИмущественныйВычет1',
			text: 'Подтверждение прав на имущественный вычет',
			style: 'position:absolute;left:88px;top:200px;width:247px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НДФЛПодтверждениеПраваНаИмущественныйВычет1', Граница: 'Левая', Номер: 471, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НДФЛПодтверждениеПраваНаИмущественныйВычет1', Граница: 'Верхняя', Номер: 471, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:247,
			Верх:200,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'НадписьСмТакже12',
			text: 'См. также',
			style: 'position:absolute;left:56px;top:425px;width:162px;height:32px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьСмТакже12', Граница: 'Левая', Номер: 475, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьСмТакже12', Граница: 'Верхняя', Номер: 475, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:32,
			Ширина:162,
			Верх:425,
			Лево:56,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы7',
			title: '',
			style: 'position:absolute;left:8px;top:312px;width:684px;height:6px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы7', Граница: 'Верхняя', Номер: 476, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:6,
			Ширина:684,
			Верх:312,
			Лево:8,
		},
		{
			xtype: 'label',
			id: 'АрхивДанныхРегламентированнойОтчетности7',
			text: 'Архив регламентированной отчетности',
			style: 'position:absolute;left:394px;top:457px;width:213px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'АрхивДанныхРегламентированнойОтчетности7', Граница: 'Левая', Номер: 497, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'АрхивДанныхРегламентированнойОтчетности7', Граница: 'Верхняя', Номер: 497, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:213,
			Верх:457,
			Лево:394,
		},
		{
			xtype: 'label',
			id: 'ОбщиеОбъектыРегламентированнойОтчетности',
			text: 'Регламентированные отчеты',
			style: 'position:absolute;left:500px;top:48px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОбщиеОбъектыРегламентированнойОтчетности', Граница: 'Левая', Номер: 526, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОбщиеОбъектыРегламентированнойОтчетности', Граница: 'Верхняя', Номер: 526, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:48,
			Лево:500,
		},
		{
			xtype: 'label',
			id: 'РегламентированнаяФормаСправкаПоДСВ5',
			text: 'Справка по ДСВ',
			style: 'position:absolute;left:500px;top:90px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РегламентированнаяФормаСправкаПоДСВ5', Граница: 'Левая', Номер: 574, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РегламентированнаяФормаСправкаПоДСВ5', Граница: 'Верхняя', Номер: 574, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:90,
			Лево:500,
		},
		{
			xtype: 'label',
			id: 'УстановитьОсновнуюОрганизацию',
			text: 'Установить основную организацию',
			style: 'position:absolute;left:493px;top:0px;width:186px;height:40px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:40,
			Ширина:186,
			Верх:0,
			Лево:493,
		},
		{
			xtype: 'label',
			id: 'РеестрПолучателейСтраховогоОбеспечения5',
			text: 'Реестр получателей страхового обеспечения',
			style: 'position:absolute;left:56px;top:389px;width:238px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РеестрПолучателейСтраховогоОбеспечения5', Граница: 'Левая', Номер: 2085, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РеестрПолучателейСтраховогоОбеспечения5', Граница: 'Верхняя', Номер: 2085, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:238,
			Верх:389,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'РасчетыПоСтраховымВзносам',
			text: 'Расчеты по страховым взносам',
			style: 'position:absolute;left:89px;top:132px;width:186px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РасчетыПоСтраховымВзносам', Граница: 'Левая', Номер: 2089, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РасчетыПоСтраховымВзносам', Граница: 'Верхняя', Номер: 2089, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:186,
			Верх:132,
			Лево:89,
		},
		{
			xtype: 'label',
			id: 'СправкаОЗаработкеДляРасчетаПособий6',
			text: 'Справка о заработке для расчета пособий',
			style: 'position:absolute;left:500px;top:132px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СправкаОЗаработкеДляРасчетаПособий6', Граница: 'Левая', Номер: 2099, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СправкаОЗаработкеДляРасчетаПособий6', Граница: 'Верхняя', Номер: 2099, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:132,
			Лево:500,
		},
		{
			xtype: 'label',
			id: 'СправкаПоНДФЛВНалоговыйОрган5',
			text: 'Справка 2-НДФЛ для передачи в ИФНС',
			style: 'position:absolute;left:88px;top:265px;width:212px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СправкаПоНДФЛВНалоговыйОрган5', Граница: 'Левая', Номер: 2100, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СправкаПоНДФЛВНалоговыйОрган5', Граница: 'Верхняя', Номер: 2100, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:212,
			Верх:265,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'СправкаПоНДФЛСотруднику6',
			text: 'Справка о доходах (2-НДФЛ) для сотрудников',
			style: 'position:absolute;left:88px;top:282px;width:247px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СправкаПоНДФЛСотруднику6', Граница: 'Левая', Номер: 2101, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СправкаПоНДФЛСотруднику6', Граница: 'Верхняя', Номер: 2101, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:247,
			Верх:282,
			Лево:88,
		},
		{
			xtype: 'label',
			id: 'ПеречислениеНДФЛвБюджет',
			text: 'Перечисление НДФЛ в бюджет РФ',
			style: 'position:absolute;left:89px;top:149px;width:189px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПеречислениеНДФЛвБюджет', Граница: 'Левая', Номер: 2103, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПеречислениеНДФЛвБюджет', Граница: 'Верхняя', Номер: 2103, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:189,
			Верх:149,
			Лево:89,
		},
		{
			xtype: 'label',
			id: 'ПодготовкаДанныхПоНДФЛ',
			text: 'Подготовка данных по НДФЛ',
			style: 'position:absolute;left:56px;top:219px;width:195px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПодготовкаДанныхПоНДФЛ', Граница: 'Левая', Номер: 2106, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПодготовкаДанныхПоНДФЛ', Граница: 'Верхняя', Номер: 2106, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:195,
			Верх:219,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'РедактированиеВычетовНаДетей20111',
			text: 'Редактирование вычетов на детей',
			style: 'position:absolute;left:500px;top:203px;width:160px;height:58px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РедактированиеВычетовНаДетей20111', Граница: 'Левая', Номер: 2121, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РедактированиеВычетовНаДетей20111', Граница: 'Верхняя', Номер: 2121, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:58,
			Ширина:160,
			Верх:203,
			Лево:500,
		},
					]
				},
				{
					id: БухУчет,
					items:
					[
		{
			xtype: 'label',
			id: 'НадписьБухгалтерскийУчет',
			text: 'Бухгалтерский учет',
			style: 'position:absolute;left:57px;top:0px;width:245px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьБухгалтерскийУчет', Граница: 'Левая', Номер: 277, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьБухгалтерскийУчет', Граница: 'Верхняя', Номер: 277, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:245,
			Верх:0,
			Лево:57,
		},
		{
			xtype: 'label',
			id: 'ВводСведенийОРеглУчетеПлановыхНачисленийРаботниковОрганизаций4',
			text: 'Постоянные сведения о бухучете зарплаты',
			style: 'position:absolute;left:56px;top:134px;width:162px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводСведенийОРеглУчетеПлановыхНачисленийРаботниковОрганизаций4', Граница: 'Левая', Номер: 282, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводСведенийОРеглУчетеПлановыхНачисленийРаботниковОрганизаций4', Граница: 'Верхняя', Номер: 282, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:162,
			Верх:134,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ВводРаспределенияОсновногоЗаработкаРаботниковОрганизации1',
			text: 'Ежемесячные сведения о бухучете зарплаты',
			style: 'position:absolute;left:56px;top:176px;width:162px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводРаспределенияОсновногоЗаработкаРаботниковОрганизации1', Граница: 'Левая', Номер: 285, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводРаспределенияОсновногоЗаработкаРаботниковОрганизации1', Граница: 'Верхняя', Номер: 285, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:162,
			Верх:176,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'СтатьиЗатрат',
			text: 'Статьи затрат',
			style: 'position:absolute;left:285px;top:48px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СтатьиЗатрат', Граница: 'Левая', Номер: 286, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СтатьиЗатрат', Граница: 'Верхняя', Номер: 286, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:48,
			Лево:285,
		},
		{
			xtype: 'label',
			id: 'ВидыСубконтоХозрасчетные',
			text: 'Виды субконто',
			style: 'position:absolute;left:241px;top:457px;width:120px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВидыСубконтоХозрасчетные', Граница: 'Левая', Номер: 288, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВидыСубконтоХозрасчетные', Граница: 'Верхняя', Номер: 288, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:120,
			Верх:457,
			Лево:241,
		},
		{
			xtype: 'label',
			id: 'Контрагенты4',
			text: 'Контрагенты',
			style: 'position:absolute;left:39px;top:457px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Контрагенты4', Граница: 'Левая', Номер: 289, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Контрагенты4', Граница: 'Верхняя', Номер: 289, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:457,
			Лево:39,
		},
		{
			xtype: 'label',
			id: 'СводНачисленнойЗарплатыОрганизаций4',
			text: 'Свод начисленной зарплаты',
			style: 'position:absolute;left:56px;top:347px;width:243px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СводНачисленнойЗарплатыОрганизаций4', Граница: 'Левая', Номер: 291, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 279, Координата: 0},
					Нижняя: { Элемент: 'СводНачисленнойЗарплатыОрганизаций4', Граница: 'Верхняя', Номер: 291, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:243,
			Верх:347,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'Банки4',
			text: 'Банки',
			style: 'position:absolute;left:56px;top:491px;width:133px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Банки4', Граница: 'Левая', Номер: 297, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Банки4', Граница: 'Верхняя', Номер: 297, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:133,
			Верх:491,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ОтражениеЗарплатыВРеглУчете1',
			text: 'Отражение зарплаты в бухучете',
			style: 'position:absolute;left:56px;top:48px;width:162px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОтражениеЗарплатыВРеглУчете1', Граница: 'Левая', Номер: 461, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОтражениеЗарплатыВРеглУчете1', Граница: 'Верхняя', Номер: 461, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:162,
			Верх:48,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'НадписьСмТакже11',
			text: 'См. также',
			style: 'position:absolute;left:56px;top:425px;width:162px;height:32px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьСмТакже11', Граница: 'Левая', Номер: 463, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьСмТакже11', Граница: 'Верхняя', Номер: 463, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:32,
			Ширина:162,
			Верх:425,
			Лево:56,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы6',
			title: '',
			style: 'position:absolute;left:8px;top:292px;width:682px;height:6px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: 'Форма', Граница: 'Левая', Номер: 0, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы6', Граница: 'Верхняя', Номер: 465, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:6,
			Ширина:682,
			Верх:292,
			Лево:8,
		},
		{
			xtype: 'label',
			id: 'НоменклатурныеГруппы',
			text: 'Номенклатурные группы',
			style: 'position:absolute;left:56px;top:474px;width:133px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НоменклатурныеГруппы', Граница: 'Левая', Номер: 548, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НоменклатурныеГруппы', Граница: 'Верхняя', Номер: 548, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:133,
			Верх:474,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'СпособыОтраженияЗарплатыВРеглУчете',
			text: 'Способы отражения зарплаты в бухучете',
			style: 'position:absolute;left:285px;top:90px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпособыОтраженияЗарплатыВРеглУчете', Граница: 'Левая', Номер: 594, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпособыОтраженияЗарплатыВРеглУчете', Граница: 'Верхняя', Номер: 594, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:90,
			Лево:285,
		},
		{
			xtype: 'label',
			id: 'УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете',
			text: 'Бухучет основного заработка сотрудников',
			style: 'position:absolute;left:56px;top:92px;width:162px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете', Граница: 'Левая', Номер: 2064, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете', Граница: 'Верхняя', Номер: 2064, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:162,
			Верх:92,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'СправкаРасчетОценочныеОбязательства',
			text: 'Справка-расчет оценочных обязательств',
			style: 'position:absolute;left:56px;top:364px;width:243px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СправкаРасчетОценочныеОбязательства', Граница: 'Левая', Номер: 2120, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СправкаРасчетОценочныеОбязательства', Граница: 'Верхняя', Номер: 2120, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:243,
			Верх:364,
			Лево:56,
		},
					]
				},
				{
					id: УчетЗарплаты,
					items:
					[
		{
			xtype: 'label',
			id: 'НадписьОтчеты12',
			text: 'Отчеты',
			style: 'position:absolute;left:56px;top:298px;width:243px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьОтчеты12', Граница: 'Левая', Номер: 1455, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьОтчеты12', Граница: 'Верхняя', Номер: 1455, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:243,
			Верх:298,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ВводСведенийОРеглУчетеПлановыхНачисленийРаботниковОрганизаций5',
			text: 'Постоянные сведения о бухучете зарплаты',
			style: 'position:absolute;left:56px;top:91px;width:162px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводСведенийОРеглУчетеПлановыхНачисленийРаботниковОрганизаций5', Граница: 'Левая', Номер: 1456, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводСведенийОРеглУчетеПлановыхНачисленийРаботниковОрганизаций5', Граница: 'Верхняя', Номер: 1456, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:162,
			Верх:91,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ВводРаспределенияОсновногоЗаработкаРаботниковОрганизации2',
			text: 'Ежемесячные сведения о бухучете зарплаты',
			style: 'position:absolute;left:56px;top:133px;width:162px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводРаспределенияОсновногоЗаработкаРаботниковОрганизации2', Граница: 'Левая', Номер: 1457, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводРаспределенияОсновногоЗаработкаРаботниковОрганизации2', Граница: 'Верхняя', Номер: 1457, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:162,
			Верх:133,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ВидыСубконтоХозрасчетные1',
			text: 'Виды субконто',
			style: 'position:absolute;left:245px;top:466px;width:120px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВидыСубконтоХозрасчетные1', Граница: 'Левая', Номер: 1459, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВидыСубконтоХозрасчетные1', Граница: 'Верхняя', Номер: 1459, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:120,
			Верх:466,
			Лево:245,
		},
		{
			xtype: 'label',
			id: 'Контрагенты5',
			text: 'Контрагенты',
			style: 'position:absolute;left:39px;top:466px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Контрагенты5', Граница: 'Левая', Номер: 1460, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Контрагенты5', Граница: 'Верхняя', Номер: 1460, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:466,
			Лево:39,
		},
		{
			xtype: 'label',
			id: 'СводНачисленнойЗарплатыОрганизаций8',
			text: 'Свод начисленной зарплаты организаций',
			style: 'position:absolute;left:56px;top:347px;width:243px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СводНачисленнойЗарплатыОрганизаций8', Граница: 'Левая', Номер: 1461, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СводНачисленнойЗарплатыОрганизаций8', Граница: 'Верхняя', Номер: 1461, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:243,
			Верх:347,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'Банки5',
			text: 'Банки',
			style: 'position:absolute;left:56px;top:500px;width:133px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Банки5', Граница: 'Левая', Номер: 1462, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Банки5', Граница: 'Верхняя', Номер: 1462, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:133,
			Верх:500,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ОтражениеЗарплатыВРеглУчете2',
			text: 'Отражение зарплаты в бухучете',
			style: 'position:absolute;left:56px;top:49px;width:162px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОтражениеЗарплатыВРеглУчете2', Граница: 'Левая', Номер: 1463, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОтражениеЗарплатыВРеглУчете2', Граница: 'Верхняя', Номер: 1463, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:162,
			Верх:49,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'НадписьСмТакже18',
			text: 'См. также',
			style: 'position:absolute;left:56px;top:425px;width:167px;height:32px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьСмТакже18', Граница: 'Левая', Номер: 1465, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьСмТакже18', Граница: 'Верхняя', Номер: 1465, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:32,
			Ширина:167,
			Верх:425,
			Лево:56,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы12',
			title: '',
			style: 'position:absolute;left:6px;top:292px;width:688px;height:6px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы12', Граница: 'Верхняя', Номер: 1466, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:6,
			Ширина:688,
			Верх:292,
			Лево:6,
		},
		{
			xtype: 'label',
			id: 'Субконто2',
			text: 'Субконто',
			style: 'position:absolute;left:245px;top:483px;width:120px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Субконто2', Граница: 'Левая', Номер: 1467, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Субконто2', Граница: 'Верхняя', Номер: 1467, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:120,
			Верх:483,
			Лево:245,
		},
		{
			xtype: 'label',
			id: 'НоменклатурныеГруппы1',
			text: 'Номенклатурные группы',
			style: 'position:absolute;left:56px;top:483px;width:133px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НоменклатурныеГруппы1', Граница: 'Левая', Номер: 1469, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НоменклатурныеГруппы1', Граница: 'Верхняя', Номер: 1469, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:133,
			Верх:483,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'СпособыОтраженияЗарплатыВРеглУчете1',
			text: 'Способы отражения зарплаты в регл. учете',
			style: 'position:absolute;left:390px;top:466px;width:225px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпособыОтраженияЗарплатыВРеглУчете1', Граница: 'Левая', Номер: 1470, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпособыОтраженияЗарплатыВРеглУчете1', Граница: 'Верхняя', Номер: 1470, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:225,
			Верх:466,
			Лево:390,
		},
		{
			xtype: 'label',
			id: 'СводНачисленнойЗарплаты7',
			text: 'Свод начисленной зарплаты компании',
			style: 'position:absolute;left:316px;top:347px;width:243px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СводНачисленнойЗарплаты7', Граница: 'Левая', Номер: 1471, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СводНачисленнойЗарплаты7', Граница: 'Верхняя', Номер: 1471, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:243,
			Верх:347,
			Лево:316,
		},
		{
			xtype: 'label',
			id: 'СпособыОтраженияЗарплатыВУпрУчете1',
			text: 'Способы отражения зарплаты в управленческом учете ',
			style: 'position:absolute;left:390px;top:483px;width:304px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СпособыОтраженияЗарплатыВУпрУчете1', Граница: 'Левая', Номер: 1473, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СпособыОтраженияЗарплатыВУпрУчете1', Граница: 'Верхняя', Номер: 1473, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:304,
			Верх:483,
			Лево:390,
		},
		{
			xtype: 'label',
			id: 'ОбъектыСтроительства1',
			text: 'Объекты строительства',
			style: 'position:absolute;left:245px;top:501px;width:150px;height:15px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОбъектыСтроительства1', Граница: 'Левая', Номер: 1474, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОбъектыСтроительства1', Граница: 'Верхняя', Номер: 1474, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:15,
			Ширина:150,
			Верх:501,
			Лево:245,
		},
		{
			xtype: 'label',
			id: 'НадписьУчетЗарплаты1',
			text: 'Учет зарплаты',
			style: 'position:absolute;left:57px;top:0px;width:245px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьУчетЗарплаты1', Граница: 'Левая', Номер: 1484, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьУчетЗарплаты1', Граница: 'Верхняя', Номер: 1484, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:245,
			Верх:0,
			Лево:57,
		},
		{
			xtype: 'label',
			id: 'ВводРаспределенияЗаработкаРаботников2',
			text: 'Ежемесячные сведения о распределении заработка сотрудников',
			style: 'position:absolute;left:263px;top:91px;width:162px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ВводРаспределенияЗаработкаРаботников2', Граница: 'Левая', Номер: 1485, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ВводРаспределенияЗаработкаРаботников2', Граница: 'Верхняя', Номер: 1485, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:162,
			Верх:91,
			Лево:263,
		},
		{
			xtype: 'label',
			id: 'ОтражениеЗарплатыВУпрУчете2',
			text: 'Отражение зарплаты в управленческом учете',
			style: 'position:absolute;left:263px;top:49px;width:162px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОтражениеЗарплатыВУпрУчете2', Граница: 'Левая', Номер: 1486, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОтражениеЗарплатыВУпрУчете2', Граница: 'Верхняя', Номер: 1486, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:162,
			Верх:49,
			Лево:263,
		},
		{
			xtype: 'label',
			id: 'УчетЗаработкаРаботников',
			text: 'Учет заработка сотрудников',
			style: 'position:absolute;left:295px;top:162px;width:154px;height:15px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УчетЗаработкаРаботников', Граница: 'Левая', Номер: 1487, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УчетЗаработкаРаботников', Граница: 'Верхняя', Номер: 1487, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:15,
			Ширина:154,
			Верх:162,
			Лево:295,
		},
		{
			xtype: 'label',
			id: 'ОтражениеВУчетеБухгалтерскихРасчетовСПерсоналом',
			text: 'Отражение в учете расчетов с персоналом',
			style: 'position:absolute;left:295px;top:181px;width:148px;height:37px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОтражениеВУчетеБухгалтерскихРасчетовСПерсоналом', Граница: 'Левая', Номер: 1488, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОтражениеВУчетеБухгалтерскихРасчетовСПерсоналом', Граница: 'Верхняя', Номер: 1488, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:37,
			Ширина:148,
			Верх:181,
			Лево:295,
		},
		{
			xtype: 'label',
			id: 'СтатьиЗатрат2',
			text: 'Статьи затрат',
			style: 'position:absolute;left:473px;top:49px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СтатьиЗатрат2', Граница: 'Левая', Номер: 1489, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СтатьиЗатрат2', Граница: 'Верхняя', Номер: 1489, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:49,
			Лево:473,
		},
					]
				},
				{
					id: Персонал,
					items:
					[
		{
			xtype: 'label',
			id: 'ЗаявкаНаОбучение7',
			text: 'Заявка на обучение',
			style: 'position:absolute;left:375px;top:48px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗаявкаНаОбучение7', Граница: 'Левая', Номер: 366, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗаявкаНаОбучение7', Граница: 'Верхняя', Номер: 366, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:48,
			Лево:375,
		},
		{
			xtype: 'label',
			id: 'ПланированиеОбучения7',
			text: 'Планирование обучения',
			style: 'position:absolute;left:375px;top:90px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПланированиеОбучения7', Граница: 'Левая', Номер: 367, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПланированиеОбучения7', Граница: 'Верхняя', Номер: 367, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:90,
			Лево:375,
		},
		{
			xtype: 'label',
			id: 'АттестацииРаботников7',
			text: 'Аттестации сотрудников',
			style: 'position:absolute;left:375px;top:216px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'АттестацииРаботников7', Граница: 'Левая', Номер: 368, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'АттестацииРаботников7', Граница: 'Верхняя', Номер: 368, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:216,
			Лево:375,
		},
		{
			xtype: 'label',
			id: 'УчебныйПлан7',
			text: 'Учебный план',
			style: 'position:absolute;left:375px;top:132px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'УчебныйПлан7', Граница: 'Левая', Номер: 369, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'УчебныйПлан7', Граница: 'Верхняя', Номер: 369, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:132,
			Лево:375,
		},
		{
			xtype: 'label',
			id: 'Опрос7',
			text: 'Опрос',
			style: 'position:absolute;left:533px;top:48px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Опрос7', Граница: 'Левая', Номер: 370, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Опрос7', Граница: 'Верхняя', Номер: 370, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:48,
			Лево:533,
		},
		{
			xtype: 'label',
			id: 'РассылкаАнкет7',
			text: 'Рассылка анкет',
			style: 'position:absolute;left:533px;top:90px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РассылкаАнкет7', Граница: 'Левая', Номер: 371, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РассылкаАнкет7', Граница: 'Верхняя', Номер: 371, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:90,
			Лево:533,
		},
		{
			xtype: 'label',
			id: 'РезультатыАнкетирования7',
			text: 'Результаты анкетирования',
			style: 'position:absolute;left:533px;top:174px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РезультатыАнкетирования7', Граница: 'Левая', Номер: 372, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РезультатыАнкетирования7', Граница: 'Верхняя', Номер: 372, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:174,
			Лево:533,
		},
		{
			xtype: 'label',
			id: 'АнализРезультатовАнкетирования7',
			text: 'Анализ результатов анкетирования',
			style: 'position:absolute;left:245px;top:382px;width:185px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'АнализРезультатовАнкетирования7', Граница: 'Левая', Номер: 373, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 384, Координата: 0},
					Нижняя: { Элемент: 'АнализРезультатовАнкетирования7', Граница: 'Верхняя', Номер: 373, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:185,
			Верх:382,
			Лево:245,
		},
		{
			xtype: 'label',
			id: 'ЗагрузкаРезультатовАнкетирования7',
			text: 'Загрузка результатов анкетирования',
			style: 'position:absolute;left:533px;top:132px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗагрузкаРезультатовАнкетирования7', Граница: 'Левая', Номер: 374, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗагрузкаРезультатовАнкетирования7', Граница: 'Верхняя', Номер: 374, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:132,
			Лево:533,
		},
		{
			xtype: 'label',
			id: 'КурсыОбучения7',
			text: 'Учебные курсы',
			style: 'position:absolute;left:228px;top:457px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КурсыОбучения7', Граница: 'Левая', Номер: 375, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 2056, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'КурсыОбучения7', Граница: 'Верхняя', Номер: 375, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:457,
			Лево:228,
		},
		{
			xtype: 'label',
			id: 'НаборПерсонала7',
			text: 'Набор персонала',
			style: 'position:absolute;left:56px;top:132px;width:132px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НаборПерсонала7', Граница: 'Левая', Номер: 376, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НаборПерсонала7', Граница: 'Верхняя', Номер: 376, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:132,
			Верх:132,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'КадровоеПланирование7',
			text: 'Кадровое планирование',
			style: 'position:absolute;left:56px;top:48px;width:132px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КадровоеПланирование7', Граница: 'Левая', Номер: 377, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'КадровоеПланирование7', Граница: 'Верхняя', Номер: 377, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:132,
			Верх:48,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ЗаявкиКандидатов7',
			text: 'Кандидаты',
			style: 'position:absolute;left:56px;top:174px;width:132px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЗаявкиКандидатов7', Граница: 'Левая', Номер: 378, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ЗаявкиКандидатов7', Граница: 'Верхняя', Номер: 378, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:132,
			Верх:174,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'РезультатИспытательногоСрока7',
			text: 'Результат испытательного срока',
			style: 'position:absolute;left:198px;top:48px;width:150px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РезультатИспытательногоСрока7', Граница: 'Левая', Номер: 380, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РезультатИспытательногоСрока7', Граница: 'Верхняя', Номер: 380, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:150,
			Верх:48,
			Лево:198,
		},
		{
			xtype: 'label',
			id: 'НадписьПерсонал',
			text: 'Персонал',
			style: 'position:absolute;left:56px;top:0px;width:142px;height:48px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьПерсонал', Граница: 'Левая', Номер: 382, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьПерсонал', Граница: 'Верхняя', Номер: 382, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:48,
			Ширина:142,
			Верх:0,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'КонтрольОтветовНаРассылку7',
			text: 'Контроль ответов на рассылку',
			style: 'position:absolute;left:245px;top:400px;width:185px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КонтрольОтветовНаРассылку7', Граница: 'Левая', Номер: 388, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 384, Координата: 0},
					Нижняя: { Элемент: 'КонтрольОтветовНаРассылку7', Граница: 'Верхняя', Номер: 388, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:185,
			Верх:400,
			Лево:245,
		},
		{
			xtype: 'label',
			id: 'СостояниеКадровогоПлана7',
			text: 'Состояние кадрового плана',
			style: 'position:absolute;left:56px;top:346px;width:157px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СостояниеКадровогоПлана7', Граница: 'Левая', Номер: 389, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 384, Координата: 0},
					Нижняя: { Элемент: 'СостояниеКадровогоПлана7', Граница: 'Верхняя', Номер: 389, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:157,
			Верх:346,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ИсполнениеКадровогоПлана7',
			text: 'Исполнение кадрового плана',
			style: 'position:absolute;left:56px;top:364px;width:157px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ИсполнениеКадровогоПлана7', Граница: 'Левая', Номер: 390, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 384, Координата: 0},
					Нижняя: { Элемент: 'ИсполнениеКадровогоПлана7', Граница: 'Верхняя', Номер: 390, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:157,
			Верх:364,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ЭффективностьЗатратНаПривлечение7',
			text: 'Эффективность затрат на привлечение',
			style: 'position:absolute;left:245px;top:346px;width:210px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ЭффективностьЗатратНаПривлечение7', Граница: 'Левая', Номер: 391, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 384, Координата: 0},
					Нижняя: { Элемент: 'ЭффективностьЗатратНаПривлечение7', Граница: 'Верхняя', Номер: 391, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:210,
			Верх:346,
			Лево:245,
		},
		{
			xtype: 'label',
			id: 'КоэффициентТекучестиКадровОрганизаций7',
			text: 'Коэффициент текучести кадров',
			style: 'position:absolute;left:245px;top:364px;width:210px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КоэффициентТекучестиКадровОрганизаций7', Граница: 'Левая', Номер: 392, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 384, Координата: 0},
					Нижняя: { Элемент: 'КоэффициентТекучестиКадровОрганизаций7', Граница: 'Верхняя', Номер: 392, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:210,
			Верх:364,
			Лево:245,
		},
		{
			xtype: 'label',
			id: 'ОценкиКомпетенцийРаботников7',
			text: 'Оценки компетенций сотрудников',
			style: 'position:absolute;left:489px;top:364px;width:185px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОценкиКомпетенцийРаботников7', Граница: 'Левая', Номер: 393, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 384, Координата: 0},
					Нижняя: { Элемент: 'ОценкиКомпетенцийРаботников7', Граница: 'Верхняя', Номер: 393, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:185,
			Верх:364,
			Лево:489,
		},
		{
			xtype: 'label',
			id: 'ПройденныеКурсыОбучения7',
			text: 'Пройденные курсы обучения',
			style: 'position:absolute;left:489px;top:346px;width:184px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПройденныеКурсыОбучения7', Граница: 'Левая', Номер: 395, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 384, Координата: 0},
					Нижняя: { Элемент: 'ПройденныеКурсыОбучения7', Граница: 'Верхняя', Номер: 395, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:184,
			Верх:346,
			Лево:489,
		},
		{
			xtype: 'label',
			id: 'ОтчетПоЗаявкамКандидатов7',
			text: 'Отчет по кандидатам',
			style: 'position:absolute;left:56px;top:382px;width:157px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОтчетПоЗаявкамКандидатов7', Граница: 'Левая', Номер: 396, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 384, Координата: 0},
					Нижняя: { Элемент: 'ОтчетПоЗаявкамКандидатов7', Граница: 'Верхняя', Номер: 396, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:157,
			Верх:382,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'НадписьСмТакже14',
			text: 'См. также',
			style: 'position:absolute;left:56px;top:425px;width:142px;height:32px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьСмТакже14', Граница: 'Левая', Номер: 483, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьСмТакже14', Граница: 'Верхняя', Номер: 483, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:32,
			Ширина:142,
			Верх:425,
			Лево:56,
		},
		{
			xtype: 'fieldset',
			id: 'РамкаГруппы9',
			title: '',
			style: 'position:absolute;left:8px;top:292px;width:682px;height:6px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: 'Форма', Граница: 'Левая', Номер: 0, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РамкаГруппы9', Граница: 'Верхняя', Номер: 484, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:6,
			Ширина:682,
			Верх:292,
			Лево:8,
		},
		{
			xtype: 'label',
			id: 'Вакансии1',
			text: 'Вакансии',
			style: 'position:absolute;left:56px;top:90px;width:132px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Вакансии1', Граница: 'Левая', Номер: 485, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Вакансии1', Граница: 'Верхняя', Номер: 485, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:132,
			Верх:90,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ФизическиеЛица8',
			text: 'Физические лица',
			style: 'position:absolute;left:38px;top:491px;width:150px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ФизическиеЛица8', Граница: 'Левая', Номер: 486, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 2056, Координата: 0},
					Нижняя: { Элемент: 'ФизическиеЛица8', Граница: 'Верхняя', Номер: 486, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:491,
			Лево:38,
		},
		{
			xtype: 'label',
			id: 'РазвитиеКомпетенций1',
			text: 'Развитие компетенций сотрудников',
			style: 'position:absolute;left:489px;top:382px;width:194px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'РазвитиеКомпетенций1', Граница: 'Левая', Номер: 488, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'РазвитиеКомпетенций1', Граница: 'Верхняя', Номер: 488, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:194,
			Верх:382,
			Лево:489,
		},
		{
			xtype: 'label',
			id: 'МедицинскоеСтрахование',
			text: 'Медицинское страхование',
			style: 'position:absolute;left:56px;top:216px;width:132px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'МедицинскоеСтрахование', Граница: 'Левая', Номер: 1677, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'МедицинскоеСтрахование', Граница: 'Верхняя', Номер: 1677, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:132,
			Верх:216,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'ОценкаЭффективностиКадровойСлужбы',
			text: 'Оценка кадровой службы',
			style: 'position:absolute;left:56px;top:400px;width:157px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ОценкаЭффективностиКадровойСлужбы', Граница: 'Левая', Номер: 1784, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ОценкаЭффективностиКадровойСлужбы', Граница: 'Верхняя', Номер: 1784, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:157,
			Верх:400,
			Лево:56,
		},
		{
			xtype: 'label',
			id: 'СценарииПланирования',
			text: 'Сценарии планирования затрат',
			style: 'position:absolute;left:230px;top:174px;width:139px;height:42px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'СценарииПланирования', Граница: 'Левая', Номер: 1785, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СценарииПланирования', Граница: 'Верхняя', Номер: 1785, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:42,
			Ширина:139,
			Верх:174,
			Лево:230,
		},
		{
			xtype: 'label',
			id: 'Должности9',
			text: 'Описания должностей для набора персонала',
			style: 'position:absolute;left:245px;top:491px;width:233px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Должности9', Граница: 'Левая', Номер: 1979, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Должности9', Граница: 'Верхняя', Номер: 1979, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:233,
			Верх:491,
			Лево:245,
		},
		{
			xtype: 'panel',
			id: ПанельПодразделенияПерсонал,
			style: 'position:absolute;left:56px;top:457px;width:150px;height:17px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:150,
			Верх:457,
			Лево:56,
			height: 17,width: 150,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Упр,
					items:
					[
		{
			xtype: 'label',
			id: 'Подразделения7',
			text: 'Подразделения',
			style: 'position:absolute;left:0px;top:0px;width:138px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Подразделения7', Граница: 'Левая', Номер: 2057, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Подразделения7', Граница: 'Верхняя', Номер: 2057, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:138,
			Верх:0,
			Лево:0,
		},
		{
			xtype: 'label',
			id: 'ПодразделенияОрганизаций5',
			text: 'Подразделения',
			style: 'position:absolute;left:0px;top:0px;width:137px;height:17px;text-align:left;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'ПодразделенияОрганизаций5', Граница: 'Левая', Номер: 2058, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'ПодразделенияОрганизаций5', Граница: 'Верхняя', Номер: 2058, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:17,
			Ширина:137,
			Верх:0,
			Лево:0,
		},
					]
				},
				{
					id: Регл,
				},
			]
		},
					]
				},
			]
		},
		{
			xtype: 'panel',
			id: ПанельУчетБухучетЗарплаты,
			style: 'position:absolute;left:335px;top:0px;width:78px;height:39px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:39,
			Ширина:78,
			Верх:0,
			Лево:335,
			height: 39,width: 78,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Регл,
					items:
					[
					]
				},
				{
					id: Упр,
				},
			]
		},
		{
			xtype: 'panel',
			id: ПанельИТС,
			style: 'position:absolute;left:700px;top:38px;width:218px;height:535px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Форма', Граница: 'Нижняя', Номер: 0, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:535,
			Ширина:218,
			Верх:38,
			Лево:700,
			height: 535,width: 218,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Страница1,
					items:
					[
		{
			xtype: 'panel',
			id: ПанельПоискаНаИТС,
			style: 'position:absolute;left:6px;top:6px;width:206px;height:55px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: 'Форма', Граница: 'Левая', Номер: 0, Координата: 0},
					Верхняя: { Элемент: 'Форма', Граница: 'Верхняя', Номер: 0, Координата: 0},
					Нижняя: { Элемент: 'Форма', Граница: 'Верхняя', Номер: 0, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:55,
			Ширина:206,
			Верх:6,
			Лево:6,
			height: 55,width: 206,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Страница1,
					items:
					[
		{
			xtype: 'label',
			id: 'НадписьСтатьиНаСайтеИТС',
			text: 'Статьи на сайте ИТС',
			style: 'position:absolute;left:6px;top:6px;width:194px;height:18px;text-align:center;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'НадписьСтатьиНаСайтеИТС', Граница: 'Левая', Номер: 2114, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'НадписьСтатьиНаСайтеИТС', Граница: 'Верхняя', Номер: 2114, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:18,
			Ширина:194,
			Верх:6,
			Лево:6,
		},
		{
			xtype: 'textfield',
			hideLabel: true,
			disabled: false,
			id: 'СтрокаПоискаИТС',
			width: 167,
			height: 19,
			style: 'position:absolute;left:6px;top:28px;width:167px;height:19px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'СтрокаПоискаИТС', Граница: 'Верхняя', Номер: 2115, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:167,
			Верх:28,
			Лево:6,
		},
		{
			xtype: 'button',
			id: 'КнопкаПоискНаИТСПерсонал',
			text: '',
			style: 'position:absolute;left:177px;top:28px;width:23px;height:19px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'КнопкаПоискНаИТСПерсонал', Граница: 'Левая', Номер: 2116, Координата: 0},
					Левая: { Элемент: '', Граница: 'Правая', Номер: 2115, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'КнопкаПоискНаИТСПерсонал', Граница: 'Верхняя', Номер: 2116, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:19,
			Ширина:23,
			Верх:28,
			Лево:177,
		},
					]
				},
			]
		},
		{
			xtype: 'panel',
			id: ПанельСсылкиНаИТС,
			style: 'position:absolute;left:6px;top:66px;width:206px;height:463px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Нижняя', Номер: 2113, Координата: 0},
					Нижняя: { Элемент: 'Форма', Граница: 'Нижняя', Номер: 0, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:463,
			Ширина:206,
			Верх:66,
			Лево:6,
			height: 463,width: 206,
			tabBar:{hidden:true},
			items:
			[
				{
					id: Страница1,
					items:
					[
		{
			id: 'ТабличноеПолеСписокСсылокНаИТСПерсонал',
			xtype: 'grid',
			style: 'position:absolute;left:6px;top:6px;width:194px;height:451px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: 'Форма', Граница: 'Нижняя', Номер: 0, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:451,
			Ширина:194,
			Верх:6,
			Лево:6,
			height: 451,width: 194,
			columns:
			[
				{
					text:'Представление ссылки',
					width:'100',
					dataIndex:'ПредставлениеСсылки',
					flex:1,
				},
				{
					text:'Гипер ссылка',
					width:'100',
					dataIndex:'ГиперСсылка',
					flex:1,
				},
				{
					text:'Порядок',
					width:'100',
					dataIndex:'Порядок',
					flex:1,
				},
			],
			store:
			{
				autoLoad: true,
				pageSize: 50,
				restful: true,
				autoSync: false,
				proxy: {type: 'jsonp',url: 'https://localhost:1337/Справочники/РабочийСтол/ВыбратьПоСсылке/100', timeout: 200},
				fields:
				[
					{
						name:'Ссылка',
					},
					{
						name:'ПредставлениеСсылки',
					},
					{
						name:'ГиперСсылка',
					},
					{
						name:'Порядок',
					},
				]
			},
			listeners:
			{
				dblclick:
				{
					element: 'body',
					fn: function ()
					{
						var грид = Ext.getCmp('ТабличноеПолеСписокСсылокНаИТСПерсонал');
						var ссылка = грид.getView().getSelectionModel().getSelection()[0].data.Ссылка;
						var Хранилище = грид.store;
						var стрЗнач = Хранилище.findRecord('Ссылка', ссылка).data;
						Ext.require(['Справочники.РабочийСтол.ФормаСобытия'], function ()
						{
							var obj = Ext.create("Справочники.РабочийСтол.ФормаСобытия");
							obj.ПередатьСсылку(стрЗнач);
						});
					}
				}
			},
		},
					]
				},
			]
		},
					]
				},
			]
		},
		{
			xtype: 'checkbox',
			id: 'МатериалыСайтаИТС',
			boxLabel: 'Показывать статьи на сайте ИТС',
			style: 'position:absolute;left:802px;top:5px;width:116px;height:33px;',
			Привязка:
			{
				Горизонтальная: false,
				Вертикальная: false,
				ОбъектПривязки: 
				{
					Правая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Левая: { Элемент: 'Форма', Граница: 'Правая', Номер: 0, Координата: 0},
					Верхняя: { Элемент: 'Форма', Граница: 'Верхняя', Номер: 0, Координата: 0},
					Нижняя: { Элемент: 'Форма', Граница: 'Верхняя', Номер: 0, Координата: 0},
				},
				ОбъектПропорций: 
				{
					Правая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Левая: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Верхняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
					Нижняя: { Элемент: '', Граница: 'Пустая', Номер: -1, Координата: 0},
				},
			},
			Высота:33,
			Ширина:116,
			Верх:5,
			Лево:802,
		},
		],
	}],
	dockedItems:
	[
	]
	});
	listeners:
	{
		resize:
		{
			fn: function (win, width, height, opt)
			{
				var форма = win.down('form');
				if (!форма.ПервоеОткрытие)
				{
					форма.items.each(function (item)
					{
					ПривязкаГраниц(item, item.ПозицияЭлемента);
					if (item.Групповой)
					{
						var элемент = Ext.getCmp(item.id).items.items[0].items.items;
						for (i = 0; i <= элемент.length -1; i += 1) 
						{
							var текЭлемент = элемент[i];
							ПривязкаГраниц(текЭлемент, текЭлемент.ПозицияЭлемента);
						}
					}
					});
				}
			}
		}
	}
});