
using System;
using System.Globalization;
using System.Collections.Generic;
using ServiceStack.ServiceHost;
using ServiceStack.ServiceInterface;
using ServiceStack.ServiceClient.Web;
using V82.Справочники;

namespace V82.Rest.СправочникиТест
{
	public class ДетализацияАналитическогоБаланса:V82.Rest.СправочникиТест.СправочникТест
	{
		public static ДетализацияАналитическогоБалансаЗапрос НайтиПоУникальномуИдентификатору(Guid УникальныйИдентификатор)//ПолучитьПоСсылке,Взять
		{
			var Урл = "http://localhost:1337/Справочники/ДетализацияАналитическогоБаланса/НайтиПоСсылке/"+УникальныйИдентификатор+"?format=json";
			var Клиент = new JsonServiceClient(Урл);
			ДетализацияАналитическогоБалансаЗапрос ДетализацияАналитическогоБалансаЗапрос = null;
			try
			{
				ДетализацияАналитическогоБалансаЗапрос = Клиент.Get(new ДетализацияАналитическогоБалансаЗапрос());
			}
			catch (Exception)
			{
				return null;
			}
			return ДетализацияАналитическогоБалансаЗапрос;
		}
		public static ДетализацияАналитическогоБалансаЗапрос НайтиПоКоду(string Код)
		{
			var Урл = "http://localhost:1337/Справочники/ДетализацияАналитическогоБаланса/НайтиПоКоду/"+Код+"?format=json";
			var Клиент = new JsonServiceClient(Урл);
			ДетализацияАналитическогоБалансаЗапрос ДетализацияАналитическогоБалансаЗапрос = null;
			try
			{
				ДетализацияАналитическогоБалансаЗапрос = Клиент.Get(new ДетализацияАналитическогоБалансаЗапрос());
			}
			catch (Exception)
			{
				return null;
			}
			return ДетализацияАналитическогоБалансаЗапрос;
		}
		public static ДетализацияАналитическогоБалансаЗапрос НайтиПоНаименованию(string Наименование)//ПолучитьПоНаименованию,Взять
		{
			var Урл = "http://localhost:1337/Справочники/ДетализацияАналитическогоБаланса/НайтиПоНаименованию/"+Наименование+"?format=json";
			var Клиент = new JsonServiceClient(Урл);
			ДетализацияАналитическогоБалансаЗапрос ДетализацияАналитическогоБалансаЗапрос = null;
			try
			{
				ДетализацияАналитическогоБалансаЗапрос = Клиент.Get(new ДетализацияАналитическогоБалансаЗапрос());
			}
			catch (Exception)
			{
				return null;
			}
			return ДетализацияАналитическогоБалансаЗапрос;
		}
		public static void ЗаписатьНовый(ДетализацияАналитическогоБалансаЗапрос ДетализацияАналитическогоБалансаЗапрос)//Положить
		{
			var Урл = "http://localhost:1337/Справочники/ДетализацияАналитическогоБаланса?format=json";
			var Клиент = new JsonServiceClient(Урл);
			var ДетализацияАналитическогоБалансаОтвет = Клиент.Post(ДетализацияАналитическогоБалансаЗапрос);
		}
		public static void Записать(ДетализацияАналитическогоБалансаЗапрос ДетализацияАналитическогоБалансаЗапрос)//Обновить
		{
			var Урл = "http://localhost:1337/Справочники/ДетализацияАналитическогоБаланса?format=json";
			var Клиент = new JsonServiceClient(Урл);
			var ДетализацияАналитическогоБалансаОтвет = Клиент.Put(ДетализацияАналитическогоБалансаЗапрос);
		}
		public static void Удалить(ДетализацияАналитическогоБалансаЗапрос ДетализацияАналитическогоБалансаЗапрос)//
		{
			var Урл = "http://localhost:1337/Справочники/ДетализацияАналитическогоБаланса?format=json";
			var Клиент = new JsonServiceClient(Урл);
			var ДетализацияАналитическогоБалансаОтвет = Клиент.Delete(ДетализацияАналитическогоБалансаЗапрос);
		}
	}
}